{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news/",
      "articles": [
        {
          "id": "https://www.freecodecamp.org/news/html-background-image-how-to-add-wallpaper-images-to-your-website/",
          "author": "Ihechikara Vincent Abba",
          "description": "Background images can help beautify websites and make them more attractive to users.  In this article, you'll learn:   * How to add a background image to your website using the CSS background-image     property.   * Other CSS background properties for images. How",
          "link": "https://www.freecodecamp.org/news/html-background-image-how-to-add-wallpaper-images-to-your-website/",
          "publishedOn": "2022-09-23T19:18:19.000Z",
          "wordCount": 1202,
          "title": "HTML Background Image – How to Add Wallpaper Images to Your Website",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/jonatan-pie-3l3RwQdHRHg-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-use-surrealdb-with-fresh-framework/",
          "author": "Rajdeep Singh",
          "description": "SurrealDB is a newly launched database that has recently started gaining popularity in the programming world. SurrealDB was built with the Rust language and was created by Tobie Morgan Hitchcock [https://www.linkedin.com/in/tobiemorganhitchcock/] and Jaime Morgan Hitchcock [https://www.linkedin.com/in/jaimemorganhitchcock/]. SurrealDB's new database comes with many features, but I'm most interested in the Deno",
          "link": "https://www.freecodecamp.org/news/how-to-use-surrealdb-with-fresh-framework/",
          "publishedOn": "2022-09-23T17:51:53.000Z",
          "wordCount": 3329,
          "title": "How to Use SurrealDb with the Fresh Framework and Deno",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Surreal-DB--and-deno-fresh-CMS--4-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-sort-recursively-in-python/",
          "author": "P S Mohammed Ali",
          "description": "When you want to sort a list or array in Python, there are many sorting algorithms you can use.  Some use looping concepts like Insertion Sort, Bubble Sort, and Selection Sort. On the other hand, you can also sort the same list or array using Merge Sort with the",
          "link": "https://www.freecodecamp.org/news/how-to-sort-recursively-in-python/",
          "publishedOn": "2022-09-23T14:35:00.000Z",
          "wordCount": 2092,
          "title": "How to Sort a List Recursively in Python",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/max-harlynking-_QcLpud-gD0-unsplash-1.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/introduction-to-linked-lists-in-python/",
          "author": "Fakorede Damilola",
          "description": "Different programming languages offer different ways to store and access data. Some of the data structures you can use are collections such as arrays, lists, maps, sets, and so on.  These all do an awesome job storing and accessing data, but sometimes you might need something different. Another data",
          "link": "https://www.freecodecamp.org/news/introduction-to-linked-lists-in-python/",
          "publishedOn": "2022-09-22T16:08:05.000Z",
          "wordCount": 2377,
          "title": "Linked Lists in Python – Explained with Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/chain-3481377_1280.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-align-text-in-html/",
          "author": "Joel Olawanle",
          "description": "Text is essential on web pages, as it tells your users what your web page is all about. When you add text to your web page, it dictates the direction and feel of your web page based on your language. For example, by default, English moves from left to right",
          "link": "https://www.freecodecamp.org/news/how-to-align-text-in-html/",
          "publishedOn": "2022-09-22T16:02:44.000Z",
          "wordCount": 1969,
          "title": "How to Align Text in HTML – Text-align, Center, and Justified Example",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/cover-template--8-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-hacking/",
          "author": "Daniel Iwugo",
          "description": "Time to learn the basics of the splendid art of hacking 👨‍💻👩‍💻.  In this article, you will learn what the hacking process really looks like. And hopefully one day, you'll get to say those famous words: “I’m in”. Disclaimer: This is for educational purposes only. Please (with a cherry",
          "link": "https://www.freecodecamp.org/news/what-is-hacking/",
          "publishedOn": "2022-09-22T15:21:49.000Z",
          "wordCount": 2094,
          "title": "What is Hacking? The Hacker Methodology Explained",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/hacker-methodology-image.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/intro-to-algorithms-with-python/",
          "author": "Beau Carnes",
          "description": "Understanding algorithms in an important skill for many computer science jobs. Algorithms help us solve problems efficiently. We just published an introduction to algorithms with Python course on the freeCodeCamp.org YouTube channel. In this course, you'll work with algorithm basics like recursion then go all the way to working with",
          "link": "https://www.freecodecamp.org/news/intro-to-algorithms-with-python/",
          "publishedOn": "2022-09-22T14:36:57.000Z",
          "wordCount": 969,
          "title": "Intro to Algorithms with Python",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/algos_python.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/css-combinators-to-select-elements/",
          "author": "Dillion Megida",
          "description": "Combinators allow you to combine multiple selectors to target specific elements in the DOM. In this article, I'll explain how four of these combinators with examples. In my previous post on CSS Selector Types [/news/how-to-select-elements-to-style-in-css/], I shared seven types of selectors for targetting elements that you want to style. If",
          "link": "https://www.freecodecamp.org/news/css-combinators-to-select-elements/",
          "publishedOn": "2022-09-21T23:17:05.000Z",
          "wordCount": 1717,
          "title": "How to Use CSS Combinators to Select and Style Elements",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/css-combinations.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/git-remove-last-commit-how-to-undo-a-commit-in-git/",
          "author": "Dionysia Lemonaki",
          "description": "Git is a powerful tool and the most popular version control system. It is how developers and technical teams collaborate and work together on projects. But what happens when you accidentally commit a file and realize that you shouldn't have done that because that file contains an error? There is",
          "link": "https://www.freecodecamp.org/news/git-remove-last-commit-how-to-undo-a-commit-in-git/",
          "publishedOn": "2022-09-21T17:42:10.000Z",
          "wordCount": 1979,
          "title": "Git Remove Last Commit – How to Undo a Commit in Git",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/pexels-andrew-neel-2312369.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/generic-pnp-monitor-how-to-fix-windows-10-pc-device-driver/",
          "author": "Kolade Chris",
          "description": "Have you acquired a new monitor only to find out it's not displaying anything from your computer? Or maybe the monitor suddenly stops working? On many occasions, this problem is caused by a faulty generic PNP monitor driver. Apart from driver issues, the monitor might not be working due to",
          "link": "https://www.freecodecamp.org/news/generic-pnp-monitor-how-to-fix-windows-10-pc-device-driver/",
          "publishedOn": "2022-09-21T16:18:08.000Z",
          "wordCount": 1275,
          "title": "Generic PNP Monitor – How to Fix Windows 10 PC Device Driver",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/monitor-1307227_1280.jpg"
        }
      ]
    },
    {
      "title": "DEV Community 👩‍💻👨‍💻",
      "feedUrl": "https://dev.to/feed",
      "siteUrl": "https://dev.to",
      "articles": [
        {
          "id": "https://dev.to/dboatengx/javascript-local-storage-explained-1di6",
          "author": "Boateng Dickson",
          "description": "In the early days of the internet, you needed a server to store data. But nowadays, through LocalStorage, you can store data on browsers and applications without communicating with a back-end server.\nIn this article, you will learn about the theoretical and practical applications of LocalStorage in JavaScript.\nBefore we hop into the real deal, let's look at the definition of web storage. Web storage is one of the great features of HTML5 that allows web applications to store data locally within a user's browser. \nThe two most common forms of web storage are LocalStorage and Session Storage. The key difference between these two forms of web storage is that data saved in LocalStorage never leaves the browser and remains there until you explicitly remove it. In contrast, data stored in Session…",
          "link": "https://dev.to/dboatengx/javascript-local-storage-explained-1di6",
          "publishedOn": "2022-09-24T09:50:58.000Z",
          "wordCount": 2447,
          "title": "JavaScript Local Storage Explained!",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7EkQoo08--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/8bjw43edlrffo5jsfw4v.png"
        },
        {
          "id": "https://dev.to/auraqule/what-is-a-headless-cms-when-should-i-be-using-it-3hlf",
          "author": "Christian Peters",
          "description": "A headless CMS is a content management system that provides a way to create, edit, and deliver content to one or several frontends. Instead of having your content tightly coupled to a particular frontend (like a website or mobile app), it provides your content as data over an API to be served to any frontend.\nA headless CMS is a backend-only content management system, making content accessible via an API for display on any device, without a built-in front-end or presentation layer.\nIt is a content management system that delivers content as data to any platform or device via API, rather than having it tightly coupled to a specific website or mobile app. In practice, this means that teams are able to use a single content repository, or CMS, to deliver content from a single source to endless …",
          "link": "https://dev.to/auraqule/what-is-a-headless-cms-when-should-i-be-using-it-3hlf",
          "publishedOn": "2022-09-24T09:37:49.000Z",
          "wordCount": 2298,
          "title": "What is a headless CMS & when should I be using it?",
          "imageUrl": "https://dev.to/social_previews/article/1201240.png"
        },
        {
          "id": "https://dev.to/codenameone/quiet-quitting-is-about-loyalty-1d6m",
          "author": "Shai Almog",
          "description": "In the past year or so, people started writing about the phenomenon of quiet quitting. It isn’t new, but it somehow became trendy as more people are doing this. This isn’t something I care about as much. People often describe me as a workaholic which is pretty accurate, and I love it. But I totally get the problem that triggers quiet quitting and its root is in a lack of loyalty. A cursory reader might think I’m blaming the employee for lack of loyalty, I am. But loyalty is a two-way street and some employees are merely reflecting something that we’ve been conditioned to accept for the past few decades.\nBack in the days when I formed my consulting company and later on Codename One, I read pretty much every business management book I could find. Back in 2014 I read a rare book in that genre…",
          "link": "https://dev.to/codenameone/quiet-quitting-is-about-loyalty-1d6m",
          "publishedOn": "2022-09-24T09:23:32.000Z",
          "wordCount": 2210,
          "title": "Quiet Quitting is About Loyalty",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--q4JUjQZX--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/xveosj0p7dpgiwggcj4e.png"
        },
        {
          "id": "https://dev.to/baseballhubnet/what-is-a-hold-in-baseball-hold-baseball-definition-update-2022-5boh",
          "author": "baseballhub",
          "description": "What is a Hold in baseball?\nHOLD is a situation that occurs when a relief pitcher enters the game while his team is in the lead. After entering the game, he keeps the lead till the next pitcher enters the game and while maintaining this lead the pitcher also takes one wicket. So, now you know the definition of a HOLD in Baseball.\nWhat is a hold in baseball \nAnother way of hold baseball definition\nThe main job of a relief pitcher is not to get the team to win but rather to hold on to the lead they already have. The relief pitchers are not closed and they know this. Their primary objective is to keep the lead their predecessors have given them. They need to do the same for the next pitcher.\nMeanwhile holding onto the lead if a pitcher successfully scores an out, is called a HOLD or BLOWN SAV…",
          "link": "https://dev.to/baseballhubnet/what-is-a-hold-in-baseball-hold-baseball-definition-update-2022-5boh",
          "publishedOn": "2022-09-24T08:39:24.000Z",
          "wordCount": 2585,
          "title": "What is a hold in baseball. Hold baseball definition (update 2022)",
          "imageUrl": "https://dev.to/social_previews/article/1201854.png"
        },
        {
          "id": "https://dev.to/eazylink/day-4-print-in-order-4fhn",
          "author": "Ezekiel nwuguru",
          "description": "Hey! It's day 4 of I4G 10 days of coding challenge. Today's task was to implement a code that prints in order.\nThought process: \nUnderstanding of problem: My first approach in solving this challenge was to understand the problem. Understanding of the problem paved way for me to brainstorm on possible solutions. The way an operating system schedules a thread varies; we cannot predict the order in which the thread can be executed. The task here is to modify a code such that the first thread is always executed first, the second executed second and so on.\n\n\nSolution: To achieve this, I utilized one of the Java classes called Semaphore. Semaphore helps to restrict the number of threads that can access some (physical or logical) resource. The Semaphore class maintains a set of permits. It utilizes the acquire() method to block further executions until a permit is available. It uses the release() method to give a permit, thus releasing a potentially blocking acquirer. \n\n\nAlgorithm:\n\n\n\n\nCreate two instances of the Semaphore class: semaphore1 and semaphore2\nAdd semaphore1.release() to the end of the first thread\nAdd semaphore1.acquire() to the beginning of the second thread\nAdd semaphore2.release() to the end of the second thread\nAdd semaphore2.acquire() to the beginning of the third thread\nCheck out the full java code here: Print in Order - LeetCode https://leetcode.com/problems/print-in-order/submissions/",
          "link": "https://dev.to/eazylink/day-4-print-in-order-4fhn",
          "publishedOn": "2022-09-24T08:09:17.000Z",
          "wordCount": 1250,
          "title": "DAY 4: Print in order",
          "imageUrl": "https://dev.to/social_previews/article/1201779.png"
        },
        {
          "id": "https://dev.to/dailydevtips1/using-existing-services-in-a-custom-medusa-service-22dn",
          "author": "Chris Bongers",
          "description": "In the previous article, we had an introduction to creating our very first custom medusa service.\nI wanted to expand on that and show you how we can use this custom service for other services.\nFor this article, we'll use the translation service as our base. Inside we'll look at injecting the product service so we can translate products.\nThe main file will stay the same. As we already extend the TransactionBaseService we can use the constructor and assign services via this constructor.\nLet's look at how we can import the product service.\nclass TranslateService extends TransactionBaseService {\n  productService;\n\n  constructor({ productService }) {\n    super();\n    this.productService = productService;\n  }\n}\n\nThis will give us access to the product service.\ntranslateProduct function. This fun…",
          "link": "https://dev.to/dailydevtips1/using-existing-services-in-a-custom-medusa-service-22dn",
          "publishedOn": "2022-09-24T07:16:01.000Z",
          "wordCount": 1669,
          "title": "Using existing services in a custom medusa service",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--MBoyO-9i--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/euydrrzi0chegizyr80l.jpg"
        },
        {
          "id": "https://dev.to/smeetsmeister/how-the-2-minute-rule-improved-my-life-15f2",
          "author": "Jelle Smeets",
          "description": "I am a master procrastinator. I have tried several productivity methods to get me to stop procrastinating. Most of these tools did not work for me. The 2-minute rule however is one of the few that does.\nThe 2-minute rule is crazy simple, and that is why it works. Here is what you need to know.\nHow do you beat procrastination? By taking action. The biggest hurdle is getting started. And once I am started I usually will stick around for a while. This is the power of the 2-minute rule. Created by David Allen in his book Getting things done.\nIf an action will take less than two minutes, it should be done at the moment it’s defined.\nDavid Allen\nWhy does it work? Often the biggest hurdle is to get started. Once you are already active, it's easier to keep going. Like Isaac Newton said: \"An object…",
          "link": "https://dev.to/smeetsmeister/how-the-2-minute-rule-improved-my-life-15f2",
          "publishedOn": "2022-09-24T06:30:23.000Z",
          "wordCount": 1730,
          "title": "How the 2-minute rule improved my life",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--UMLDj0Tn--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/8j6iazfgfvbq21peqvuv.jpg"
        },
        {
          "id": "https://dev.to/dhanushnehru/build-a-breakout-game-4chn",
          "author": "Dhanush N",
          "description": "Hey guys,\nIn this article I will show you how I built a breakout game using HTML canvas, CSS and Javascript. Using a single ball, the player must knock down as many bricks as possible by using the walls and/or the paddle below to hit the ball against the bricks and eliminate them.\nIn this game, you will have 3 lives, and you must hit the ball against the bricks and eliminate them. If you are not able to eliminate the bricks within 3 lives, then your game is over.\nWhy did I want to create this game ?\nI want to familiarise myself with using HTML Canvas and the flexibility of building a game with it.\nSetup for the project\nThis game is best viewed or played on a desktop computer with the help of a mouse pointer.\nLet's start coding !!!\nThe project structure consists of only 3 files.\n|__ style.c…",
          "link": "https://dev.to/dhanushnehru/build-a-breakout-game-4chn",
          "publishedOn": "2022-09-24T06:09:10.000Z",
          "wordCount": 1981,
          "title": "Build a breakout game",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--uZb93lhO--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/e7oessz2t4z4t4yoir7c.png"
        },
        {
          "id": "https://dev.to/mrpaulishaili/heres-how-i-increased-a-website-performance-by-21-7di",
          "author": "Paul C. Ishaili",
          "description": "So for days, I have been keen on how I could possibly increase the performance of this website, then I discovered one very simple and important trick which we will be discussing here.\nI never really enjoyed having to add an svg directly inside amn html file or use an image tag to call it in. My best resort on this has always been the fontwesome cdn until recently when I discovered page performance measure then I realize that calling in the entire fontawesome cdn, for a few icons being used on a multi-paged website is actaully appaling.\nI was browsing through reading a few articles about fontwaesome an loading it locally, then I stumbled on this particular solution whose author actually deserves a shout-out.\nAter reading the solution, I embarked on implementing, with a few quirks which you …",
          "link": "https://dev.to/mrpaulishaili/heres-how-i-increased-a-website-performance-by-21-7di",
          "publishedOn": "2022-09-24T05:05:08.000Z",
          "wordCount": 1680,
          "title": "Here's how I increased a website performance by 21%!",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--c79xfTE_--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ocfd9190y81upos4ahxg.PNG"
        },
        {
          "id": "https://dev.to/roshan_100kar/structure-of-java-program-22li",
          "author": "Roshan Shambharkar",
          "description": "Structure of Java Program\nclass ClassName {\n public static void main(String args[]) {\n //statements\n }\n}\n\nLet's look at the elements involved in the structure of a Java program. \nA typical structure of a Java program contains the following elements:\nclass Block:- Methods and Variables can be written in class Block\nMethods Block:- Statement and instructions written in method block\n*Steps to Create, Complie and execute java Program *\nStpe-1. Write A programm using editor and IDE\nEditor : -\nUsing the above code editor we write programs and save the file using .java extension\nStep-2. Compile the code or complie the java file\nStep-3. excute the class File\nSyntax of print Statements \nSystem.out.println();\n\n\nThis print statement will print the data as push the cursor \nto next line\nSystem.out.print();\nThis Print Statement will print the data and cursor will stay in same line \nNow Write The below code in any editor\nclass MyProgram {\n public static void main(String args[]) {\n System.out.println(\"Hello World!\");\n  }\n}\n\nCommand to complie java program \njavac MyProgram.java\ncommand to excute java program\njava MyProgram\nNote:- To check the version of JDK \njavac -version",
          "link": "https://dev.to/roshan_100kar/structure-of-java-program-22li",
          "publishedOn": "2022-09-24T04:36:40.000Z",
          "wordCount": 1320,
          "title": "Structure of Java Program",
          "imageUrl": "https://dev.to/social_previews/article/1201693.png"
        },
        {
          "id": "https://dev.to/roshan_100kar/how-to-read-a-local-json-file-using-fetch-api-21jh",
          "author": "Roshan Shambharkar",
          "description": "How To Read a local JSON File Using Fetch API\n*Can I use Fetch on a local JSON file? *\nThe standard method that can be used to read\n\n\nJSON files (either locally or uploaded to a server) is the Fetch API.\n\n\nUse the same syntax for both. The only difference is the URL\n\n\n\nFirst Create A .JSON file With name test.json\n{\n\"countries\":[\n{\n   \"name\": \"Indonesia\",\n   \"capital\": \"Jakarata\"\n},\n{\n   \"name\": \"Philippines\",\n   \"capital\": \"Manila\"\n  }\n ]\n}\n\nThen create JavaScript file give name fetch.js\nfetch(\"test.json\")\n.then(response => response.json())\n.then(data => showInfo(data));\n\nfunction showInfo(data) {\nconsole.table(data.countries);\n}",
          "link": "https://dev.to/roshan_100kar/how-to-read-a-local-json-file-using-fetch-api-21jh",
          "publishedOn": "2022-09-24T04:16:10.000Z",
          "wordCount": 1185,
          "title": "How To Read a local JSON File Using Fetch API",
          "imageUrl": "https://dev.to/social_previews/article/1201689.png"
        },
        {
          "id": "https://dev.to/astr0sl0th/create-a-delayed-component-48pp",
          "author": "Joe Hill",
          "description": "Today we are going to learn why I needed to create such component and how I went about doing it with setTimeout() and understanding why Reacts render method works in a synchronous way and how the hooks API can be used to create a delayed list effect.\nSo if you try and do what is in the code example below in React it won't work and render method will wait for setTimeout() to complete by which time all your components will appear in one go and you can't add fancy animation (a list item in this case).\nconst todos = [\n  {\n    name: 'Learn how to create a delayed component',\n    isComplete: false\n  },\n  {\n    name: 'Like this post',\n    isComplete: false\n  },\n  {\n    name: 'Share this post (see what I am getting at here) 😀',\n    isComplete: false\n  }\n];\n\n..and our Todos component (the wrong wa…",
          "link": "https://dev.to/astr0sl0th/create-a-delayed-component-48pp",
          "publishedOn": "2022-09-24T00:25:35.000Z",
          "wordCount": 1670,
          "title": "Create a delayed component",
          "imageUrl": "https://dev.to/social_previews/article/280254.png"
        }
      ]
    },
    {
      "title": "小众软件",
      "feedUrl": "https://feeds.appinn.com/appinns",
      "siteUrl": "https://www.appinn.com",
      "articles": [
        {
          "id": "https://www.appinn.com/?p=43445",
          "author": "青小蛙",
          "description": "前几天有同学在寻找「长按【右箭头键 → 】三倍速播放，松开后恢复（类似B站网页端）」的视频播放器（ https://meta.appinn.net/t/topic/36323 ）。 然后大佬们纷纷献计",
          "link": "https://www.appinn.com/potplayer-fast-forward-ahk/",
          "publishedOn": "2022-09-23T10:34:50.000Z",
          "wordCount": 2418,
          "title": "PotPlayer：长按右箭头键实现三倍速播放[AHK]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/PotPlayer-Fast-forward.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43433",
          "author": "青小蛙",
          "description": "Parallels Desktop 18 是一款高性能的 macOS 虚拟机，可以用来在 Mac 电脑上以运行普通程序的方式，运行 Windows、Linux，甚至再运行一个 macOS 系统，方便随",
          "link": "https://www.appinn.com/parallels-desktop-18-coupon-code/",
          "publishedOn": "2022-09-23T05:23:08.000Z",
          "wordCount": 2400,
          "title": "Parallels Desktop 18 最新优惠码，国庆 75 折",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-23T124329.854.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43417",
          "author": "开发者推荐账号",
          "description": "万彩信息开发过很多款与制作动画相关的软件，如果是我的老粉，应该用过不少他们家的软件，比如万彩动画大师、Focusky动画演示大师、万彩微影，等等。这些软件，都有一个非常明显的特点，就是：简单高效，0基",
          "link": "https://www.appinn.com/animiz09/",
          "publishedOn": "2022-09-22T09:10:32.000Z",
          "wordCount": 2268,
          "title": "万彩特效大师(限时送会员) – 0基础轻松剪辑合成特效动画视频，不用AE也能制作特效大片",
          "enclosure": {
            "url": "https://files.animiz.cn/videoclipmaster/home/demo/award-ceremony.mp4",
            "length": "27968081",
            "type": "video/mp4"
          },
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-22T131005.929.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43416",
          "author": "青小蛙",
          "description": "EPUB Manga Creator 是一款可以把一堆漫画图片打包成 EPUB 格式的在线工具。虽然是在线版本，但内容在浏览器本地处理，无上传，所以可以速度很快，开源。@Appinn 故事是这样的，青",
          "link": "https://www.appinn.com/epub-manga-creator/",
          "publishedOn": "2022-09-22T08:35:57.000Z",
          "wordCount": 2303,
          "title": "EPUB Manga Creator – 把漫画图片打包成 EPUB 格式",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-22T160027.839.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43409",
          "author": "青小蛙",
          "description": "Tab Wrangler 是一款专为不愿关闭浏览器标签页用户准备，帮你自动、定时关闭不常用的标签页，以让你的浏览器看起来正常一些，当然还可以节约内存、节省 CPU 资源。另外被关闭的标签页可以轻松找回",
          "link": "https://www.appinn.com/tab-wrangler/",
          "publishedOn": "2022-09-21T09:02:05.000Z",
          "wordCount": 2286,
          "title": "Tab Wrangler – 倒计时，自动关闭不常用的标签页[Chrome/Firefox]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-21T162457.534.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43404",
          "author": "青小蛙",
          "description": "iOS Ref 是一个为 iOS 开发者提供一站式的硬件数据参考网站，比如历代 iPhone、iPad 屏幕分辨率、支持的最低系统、Swift 版本、内存与 CPU 等信息。@Appinn 事情是这样",
          "link": "https://www.appinn.com/ios-ref/",
          "publishedOn": "2022-09-21T03:38:46.000Z",
          "wordCount": 2302,
          "title": "iOS Ref – iOS 开发者一站式系统、硬件数据指南",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-21T113605.261.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43393",
          "author": "青小蛙",
          "description": "KikoPlay 是一款全功能的弹幕播放器，开源。主要功能就是在播放本地视频的同时，显示网络弹幕，支持从 A 站、B 站、动画疯、Dandan、爱奇艺、腾讯视频、Tucao 获取弹幕。另外还能获取动画",
          "link": "https://www.appinn.com/kikoplay/",
          "publishedOn": "2022-09-20T05:12:38.000Z",
          "wordCount": 2307,
          "title": "KikoPlay – 播放本地视频，显示网络弹幕（ A 站、B 站、动画疯、Dandan、爱奇艺、腾讯视频、Tucao）[Windows]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-20T115702.906.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43382",
          "author": "青小蛙",
          "description": "ArchiveWeb.page 是一款可以将浏览过的网页完整的录下来的 Chrome 扩展，可保存下高保真度的网页存档，包括外部资源，使用起来就像联网使用一样。@Appinn 青小蛙专门对比测试了一下",
          "link": "https://www.appinn.com/archiveweb-page/",
          "publishedOn": "2022-09-19T08:30:41.000Z",
          "wordCount": 2343,
          "title": "ArchiveWeb.page – 将浏览过的网页完整「录」下来，做网页的 “PDF” 格式。",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-19T160916.307.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43376",
          "author": "青小蛙",
          "description": "SGNetworkTest 是一款由 Surge 发布的开源网络延迟测速工具，主要用来「评估 Surge 是否按预期正常工作，也可使用该工具与协议的官方客户端进行对比，确认 Surge 对代理协议的实",
          "link": "https://www.appinn.com/sgnetworktest/",
          "publishedOn": "2022-09-19T04:24:30.000Z",
          "wordCount": 2298,
          "title": "Surge 发布开源网络延迟测速工具：SGNetworkTest",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-19T121700.188.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43369",
          "author": "青小蛙",
          "description": "图形方格纸 MyGraphPaper 是一款自定义纸张模板的网页，主要用来制作各种大小的田字格/拼音、作业本、信纸、分镜表等模板，并用来打印。免费，高自定义（纸张大小、方向、边框、留白、标题、横线等等",
          "link": "https://www.appinn.com/mygraphpaper/",
          "publishedOn": "2022-09-18T06:58:20.000Z",
          "wordCount": 2295,
          "title": "图形方格纸 MyGraphPaper – 免费、可自定义的纸张模板、方格笔记本、打印纸",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-18T144250.466.jpg"
        }
      ]
    },
    {
      "title": "Linux 中国◆开源社区",
      "feedUrl": "https://linux.cn/rss.xml",
      "siteUrl": "https://linux.cn/",
      "articles": [
        {
          "id": "https://linux.cn/article-15065-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "开源库 GObject 和 libsoup 做了很多工作，因此你可以专注于使用 C 语言开发神奇的应用。\n\r\n\r\nGLib 对象系统Object System（GObject）是一个为 C 语言提供灵活且可扩展的面向对象框架的库。在这篇文章中，我将使用该库的 2.4 版本进行演示。\n\r\nGObject 库继承了 ANSI C 标准，拥有一些常见的数据类型，例如：\n\r\n\r\ngchar：字符型\n\r\nguchar：无符号字符型\n\r\ngunichar：32 位定宽 Unicode 字符型\n\r\ngboolean：布尔型\n\r\ngint8、gint16、gint32、gint64：有符号 8、16、32 和 64 位整数\n\r\nguint8、guint16、guint32、guint64：无符号 8、16、32 和 64 位整数\n\r\ngfloat：IEEE 754 标准单精度浮点数\n\r\ngdouble：IEEE 754 标准双精度浮点数\n\r\ngpointer：泛指针\n\r\n\r\n函数指针\n\r\nGObject 库还引入了类和接口的类型和对象体系。之所以可以，是因为 ANSI C 语言可以理解函数指针。\n\r\n你可以这样做来声明函数指针：\n\r\nvoid (*my_callback)(gpointer data);\r\n\n\r\n首先，你需要给变量 my_callback 赋值：\n\r\nvoid my_callback_func(gpointer data)\r\n{\r\n  //do something\r\n}\r\n\r\nmy_callback = my_callback_func;\r\n\n\r\n函数指针 my_callback 可以这样来调用：\n\r\ngpointer data;\r\ndata = g_malloc(512 * sizeof(gint16));\r\nmy_callback(data);\r\n\n\r\n对象类\n\r\nGO…",
          "link": "https://linux.cn/article-15065-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-24T06:52:20.000Z",
          "wordCount": 908,
          "title": "使用开源库 GObject 和 libsoup 提升 C 语言编程能力",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15064-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "RDNA 2 GPU 的 Linux 用户可以使用 AMD 的 AMDVLK GPUOpen 开源 Vulkan 驱动程序。\n\r\n\r\n用于 Radeon RX 6000 GPU 的 AMDVLK GPUOpen 图形驱动程序在过去一周改进了对 64 位光线追踪的支持。这涵盖了支持 RDNA 2 图形的 APU 以及桌面/移动 GPU。所有平台上的所有 AMD Vulkan 驱动程序现在都支持硬件光线追踪，包括 Mesa3D RADV、AMDVLK GPUOpen 和 AMDGPU-PRO。\n\r\nGPU 光线追踪库（GPURT）的基础是一个 C++ 接口。根据其用法和依赖关系，公共接口被拆分为各种头文件。用户可以在官方的 GitHub 仓库上了解更多信息，它还包括了 RDNA 2 GPURT 的结构细分。最新的 AMDVLK GPUOpen v-2022.Q3.4 信息如下：\n\r\n更新和新功能：\n\r\n\r\n扩展 Navi2x 的 64 位光线追踪功能。\n\r\n将 Vulkan 标头升级到版本 1.3.225\n\r\n游戏性能优化，包括《荣耀战魂》和《奇点灰烬》\n\r\n\r\n已解决的问题：\n\r\n\r\ndEQP-VK.api.copy_and_blit.*.resolve_image.whole_copy_before_resolving_transfer.* 新版本 CTS 失败。\n\r\ndEQP-VK.pipeline.creation 缓存控件有一个 CTS 警告。\n\r\nUbuntu 22.04 上的 Firefox 损坏\n\r\nVulkanInfo 崩溃，管道缓存已停用\n\r\nRX 6800 上的 RGP 测试套件故障\n\r\n\r\n新的改进包括 GPU 光线追踪库（GPURT），它将包括使用 HLSL 之类的着色器在光线追踪中看到的边界体积层次（BVH）的构造和排序处理。这个库将提供一个标准库来改进图形渲染并引入更多的统一性。DirectX 12 DXR 也将与新库一起使用。\n\r\n对 GPU 光线追踪（GPURT）库的描述为“一个静态库（源代码交付），为支持 DXR（DirectX 12）和 Vulkan® RT API 的 AMD 驱动程序提供与光线追踪相关的功能。” 该公司的平台抽象库用于构建库（PAL）。\n\r\n用户可参考最新 AMDVLK GPUOpen v-2022.Q3.4 升级的安装说明。用户在更新任何软件、硬件或驱动程序之前应备份所有相关数据，以免丢失重要文件。\n\r\n为了让最新的 Linux 驱动程序为 AMD、Intel 和 NVIDIA 技术做好准备，已经投入了大量工作，这些技术都是在今年第一季度推出的。\n\r\n\r\nvia: https://www.opensourceforu.com/2022/09/amds-open-source-vulkan-graphics-drivers-now-enable-ray-tracing/\n\r\n作者：Laveesh Kocher 选题：lkxed 译者：littlebirdnest 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15064-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-24T03:01:26.000Z",
          "wordCount": 556,
          "title": "AMD 的开源图形驱动程序 Vulkan 现在支持光线追踪",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15063-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "一些已知的、或鲜为人知的事情 —— 这里有 20 件关于 Linux 内核创造者 Linus Torvalds 的趣事。\n\r\n\r\n\n\r\nLinus Benedict Torvalds（林纳斯·本纳第克特·托瓦兹），在 1991 年还是一名攻读硕士的芬兰学生时，他开发了一个类 Unix 操作系统。从那时起，它引发了一场革命：今天，它为大多数 Web 服务器、许多嵌入式设备和 500 强超级计算机 中的每一台提供支持。\n\r\n我已经写过一些鲜为人知的 关于 Linux 的事实，但这篇文章不是关于 Linux 的，而是关于它的创造者，Linus Torvalds。\n\r\n通过阅读他的传记《只是为了好玩Just for Fun》，我了解了有关 Torvalds 的许多事情。如果你有兴趣，你也可以 订购一本传记。（这是一个 受益推荐 链接。）\n\r\n关于 Linus Torvalds 的 20 个有趣事实\n\r\n你可能已经知道一些关于 Linus 的事情，但是通过阅读这篇文章，你很有可能会了解一些关于他的新趣事。\n\r\n1、以诺贝尔奖获得者的名字命名\n\r\nLinus Benedict Torvalds 于 1969 年 12 月 28 日出生于赫尔辛基。他来自一个记者家庭。他的父亲 Nils Torvalds 是芬兰政治家，可能是未来参加选举的总统候选人。\n\r\n他的名字来自于诺贝尔化学与和平奖的双奖获得者 Linus Pauling 的名字。\n\r\n2、世界上所有的 Torvalds 都是亲戚\n\r\n虽然你可能会找到几个名字为 Linus 的人，但你不会找到很多姓 Torvalds 的人 —— 因为“正确”的拼写实际上是 Torvald（没有 s）。他的祖父将名字从 Torvald 改为 Torvalds，并在末尾添加了一个“s”。于是，Torvalds 王朝（如果我可以这么称呼它的话）开始了。\n…",
          "link": "https://linux.cn/article-15063-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-23T09:01:42.000Z",
          "wordCount": 779,
          "title": "关于 Linux 和 Git 的创造者 Linus Torvalds 的 20 件趣事",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15062-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "微软 Azure CTO 称 C/C++ 应该被废弃\n\r\n他在 Twitter 发表了个人观点：“是时候停止用 C/C++ 启动任何新项目了，在那些需要非 GC 语言的场景中使用 Rust。为了安全和可靠性，行业应该宣布这些语言被废弃。”这并不是微软第一次倡导将 Rust 作为提高软件安全的一种手段。三年前，微软安全响应中心（MSRC）表示，“我们认为 Rust 代表了目前 C 和 C++ 的最佳替代品。……MSRC 分配了 CVE 编号的安全问题中，大约有 70% 是内存安全问题。这意味着，如果该软件是用 Rust 编写的，这些内存安全问题很可能已经被消除了。”\n\r\n\r\n消息来源：Dev Class\n\r\n\r\n\r\n老王点评：Rust 是一个很有希望，但是仍然不够成熟和完善的语言，不过，C/C++ 程序员们可以开始学了。\n\r\n\r\n\n\r\nMozilla 发布报告指责操作系统与浏览器的锁定\n\r\n浏览器市场份额已经急剧减少的 Mozilla 最近发布研究报告，整篇报告并未有什么新的证据和观点。在报告中，Mozilla 警告说，“浏览器市场的竞争对于确保创新和消费者的选择至关重要，更广泛地说，保护开放网络的活力，防止商业巨头试图封锁它。”并称，“相比之下，来自独立浏览器的竞争可以帮助推动新的功能，以及在隐私和安全等领域的创新”。\n\r\n\r\n消息来源：Tech Crunch\n\r\n\r\n\r\n老王点评：首先，请把 Firefox 做好，而不是指责别人借助优势扩大份额吧。\n\r\n\r\n\n\r\n被忽视 15 年的 Python 漏洞导致 35 万项目陷入风险\n\r\n早在 2007 年，就已经有安全研究人员披露了一个 Python 的安全风险，并得到了编号 CVE-2007-4559。遗憾的是，它一直没有获得正式的修复补丁。唯一的缓解措施，也只是在更新后的开发者文档中提示了相关风险。今年早些时候，一位安全研究人员在调查另一个安全问题时，再次发现该漏洞可用于代码执行。该漏洞位于 Python tarfile 包中，预估有超过 35 万个存储库易受该漏洞攻击的影响，且其中不乏重要项目，如 GitHub Copilot。\n\r\n\r\n消息来源：Bleeping Computer\n\r\n\r\n\r\n老王点评：又一个开源供应链安全漏洞。任何一个不起眼的小漏洞都可能引起大坝崩溃。",
          "link": "https://linux.cn/article-15062-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-23T04:25:29.000Z",
          "wordCount": 501,
          "title": "硬核观察 #768 微软 Azure CTO 称 C/C++ 应该被废弃",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15061-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "使用 Python 中的 scaffold 和 click 库，你可以将一个简单的实用程序升级为一个成熟的命令行界面工具。\n\r\n\r\n\n\r\n在我的职业生涯中，我写过、用过和看到过很多随意的脚本。一些人需要半自动化完成任务，于是它们诞生了。一段时间后，它们变得越来越大。它们在一生中可能转手很多次。我常常希望这些脚本提供更多的命令行工具式的感觉。但是，从一次性脚本到合适的工具，真正提高质量水平有多难呢？事实证明这在 Python 中并不难。\n\r\n搭建骨架脚本\n\r\n在本文中，我将从一小段 Python 代码开始。我将把它应用到 scaffold 模块中，并使用 click 库扩展它以接受命令行参数。\n\r\n#!/usr/bin/python\r\n\r\nfrom glob import glob\r\nfrom os.path import join, basename\r\nfrom shutil import move\r\nfrom datetime import datetime\r\nfrom os import link, unlink\r\n\r\nLATEST = 'latest.txt'\r\nARCHIVE = '/Users/mark/archive'\r\nINCOMING = '/Users/mark/incoming'\r\nTPATTERN = '%Y-%m-%d'\r\n\r\ndef transmogrify_filename(fname):\r\n    bname = basename(fname)\r\n    ts = datetime.now().strftime(TPATTERN)\r\n    return '-'.join([ts, bname])\r\n\r\ndef set_current_latest(file):\r\n    latest = join(ARCHIVE, LATEST)\r\n    …",
          "link": "https://linux.cn/article-15061-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-23T01:34:00.000Z",
          "wordCount": 876,
          "title": "将你的 Python 脚本转换为命令行程序",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15060-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "随着技术的进步，企业，无论大小，都必须将自己转变为数字公司。转型不再是“选择”的问题；相反，它是关于“如何”推进过渡。这就是 AIOps 的用武之地。\n\r\n\r\n将组织转变为数字公司会遇到很多挑战。缺乏专门的 IT 技能、组织变革管理、不断变化的客户需求和混合环境只是其中的一小部分。企业需要增强其 IT 运营（ITOps）以应对这些挑战并满足客户期望。\n\r\n数字化转型：AIOps 之路\n\r\n未来，ITOps 将结合算法和人工智能，使 IT 系统的性能变得透明，并帮助他们提供无缝体验。\n\r\n\r\n“AIOps 对 IT 运营的长期影响将是变革性的。” —— Gartner\n\r\n\r\nAIOps 对于成功的数字化转型至关重要，可以帮助系统以现代业务所需的速度运行。反过来，这将确定公司获得和保持市场领先地位的速度。\n\r\n现代 AIOps 技术在本地、云端或混合环境中提供 IT 基础架构。它们的自动化使开发人员能够专注于设计下一代业务应用，而不必担心底层基础设施。\n\r\n什么是 AIOps？\n\r\nAIOps 结合人工智能和机器学习来分析 IT 运营的数据。这是将人工智能应用于 IT 运营的过程。它可以帮助组织主动检测错误，还可以帮助运营团队在问题影响最终用户之前预防问题。\n\r\n传统的 IT 管理技术已经无法应对数字化业务转型。当 Gartner 创造 AIOps 一词时，该公司预测 IT 运营过程将发生重大变化，组织管理其 IT 生态系统的方式也会发生巨大变化。\n\r\nAIOps 平台使用大数据。他们从各种 IT 运营和设备收集数据，以自动识别和实时响应问题，同时仍提供传统的历史分析。然后，AIOps 使用机器学习对组合的 IT 数据执行综合分析。\n\r\n结果是自动化驱动的洞察力驱使持续改进和修复。AIOps 支持基本 IT 功能的持续集成和部署 （CI/CD）。\n\r\nAIOps 的范围是什么？\n\r\n开始使用 AIOps 最初似乎具有挑战性，因此最好采取循序渐进的方法。我们需要从识别和理解 IT 运营数据开始。 AIOps 的核心是数据驱动。因此，它需要访问所有相关的操作数据，包括非结构化数据、日志、指标、实时数据、API 输出和设备数据。还需要结构化的业务数据，例如数据库、社交活动和其他关系数据。 AIOps 平台处理的相关数据越多，他们的预测就越准确。\n\r\n企业需要了解他们的数据如何帮助他们解决最大的问题，无论他们身处哪个行业。他们应该实施 AIOps 来回顾他们过去的失败，并确定哪些数据将帮助他们找到解决方案。\n\r\n数据分析可用于查找中断或系统变慢的根源。然后 AIOps 平台可用于检测常见问题及其补救措施。企业可以使用收集到的结果来实施机器学习和 AI，以进行实时监控和自动响应。这整个过程帮助公司推动 AI 成熟，有效地修复错误，避免停机，提高效率。\n\r\n\n\r\n为什么 2022 年需要 AIOps？\n\r\n随着企业加快数字化转型，应用程序和系统架构变得非常先进。我们可以通过以下几种方式见证这种复杂性：\n\r\n\r\n组织正在从传统的应用架构转移到云原生、灵活和基于微服务的容器化应用堆栈。\n\r\n这些应用也部署在本地、混合、公共和私有云平台上。\n\r\n\r\n随着应用和 IT 环境的扩展，它们会产生大量数据。 IT 运营团队因无法管理的数据而筋疲力尽。但是，人工智能可以处理大量数据。随着数据量的扩大，将人工智能纳入 IT 流程的机会要大得多。\n\r\n异常检测、分类和预测都可以通过使用机器学习和深度学习模型来完成，这些模型擅长分析海量数据并提供分析。AIOps 的许多功能可帮助公司通过交互式仪表盘提供良好的用户体验。\n\r\n实施 AIOps 的企业报告了诸如无缝体验、更低的运营费用、更快的客户服务、更短的平均解决时间和更少的停机时间等好处。 AIOps 通过基于预测分析做出坚定的决策来支持 IT 运营。\n\r\n最后一点\n\r\nAIOps 是 IT 运营分析（ITOA）的下一步。 人工智能、认知技能和 RPA（机器人流程自动化）用于在基础设施或 IT 运营问题成为问题之前自动修复它们。 自我修复系统是 AIOps 的最终目标。\n\r\n\r\nvia: https://www.opensourceforu.com/2022/09/get-ready-to-embrace-the-aiops-era/\n\r\n作者：Amit Shingala 选题：lkxed 译者：geekpi 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15060-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-23T00:35:11.000Z",
          "wordCount": 552,
          "title": "准备好迎接 AIOps 时代",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15059-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "史上最贵开发的游戏《星际公民》已筹集五亿美元\n\r\n《星际公民Star Citizen》游戏开发了十年，至今仍处于 Alpha 阶段，虽然现在也可以进行游戏了。它筹集的资金突破了五亿美元，是至今为止开发费用 最昂贵的游戏，远超其它开放世界 3A 游戏，如《赛博朋克 2077》等。它于 2012 年在 Kickstarter 上成功众筹，原计划 2014 年交付。但众筹结束后，该游戏以开发并销售游戏内虚拟物品的名义继续募资。2018 年它筹集到 2 亿美元，如今已突破 5 亿美元，\n\r\n\r\n消息来源：RSI\n\r\n\r\n\r\n老王点评：这莫非是一种“滚动式开发”的游戏？不过我看了图都觉得不错，有没有玩过的朋友来说说这游戏怎么样，值吗？\n\r\n\r\n\n\r\n图片网站禁止上传 AI 生成的图像\n\r\n过去几个月，自然语言图像生成模型如 DALL-E 产生了一批令人称奇的艺术图像，部分艺术家随后将这类 AI 图像上传到图像销售网站销售。但由于 AI 图像是在现有图像的基础上生成的，一些图片网站称，出于版权方面的担忧禁止了此类内容。Getty 图片社是最新一个做出类似决定的平台，而 Shutterstock 尚未禁止此类内容，但限制了对 AI 图像的搜索。\n\r\n\r\n消息来源：Solidot\n\r\n\r\n\r\n老王点评：我觉得更大的原因是，这类 AI 图片可能会断了这些图片销售网站的根吧。以后大家都用 AI 来生成，谁还买图片。这种阻挡只是螳臂当车，AI 图片肯定会迅速流行开。\n\r\n\r\n\n\r\n微软将 systemd 引入 WSL\n\r\n通过与 Canonical 深度合作，微软今日宣布了 Windows 中的 Linux 子系统 WSL2 的一项功能更新，它现可在兼容的 Linux 发行版（如 Ubuntu）中运行 systemd 来管理服务。为此，WSL2 做了若干重要修改，更改了 WSL 在启动时的行为方式，因此微软建议谨慎地将之应用于现有的 WSL 发行版。\n\r\n\r\n消息来源：微软\n\r\n\r\n\r\n老王点评：一直以来 systemd 没有进入 WSL，可以说既不意外，也有点意外。",
          "link": "https://linux.cn/article-15059-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-22T09:19:10.000Z",
          "wordCount": 495,
          "title": "硬核观察 #767 史上最贵开发的游戏《星际公民》已筹集五亿美元",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15058-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Podman Desktop 是一个开源 GUI 应用，用于在 Linux、macOS 和 Windows 上管理容器。\n\r\n\r\n从历史上看，开发人员一直使用 Docker Desktop 对容器进行图形化管理。这适用于那些安装了 Docker Daemon 和 Docker CLI 的人。然而，对于那些使用无守护进程的 Podman 工具的人来说，虽然有一些 Podman 前端，如 Pods、Podman desktop companion 和 Cockpit，但没有官方应用。现在不是这种情况了。有了 Podman Desktop！\n\r\n本文将讨论由红帽和其他开源贡献者开发的 Podman Desktop 的特性、安装和使用。\n\r\n安装\n\r\n要在 Fedora Linux 上安装 Podman Desktop，请访问 podman-desktop.io，然后单击 “Download for Linux” 按钮。你将看到两个选项：Flatpak 和 zip。在这个例子中，我们使用的是 Flatpak。单击 “Flatpak” 链接后，通过双击文件在 GNOME 软件中打开它（如果你使用的是 GNOME）。你也可以通过终端安装它：\n\r\nflatpak install podman-desktop-X.X.X.flatpak\r\n\n\r\n在上面的命令中，将 X.X.X 替换为你下载的特定版本。如果你下载了 zip 文件，那么解压缩存档，然后启动 Podman Desktop 应用的二进制文件。你还可以通过进入 GitHub 上项目的 发布 页找到预发布版本。\n\r\n特性\n\r\nPodman Desktop 仍处于早期阶段。然而，它支持许多常见的容器操作，如创建容器镜像、运行容器等。此外，你可以在 “首选项Preferences” 的 “扩展Extensions” 部分下找到 Podma…",
          "link": "https://linux.cn/article-15058-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-22T07:53:52.000Z",
          "wordCount": 686,
          "title": "使用 Podman Desktop 在 Fedora Linux 上管理容器",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15057-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "这是 GNOME “文件”中的“新建文件”功能，它为你提供了一种创建文档和文件的新方法。让我们看一看。\n\r\n\r\n无需在后端进行更多调整。通过“文件Files”（又名 Nautilus）中的上下文菜单创建新文档/新文件的最令人期待的功能终于到来了。\n\r\n作为 谷歌编程之夏 2022 的一部分，（由 Ignacy Kuchciński 开发的）这个新功能最近经过审查并合并到 “文件” 的主分支中。\n\r\n它看起来如何\n\r\n当你右键单击文件时，上下文菜单有一个新选项“新建文件New File”。\n\r\n\n\r\nGNOME “文件”中的“新建文件New File”选项启动一个操作窗口，如下图所示。\n\r\n\n\r\n当它启动上述对话框时，会在后台发生一些事情。\n\r\n你可能知道你可以在主目录中创建一个带有模板的 Template 文件夹，以便轻松访问常用的文档类型。因此，GNOME “文件” 会检查你是否有该目录。\n\r\n如果当前存在一个带有模板的 Template 目录，你能通过那些文档类型的列表以创建新文档。\n\r\n\n\r\n如果你没有任何模板（很可能），GNOME “文件”会扫描你的系统并根据系统中已安装的应用程序显示常见文件类型的列表。\n\r\n例如，文本编辑器、LibreOffice 文档类型（电子表格、演示文稿）等。\n\r\n这里还发生了一些其他事情。当你为新文档选择文件类型时，系统会选择默认的文件扩展名。这是文件名文本框中的受保护标签。\n\r\n此外，如果你没有安装任何模板或任何应用程序，则根本不会显示“新建文件”菜单选项。\n\r\n未来路线图\n\r\n开发人员还提出了未来对该功能的增强，更大程度地扩展其功能。\n\r\n当没有可用的模板时，对话框将如下所示。它将允许你通过选择应用程序来创建文件，包括空白文件。\n\r\n此外，你可以直接启动软件来安装一些可以帮助你创建相应文件类型的应用程序。\n\r\n由于这个功能比较复杂，可能会在以后开发。目前还没有时间表。\n\r\n这在“文件” v43 中可用（通过 GNOME 43）吗？\n\r\n但是，在我看来，这种变化需要一些额外的设计审查。我觉得它不完整。例如，当你有模板时，你无法创建标准文档类型（文本、LibreOffice 文档）—— 这两个对话框是互斥的。另外，我发现了一些小 BUG。\n\r\n尽管该功能目前 已获得批准和合并，但由于日程冲突，它无法进入 GNOME 43候选版本。\n\r\n希望在经过一轮良好的审查和测试后，你可以在明年的 GNOME 44 版本中获得此功能。\n\r\n总结\n\r\n总的来说，这是一个优雅的功能，我认为如今没有任何其他文件管理器具有这种先进的设计。一旦这个“文件”的“新建文件”功能被完全实现，它将会是其出色功能集的一个很好的补充。\n\r\n那么，你喜欢这个新设计吗？请在评论框中告诉我。\n\r\n\r\nvia: https://www.debugpoint.com/gnome-files-new-file-document/\n\r\n作者：Arindam 选题：lkxed 译者：littlebirdnest 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15057-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-22T04:11:00.000Z",
          "wordCount": 494,
          "title": "GNOME “文件”引入最受欢迎的功能：“新建文件”菜单",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15056-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Canonical 是否计划用这个基于 Flutter 的应用程序取代 Ubuntu 软件中心？也许是，也许不是。\n\r\n\r\n\n\r\nUbuntu 通常被认为 是最适合初学者的发行版之一，但默认的软件中心（GNOME 软件中心Software Center）需要更多的打磨才能使其成为令人愉悦的体验。\n\r\n为什么？嗯，它很慢而且占用资源很多，所以大多数用户不会费心使用它，或者使用感受很糟糕。\n\r\n是的，多年来它可能有所改善，但仍远非良好的体验。\n\r\n它看起来像是来自 Canonical 的贡献者，而其他人已经联手为 Ubuntu 软件中心开发一个轻量级、基于 Flutter 的替代方案！\n\r\n等等，它 不是官方替代品。但是，我想知道它是否打算很快取代 Ubuntu 软件中心？🤔\n\r\n🆕 使用 Flutter 制作的 “Ubuntu 软件”\n\r\n\n\r\n这个使用 Flutter 实现的 “Ubuntu 软件Ubuntu Software”旨在实现轻量级、自适应和快速，提供比传统软件更好的用户体验。\n\r\n但首要因素必须是可用性，对吧？因为最后，你只是为了安装软件。而且，你想快速完成，没有任何麻烦。\n\r\n当我在我的系统上尝试它时，我注意到“我的应用程序”下有一个单独的 “Snaps” 和 “Deb 包”部分：\n\r\n\n\r\n这应该便于处理单个应用程序中的不同包。毕竟，这是我一直想要的！\n\r\n轻松安装/管理应用程序的统一体验，是不是要求太多了？ 🤷\n\r\n但是应用信息和安装页面呢？好吧，它已经过重新设计，带有微妙的动画以增强体验。\n\r\n\n\r\n自适应布局简直就是锦上添花。这有点类似于 elementary OS 7 为我们准备的：\n\r\n\r\nelementary OS 7 准备添加响应式应用程序，并移植到 GTK 4\n\r\n\r\n所以，它看起来像是对未来的一个深思熟虑的实现，对吧？\n\r\n\n\r\n它会取代 Ubuntu 软件吗？\n\r\n虽然项目贡献者将其标记为 Ubuntu 软件中心的非官方替代品，但我认为它更像是一个尝试作为替代品的实验。\n\r\n考虑到负责 Ubuntu 上 Flutter 的高级工程师 @Canonical JP Nurmi 参与其中，这将是一件值得期待的事情。\n\r\n我们现在唯一能做的就是“预测”。随着事情的发展，这似乎有更多的机会成为官方的。\n\r\n想尝试这个基于 Flutter 的商店吗？\n\r\n你可以前往它的 GitHub 页面 并按照构建说明让它运行。请注意，截至目前，它正在大力开发中。\n\r\n\r\n下载 Ubuntu 软件\n\r\n\r\n对于正在积极开发的东西来说，它的效果相当好。\n\r\n💬 我希望当前的软件中心被取代。你怎么看？在下面的评论中让我知道你的想法！\n\r\n\r\nvia: https://news.itsfoss.com/unofficial-flutter-ubuntu-software/\n\r\n作者：Sagar Sharma 选题：lkxed 译者：littlebirdnest 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15056-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-22T03:32:19.000Z",
          "wordCount": 529,
          "title": "这个基于 Flutter 的非官方软件中心可能会取代 Ubuntu 的官方应用",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15055-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Rust 将进入 Linux 6.1\n\r\n在 Linux 内核维护者峰会上，Linus Torvalds 表示除非有意外发生，Rust 将进入 Linux 6.1，但“只是核心基础设施（即还没有正经用例）”。目前正在开发的版本是 Linux 6.0，6.1 是下一个版本。西部数据的工程师们在 Linux Plumbers 大会上展示了使用 Rust 语言开发的 NVMe 驱动，它已经实现了与 C 语言版本相当的性能。内核开发者同意 Rust on Linux 已经准备就绪。\n\r\n\r\n消息来源：ZDNet\n\r\n\r\n\r\n老王点评：在前两天 Linus 的采访中，他还没有肯定地确认 Rust 将进入 Linux 6.1，现在看起来经过几天的会议，内核开发者们已经达成了共识。\n\r\n\r\n\n\r\nLibreOffice 上架 Mac 应用商店，售价 9 欧元\n\r\n文档基金会宣布在 Mac 应用商店发布 LibreOffice，以支持那些希望从苹果的专有销售渠道获得所有桌面软件的最终用户。Mac 应用商店上的版本是由 Collabora 发布的，并由其提供三年的支持服务，下载它需要付出 8.99 欧元的“便利费”，以支持该项目的开发。但 macOS 用户仍然可以从文档基金会下载免费版本，免费版本和 Mac 应用商店的版本都是采用相同源代码构建的，功能没有区别，甚至商店版本由于苹果的政策限制而需要另行下载依赖项 Java。\n\r\n\r\n消息来源：文档基金会\n\r\n\r\n\r\n老王点评：基金会专注于免费的社区版本，而将收费的空间留给生态伙伴，这是一种好的做法。\n\r\n\r\n\n\r\n研究发现 YouTube 的反馈按钮几乎没有用\n\r\nMozilla 研究人员通过利用来自 2 万多名 YouTube 用户的视频推荐数据发现，“不感兴趣”、“不喜欢”、“停止推荐频道”和“从观看历史中删除”等按钮在防止类似内容被推荐方面基本上不起作用。报告发现，即使在最好的情况下，点击过这些按钮后，仍有一半以上相似的内容推荐。YouTube 称，这些行为是故意的，因为该平台并不试图阻止跟某个主题有关的所有内容，并批评该报告的“类似”的定义没有考虑到 YouTube 的推荐系统是如何工作的。\n\r\n\r\n消息来源：福布斯\n\r\n\r\n\r\n老王点评：合着这些按钮就是安抚用户情绪啊？我想，其它的视频或微博上的类似按钮是不是也如此呢？",
          "link": "https://linux.cn/article-15055-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-21T11:08:23.000Z",
          "wordCount": 501,
          "title": "硬核观察 #766 Rust 将进入 Linux 6.1",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "先知安全技术社区",
      "feedUrl": "https://xz.aliyun.com/feed",
      "siteUrl": "https://xz.aliyun.com/forum/",
      "articles": [
        {
          "id": "https://xz.aliyun.com/t/11721",
          "author": null,
          "description": "某开源堡垒机历史漏洞分析",
          "link": "https://xz.aliyun.com/t/11721",
          "publishedOn": "2022-09-22T15:55:37.000Z",
          "wordCount": 298,
          "title": "某开源堡垒机历史漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11723",
          "author": null,
          "description": "CVE-2022-33980命令执行漏洞分析",
          "link": "https://xz.aliyun.com/t/11723",
          "publishedOn": "2022-09-21T15:54:31.000Z",
          "wordCount": 368,
          "title": "CVE-2022-33980命令执行漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11729",
          "author": null,
          "description": "从前端代码审计挖掘未授权进入后台到文件上传拿下某色情网站",
          "link": "https://xz.aliyun.com/t/11729",
          "publishedOn": "2022-09-21T15:52:28.000Z",
          "wordCount": 345,
          "title": "从前端代码审计挖掘未授权进入后台到文件上传拿下某色情网站",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11711",
          "author": null,
          "description": "Dll劫持注入从原理到白加黑漏洞利用",
          "link": "https://xz.aliyun.com/t/11711",
          "publishedOn": "2022-09-21T15:51:59.000Z",
          "wordCount": 469,
          "title": "Dll劫持注入从原理到白加黑漏洞利用",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11720",
          "author": null,
          "description": "对writeObject流程动点手脚",
          "link": "https://xz.aliyun.com/t/11720",
          "publishedOn": "2022-09-20T15:59:24.000Z",
          "wordCount": 1006,
          "title": "对writeObject流程动点手脚",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11716",
          "author": null,
          "description": "关于\"linux capability\"的两个特殊案例",
          "link": "https://xz.aliyun.com/t/11716",
          "publishedOn": "2022-09-20T15:57:55.000Z",
          "wordCount": 831,
          "title": "关于\"linux capability\"的两个特殊案例",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11722",
          "author": null,
          "description": "GenieACS CVE-2021-46704认证前RCE漏洞分析",
          "link": "https://xz.aliyun.com/t/11722",
          "publishedOn": "2022-09-20T15:54:08.000Z",
          "wordCount": 1316,
          "title": "GenieACS CVE-2021-46704认证前RCE漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11701",
          "author": null,
          "description": "goby指纹提取与yara逆向.md",
          "link": "https://xz.aliyun.com/t/11701",
          "publishedOn": "2022-09-19T15:55:27.000Z",
          "wordCount": 1224,
          "title": "goby指纹提取与yara逆向.md",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11714",
          "author": null,
          "description": "记一次较为详细的某CMS代码审计",
          "link": "https://xz.aliyun.com/t/11714",
          "publishedOn": "2022-09-19T15:53:01.000Z",
          "wordCount": 2456,
          "title": "记一次较为详细的某CMS代码审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11705",
          "author": null,
          "description": "一些BAT的XSS实例（四）高级篇",
          "link": "https://xz.aliyun.com/t/11705",
          "publishedOn": "2022-09-16T02:40:54.000Z",
          "wordCount": 338,
          "title": "一些BAT的XSS实例（四）高级篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11697",
          "author": null,
          "description": "利用ASP.NET Web API Help Page文件上传",
          "link": "https://xz.aliyun.com/t/11697",
          "publishedOn": "2022-09-16T02:35:20.000Z",
          "wordCount": null,
          "title": "利用ASP.NET Web API Help Page文件上传",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11673",
          "author": null,
          "description": "基于netfilter的rootkit",
          "link": "https://xz.aliyun.com/t/11673",
          "publishedOn": "2022-09-16T02:33:43.000Z",
          "wordCount": 645,
          "title": "基于netfilter的rootkit",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11699",
          "author": null,
          "description": "不常见的内存与流量取证 -- WMCTF 2022 1!5!",
          "link": "https://xz.aliyun.com/t/11699",
          "publishedOn": "2022-09-15T15:45:49.000Z",
          "wordCount": 1382,
          "title": "不常见的内存与流量取证 -- WMCTF 2022 1!5!",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11674",
          "author": null,
          "description": "CVE-2020-8558-跨主机访问127.0.0.1",
          "link": "https://xz.aliyun.com/t/11674",
          "publishedOn": "2022-09-15T15:41:29.000Z",
          "wordCount": 1018,
          "title": "CVE-2020-8558-跨主机访问127.0.0.1",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11676",
          "author": null,
          "description": "红日安全团队ATT&CK(二)实战系列靶场",
          "link": "https://xz.aliyun.com/t/11676",
          "publishedOn": "2022-09-15T15:40:07.000Z",
          "wordCount": 913,
          "title": "红日安全团队ATT&CK(二)实战系列靶场",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11656",
          "author": null,
          "description": "“黑猫”又伸出恶魔之手？揭秘BlackCat病毒的三重勒索",
          "link": "https://xz.aliyun.com/t/11656",
          "publishedOn": "2022-09-15T15:39:00.000Z",
          "wordCount": 488,
          "title": "“黑猫”又伸出恶魔之手？揭秘BlackCat病毒的三重勒索",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11703",
          "author": null,
          "description": "CVE-2022-1292的分析",
          "link": "https://xz.aliyun.com/t/11703",
          "publishedOn": "2022-09-14T13:40:35.000Z",
          "wordCount": 523,
          "title": "CVE-2022-1292的分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11690",
          "author": null,
          "description": "Gitlab常见漏洞复现及后利用",
          "link": "https://xz.aliyun.com/t/11690",
          "publishedOn": "2022-09-14T13:39:16.000Z",
          "wordCount": 869,
          "title": "Gitlab常见漏洞复现及后利用",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11695",
          "author": null,
          "description": "从mcms历史漏洞中捡漏",
          "link": "https://xz.aliyun.com/t/11695",
          "publishedOn": "2022-09-13T11:53:55.000Z",
          "wordCount": 543,
          "title": "从mcms历史漏洞中捡漏",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11688",
          "author": null,
          "description": "2022 网鼎杯玄武组-you can find it 题解—Spring通用MemShell改造",
          "link": "https://xz.aliyun.com/t/11688",
          "publishedOn": "2022-09-13T11:52:20.000Z",
          "wordCount": 526,
          "title": "2022 网鼎杯玄武组-you can find it 题解—Spring通用MemShell改造",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11669",
          "author": null,
          "description": "某后台管理系统的审计",
          "link": "https://xz.aliyun.com/t/11669",
          "publishedOn": "2022-09-09T15:56:45.000Z",
          "wordCount": 275,
          "title": "某后台管理系统的审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11684",
          "author": null,
          "description": "关于那WebSocket劫持的二三事",
          "link": "https://xz.aliyun.com/t/11684",
          "publishedOn": "2022-09-08T15:55:34.000Z",
          "wordCount": 910,
          "title": "关于那WebSocket劫持的二三事",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11682",
          "author": null,
          "description": "一些BAT的XSS实例（三）中级篇",
          "link": "https://xz.aliyun.com/t/11682",
          "publishedOn": "2022-09-07T15:54:00.000Z",
          "wordCount": 311,
          "title": "一些BAT的XSS实例（三）中级篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11659",
          "author": null,
          "description": "红队开发基础-基础免杀(四)",
          "link": "https://xz.aliyun.com/t/11659",
          "publishedOn": "2022-09-06T15:55:00.000Z",
          "wordCount": 445,
          "title": "红队开发基础-基础免杀(四)",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11653",
          "author": null,
          "description": "揭开新型窃密软件的面纱：伪装成CDR画图应用安装包",
          "link": "https://xz.aliyun.com/t/11653",
          "publishedOn": "2022-09-06T15:54:00.000Z",
          "wordCount": 285,
          "title": "揭开新型窃密软件的面纱：伪装成CDR画图应用安装包",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11664",
          "author": null,
          "description": "Linux提权基础分享和讨论",
          "link": "https://xz.aliyun.com/t/11664",
          "publishedOn": "2022-09-06T15:53:35.000Z",
          "wordCount": 2882,
          "title": "Linux提权基础分享和讨论",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11671",
          "author": null,
          "description": "CVE-2020-28413 MantisBT SQL注入漏洞分析",
          "link": "https://xz.aliyun.com/t/11671",
          "publishedOn": "2022-09-05T15:55:21.000Z",
          "wordCount": 1264,
          "title": "CVE-2020-28413 MantisBT SQL注入漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11681",
          "author": null,
          "description": "一些BAT的XSS实例（二）进阶篇",
          "link": "https://xz.aliyun.com/t/11681",
          "publishedOn": "2022-09-05T15:54:50.000Z",
          "wordCount": 262,
          "title": "一些BAT的XSS实例（二）进阶篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11672",
          "author": null,
          "description": "JAVA常用框架SQL注入审计",
          "link": "https://xz.aliyun.com/t/11672",
          "publishedOn": "2022-09-05T15:54:25.000Z",
          "wordCount": 1732,
          "title": "JAVA常用框架SQL注入审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11677",
          "author": null,
          "description": "一些BAT的XSS实例（一）基础篇",
          "link": "https://xz.aliyun.com/t/11677",
          "publishedOn": "2022-09-01T09:00:03.000Z",
          "wordCount": null,
          "title": "一些BAT的XSS实例（一）基础篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11662",
          "author": null,
          "description": "利用Nginx、Tyk Gateway API和CloudFlare防火墙隐藏C2设施",
          "link": "https://xz.aliyun.com/t/11662",
          "publishedOn": "2022-08-31T14:55:35.000Z",
          "wordCount": 467,
          "title": "利用Nginx、Tyk Gateway API和CloudFlare防火墙隐藏C2设施",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11667",
          "author": null,
          "description": "域内批量获取敏感文件",
          "link": "https://xz.aliyun.com/t/11667",
          "publishedOn": "2022-08-31T14:54:03.000Z",
          "wordCount": 991,
          "title": "域内批量获取敏感文件",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11660",
          "author": null,
          "description": "CVE-2022-31197 PostgreSQL JDBC SQL注入分析",
          "link": "https://xz.aliyun.com/t/11660",
          "publishedOn": "2022-08-30T15:40:39.000Z",
          "wordCount": 291,
          "title": "CVE-2022-31197 PostgreSQL JDBC SQL注入分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11627",
          "author": null,
          "description": "ADCS攻击笔记",
          "link": "https://xz.aliyun.com/t/11627",
          "publishedOn": "2022-08-29T14:15:00.000Z",
          "wordCount": null,
          "title": "ADCS攻击笔记",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11658",
          "author": null,
          "description": "ThinkPHP 5.0.X代码审计",
          "link": "https://xz.aliyun.com/t/11658",
          "publishedOn": "2022-08-29T13:51:41.000Z",
          "wordCount": 1495,
          "title": "ThinkPHP 5.0.X代码审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11652",
          "author": null,
          "description": "【云攻防系列】从攻击者视角聊聊K8S集群安全（上）",
          "link": "https://xz.aliyun.com/t/11652",
          "publishedOn": "2022-08-29T13:49:00.000Z",
          "wordCount": null,
          "title": "【云攻防系列】从攻击者视角聊聊K8S集群安全（上）",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11655",
          "author": null,
          "description": "给木马带双眼睛",
          "link": "https://xz.aliyun.com/t/11655",
          "publishedOn": "2022-08-29T13:48:52.000Z",
          "wordCount": 329,
          "title": "给木马带双眼睛",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11651",
          "author": null,
          "description": "利用 PHP-FPM 做内存马的方法",
          "link": "https://xz.aliyun.com/t/11651",
          "publishedOn": "2022-08-29T13:45:00.000Z",
          "wordCount": 359,
          "title": "利用 PHP-FPM 做内存马的方法",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "dev.to top (month)",
      "feedUrl": "https://rsshub.app/dev.to/top/month",
      "siteUrl": "https://dev.to/top/month",
      "articles": [
        {
          "id": "https://dev.to/karanpratapsingh/system-design-whatsapp-fld",
          "author": "Karan Pratap Singh",
          "description": "#distributedsystems #architecture #tutorial",
          "link": "https://dev.to/karanpratapsingh/system-design-whatsapp-fld",
          "publishedOn": "2022-09-21T05:44:12.000Z",
          "wordCount": 5386,
          "title": "System Design: WhatsApp",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--nFT8wguM--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://raw.githubusercontent.com/karanpratapsingh/portfolio/master/public/static/courses/system-design/chapter-V/whatsapp/banner.png"
        },
        {
          "id": "https://dev.to/gregorygaines/stop-using-env-files-now-kp0",
          "author": "Gregory Gaines",
          "description": "#javascript #webdev #node #productivity",
          "link": "https://dev.to/gregorygaines/stop-using-env-files-now-kp0",
          "publishedOn": "2022-09-19T21:04:49.000Z",
          "wordCount": 24714,
          "title": "Stop Using .env Files Now!",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--aVrIfj2y--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/e9c0wazzsnbjuewf4vvl.png"
        },
        {
          "id": "https://dev.to/enterspeed/making-a-fast-website-is-super-easy-9lb",
          "author": "Kasper Andreassen, Enterspeed",
          "description": "#webdev #performance #programming #tutorial",
          "link": "https://dev.to/enterspeed/making-a-fast-website-is-super-easy-9lb",
          "publishedOn": "2022-09-19T07:26:18.000Z",
          "wordCount": 9154,
          "title": "Making a fast website is SUPER EASY 😏",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--eHs2p1NQ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rkzv3rk0qwdgoer7ipg9.jpg"
        },
        {
          "id": "https://dev.to/wiseai/9-figma-alternatives-for-a-blazingly-fast-increase-in-your-productivity-3g40",
          "author": "Mahmoud Harmouch",
          "description": "#design #uiweekly #productivity #ux",
          "link": "https://dev.to/wiseai/9-figma-alternatives-for-a-blazingly-fast-increase-in-your-productivity-3g40",
          "publishedOn": "2022-09-18T07:35:48.000Z",
          "wordCount": 3394,
          "title": "9 Figma Alternatives For A Blazingly Fast Increase In Your Productivity.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--1LshbYpi--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://cdn.pixabay.com/photo/2018/07/30/23/20/editor-3573850_960_720.jpg"
        },
        {
          "id": "https://dev.to/aviyel/top-9-best-ui-component-librariesframeworks-in-2022-for-frontend-developers-b48",
          "author": "Pramit Marattha, Aviyel Inc",
          "description": "#webdev #css #tailwindcss #opensource",
          "link": "https://dev.to/aviyel/top-9-best-ui-component-librariesframeworks-in-2022-for-frontend-developers-b48",
          "publishedOn": "2022-09-18T07:02:36.000Z",
          "wordCount": 4859,
          "title": "9 Best UI Component Libraries/Frameworks in 2022 for Frontend Developers🔥",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--RH2DIWnx--/c_imagga_scale,f_auto,fl_progressive,h_500,q_66,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/p9jbpewbrgkcp3lkjv6d.gif"
        },
        {
          "id": "https://dev.to/saeedmosavat/stop-writing-api-functions-3693",
          "author": "Saeed Mosavat",
          "description": "#javascript #webdev #codequality #productivity",
          "link": "https://dev.to/saeedmosavat/stop-writing-api-functions-3693",
          "publishedOn": "2022-09-17T23:22:15.000Z",
          "wordCount": 4653,
          "title": "Stop writing API functions",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---uE2Eyti--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/3yt73lpk3jwfok2vea0u.jpg"
        },
        {
          "id": "https://dev.to/marodevv/built-a-devto-replica-with-the-mern-stack-and-more-fbd",
          "author": "Marwan mostafa",
          "description": "#showdev #javascript #react #node",
          "link": "https://dev.to/marodevv/built-a-devto-replica-with-the-mern-stack-and-more-fbd",
          "publishedOn": "2022-09-17T12:43:50.000Z",
          "wordCount": 3312,
          "title": "💁‍♂️ Built a Dev.to replica with The MERN stack and more",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--dBsq-zrn--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/hjqt4ea0poro5tmprvmz.png"
        },
        {
          "id": "https://dev.to/wadecodez/the-git-commands-i-use-every-day-5g17",
          "author": "Wade Zimmerman",
          "description": "#git #beginners #programming #javascript",
          "link": "https://dev.to/wadecodez/the-git-commands-i-use-every-day-5g17",
          "publishedOn": "2022-09-17T12:34:13.000Z",
          "wordCount": 3528,
          "title": "The Git Commands I Use Every Day",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--maqcEdLv--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qpmt6qdjaxbxw9h0labn.png"
        },
        {
          "id": "https://dev.to/shreyvijayvargiya/why-our-websites-are-slow-importance-of-bundle-size-1le4",
          "author": "shrey vijayvargiya",
          "description": "#programming #react #javascript #webdev",
          "link": "https://dev.to/shreyvijayvargiya/why-our-websites-are-slow-importance-of-bundle-size-1le4",
          "publishedOn": "2022-09-17T11:31:19.000Z",
          "wordCount": 3998,
          "title": "Why our websites are slow — Importance of bundle size",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--xSJS3Y_w--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/y53ptgcsw8i30dipa0t8.png"
        },
        {
          "id": "https://dev.to/profydev/how-to-debug-react-apps-with-vs-code-boost-your-debugging-productivity-1k05",
          "author": "Johannes Kettmann, Profy.dev",
          "description": "#react #javascript #webdev #vscode",
          "link": "https://dev.to/profydev/how-to-debug-react-apps-with-vs-code-boost-your-debugging-productivity-1k05",
          "publishedOn": "2022-09-16T12:09:50.000Z",
          "wordCount": 3380,
          "title": "How To Debug React Apps With VS Code - Boost Your Debugging Productivity",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--ivQHK2GP--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/b4bjg33oiq261p11ask1.png"
        },
        {
          "id": "https://dev.to/madza/19-practical-es6-snippets-to-solve-common-js-problems-31o9",
          "author": "Madza",
          "description": "#webdev #javascript #frontend #productivity",
          "link": "https://dev.to/madza/19-practical-es6-snippets-to-solve-common-js-problems-31o9",
          "publishedOn": "2022-09-15T15:47:21.000Z",
          "wordCount": 3046,
          "title": "19 Practical ES6 Snippets to Solve Common JS Problems 🚀💯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--3165AlXi--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/tzncjvbqvq8jkw7l1v9w.png"
        },
        {
          "id": "https://dev.to/dcodeyt/7-must-know-javascript-tips-tricks-2m8f",
          "author": "Dom (dcode)",
          "description": "#javascript #webdev #beginners #tutorial",
          "link": "https://dev.to/dcodeyt/7-must-know-javascript-tips-tricks-2m8f",
          "publishedOn": "2022-09-15T12:49:53.000Z",
          "wordCount": 3055,
          "title": "7 Must Know JavaScript Tips & Tricks 🎈",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Ejpaz6KH--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vgad7ph4dihcbqw45kl3.jpg"
        },
        {
          "id": "https://dev.to/stripe/designing-apis-for-humans-error-messages-94p",
          "author": "Paul Asjes, Stripe",
          "description": "#api #webdev #programming #stripe",
          "link": "https://dev.to/stripe/designing-apis-for-humans-error-messages-94p",
          "publishedOn": "2022-09-14T11:36:49.000Z",
          "wordCount": 5647,
          "title": "Designing APIs for humans: Error messages",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--8NfiYBul--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/pfxrwzebqa64bcyj3bow.png"
        },
        {
          "id": "https://dev.to/jainilprajapati/7-fantastic-heroku-alternatives-4jf8",
          "author": "Jainil Prajapati",
          "description": "#heroku #javascript #webdev #programming",
          "link": "https://dev.to/jainilprajapati/7-fantastic-heroku-alternatives-4jf8",
          "publishedOn": "2022-09-12T18:26:06.000Z",
          "wordCount": 3283,
          "title": "7 Fantastic Heroku Alternatives",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---aKLwteS--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qnauthgy32x1bsrnd1d4.png"
        },
        {
          "id": "https://dev.to/novu/building-an-interactive-screen-sharing-app-with-puppeteer-and-react-12h7",
          "author": "Nevo David, novu",
          "description": "#react #webdev #javascript #opensource",
          "link": "https://dev.to/novu/building-an-interactive-screen-sharing-app-with-puppeteer-and-react-12h7",
          "publishedOn": "2022-09-12T15:05:19.000Z",
          "wordCount": 5220,
          "title": "Building an interactive screen-sharing app with Puppeteer and React 🤯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7WhDhNPC--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/z19zh12b5yiuggqevbgr.jpg"
        },
        {
          "id": "https://dev.to/adiatiayu/mini-portfolio-bring-your-github-profile-to-the-next-level-5c8n",
          "author": "Ayu Adiati",
          "description": "#github #tutorial #beginners #webdev",
          "link": "https://dev.to/adiatiayu/mini-portfolio-bring-your-github-profile-to-the-next-level-5c8n",
          "publishedOn": "2022-09-12T10:42:30.000Z",
          "wordCount": 4560,
          "title": "Mini Portfolio: Bring Your GitHub Profile To The Next Level",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--3_YgJFdy--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ntl8av7jl2ybtwdnd56x.png"
        },
        {
          "id": "https://dev.to/k_ivanow/finding-remote-work-in-2022-26j",
          "author": "Kristian Ivanov",
          "description": "#remote #interview #career #jobs",
          "link": "https://dev.to/k_ivanow/finding-remote-work-in-2022-26j",
          "publishedOn": "2022-09-11T15:07:11.000Z",
          "wordCount": 2876,
          "title": "Finding remote work in 2022",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--A-BCBZYT--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/djubpwkd8c3oycq5qpu2.jpeg"
        },
        {
          "id": "https://dev.to/aviavinav/the-making-of-a-react-component-librabry-cep",
          "author": "Avi Avinav",
          "description": "#javascript #react #webdev #beginners",
          "link": "https://dev.to/aviavinav/the-making-of-a-react-component-librabry-cep",
          "publishedOn": "2022-09-11T12:09:24.000Z",
          "wordCount": 4169,
          "title": "The Making of A React Component Library",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--980rloZD--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/iglufrc1hyb2akr4wdhq.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/mastering-these-7-basics-css-skills-will-make-you-a-frontend-wizard-2khn",
          "author": "Tapajyoti Bose",
          "description": "#webdev #programming #css #beginners",
          "link": "https://dev.to/ruppysuppy/mastering-these-7-basics-css-skills-will-make-you-a-frontend-wizard-2khn",
          "publishedOn": "2022-09-11T06:25:06.000Z",
          "wordCount": 2617,
          "title": "Mastering these 7 Basics CSS Skills will make you a Frontend Wizard 🧙✨",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--o3Bv5OAd--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/heca1jzzdzqchb4k2sdl.png"
        },
        {
          "id": "https://dev.to/dabit3/building-full-stack-applications-with-arweave-and-nextjs-28hg",
          "author": "Nader Dabit",
          "description": "#webdev #javascript #nextjs #web3",
          "link": "https://dev.to/dabit3/building-full-stack-applications-with-arweave-and-nextjs-28hg",
          "publishedOn": "2022-09-10T19:12:27.000Z",
          "wordCount": 3991,
          "title": "Building Full Stack Permanent Applications with Arweave, Smartweave, and Next.js",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--yef00i4h--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/r2o66tc2bwbgr07i97o4.png"
        },
        {
          "id": "https://dev.to/github/why-are-people-developing-inside-containers-38o6",
          "author": "Rizèl Scarlett, GitHub",
          "description": "#github #beginners #cloud #docker",
          "link": "https://dev.to/github/why-are-people-developing-inside-containers-38o6",
          "publishedOn": "2022-09-09T20:49:53.000Z",
          "wordCount": 4280,
          "title": "Why are people developing inside containers?",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7lFVUHWD--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/58pr74ygicsvwc84lzko.png"
        },
        {
          "id": "https://dev.to/wiseai/30-pytricks-ive-learned-by-joining-the-real-python-mailing-list-227i",
          "author": "Mahmoud Harmouch",
          "description": "#python #beginners",
          "link": "https://dev.to/wiseai/30-pytricks-ive-learned-by-joining-the-real-python-mailing-list-227i",
          "publishedOn": "2022-09-08T20:16:08.000Z",
          "wordCount": 3865,
          "title": "30 PyTricks I've Learned By Joining the Real Python Mailing List.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---uxRo6-R--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://cdn.pixabay.com/photo/2016/07/13/08/48/mobile-phone-1513945_960_720.jpg"
        },
        {
          "id": "https://dev.to/madza/12-modern-ui-components-to-inspire-your-future-designs-4ni4",
          "author": "Madza",
          "description": "#webdev #design #ui #inspiration",
          "link": "https://dev.to/madza/12-modern-ui-components-to-inspire-your-future-designs-4ni4",
          "publishedOn": "2022-09-08T16:08:58.000Z",
          "wordCount": 2466,
          "title": "12 Modern UI Components to Inspire Your Future Designs 😍✨",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--hbquREjm--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/scnrm2bxol261sqbs5nk.png"
        },
        {
          "id": "https://dev.to/surajondev/50-awesome-tools-for-web-developers-5gan",
          "author": "Suraj Vishwakarma",
          "description": "#javascript #webdev #beginners #react",
          "link": "https://dev.to/surajondev/50-awesome-tools-for-web-developers-5gan",
          "publishedOn": "2022-09-08T11:31:33.000Z",
          "wordCount": 3558,
          "title": "50+ Awesome tools for Web Developers",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--8iFoZSNU--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/584lu1fv3nsoulybolcx.png"
        },
        {
          "id": "https://dev.to/devsyedmohsin/javascript-tips-and-tricks-you-need-to-know-1g2k",
          "author": "Syed Mohsin Raza",
          "description": "#webdev #javascript #programming #beginners",
          "link": "https://dev.to/devsyedmohsin/javascript-tips-and-tricks-you-need-to-know-1g2k",
          "publishedOn": "2022-09-08T11:16:33.000Z",
          "wordCount": 2058,
          "title": "JavaScript Tips And Tricks Every Developer Should know 💯 🚀️",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--ihSk23fE--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/hl22lqwcsrc92kvcap9y.png"
        },
        {
          "id": "https://dev.to/valeriavg/me-react-5-years-in-15-minutes-58od",
          "author": "Valeria",
          "description": "#react #beginners #javascript #webdev",
          "link": "https://dev.to/valeriavg/me-react-5-years-in-15-minutes-58od",
          "publishedOn": "2022-09-08T07:10:08.000Z",
          "wordCount": 5992,
          "title": "Me & React: 5 years in 15 minutes",
          "imageUrl": "https://dev.to/social_previews/article/1182435.png"
        },
        {
          "id": "https://dev.to/freebeliever/how-to-convert-any-website-into-a-desktop-applicationin-30-seconds-b0n",
          "author": "Blogger and Programmer",
          "description": "#webdev #tutorial #opensource #codenewbie",
          "link": "https://dev.to/freebeliever/how-to-convert-any-website-into-a-desktop-applicationin-30-seconds-b0n",
          "publishedOn": "2022-09-08T05:46:39.000Z",
          "wordCount": 6410,
          "title": "👋How to convert ANY website into a desktop application(In 30 Seconds)",
          "imageUrl": "https://dev.to/social_previews/article/1187642.png"
        },
        {
          "id": "https://dev.to/anshika_gautam_/build-a-web-paint-application-5f55",
          "author": "Anshika",
          "description": "#javascript #html #css #webdev",
          "link": "https://dev.to/anshika_gautam_/build-a-web-paint-application-5f55",
          "publishedOn": "2022-09-07T14:49:34.000Z",
          "wordCount": 3918,
          "title": "Build a Web Paint Application",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--N0wfHpeN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/61e7ifwm7v7o3ze8cgyx.png"
        },
        {
          "id": "https://dev.to/j471n/detect-when-users-switch-tabs-using-javascript-3mi3",
          "author": "Jatin Sharma",
          "description": "#javascript #webdev #tutorial #beginners",
          "link": "https://dev.to/j471n/detect-when-users-switch-tabs-using-javascript-3mi3",
          "publishedOn": "2022-09-07T04:00:01.000Z",
          "wordCount": 3210,
          "title": "Detect When Users Switch Tabs using JavaScript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--sh7elrYU--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qudvzomd2qg2su4d9a5n.png"
        },
        {
          "id": "https://dev.to/zevir/the-complete-list-of-heroku-alternatives-to-consider-1l8o",
          "author": "Zevi Reinitz",
          "description": "#heroku #webdev #programming #devops",
          "link": "https://dev.to/zevir/the-complete-list-of-heroku-alternatives-to-consider-1l8o",
          "publishedOn": "2022-09-06T15:21:05.000Z",
          "wordCount": 4967,
          "title": "The Complete List of Heroku Alternatives to Consider",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--vhb83Cu9--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ym56sdt5nhkglna6tse8.jpg"
        },
        {
          "id": "https://dev.to/novu/building-a-live-event-alert-system-with-react-socketio-and-push-notifications-2jg5",
          "author": "Nevo David, novu",
          "description": "#javascript #react #programming #webdev",
          "link": "https://dev.to/novu/building-a-live-event-alert-system-with-react-socketio-and-push-notifications-2jg5",
          "publishedOn": "2022-09-05T14:36:26.000Z",
          "wordCount": 5076,
          "title": "Building a live-event alert system with React, Socket.io, and Push Notifications 🚀",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--EHHuJVoh--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/nbmmt0sax2e28wluvsyl.png"
        },
        {
          "id": "https://dev.to/enterspeed/we-measured-the-ssr-performance-of-6-js-frameworks-heres-what-we-found-1ck0",
          "author": "Kasper Andreassen, Enterspeed",
          "description": "#javascript #react #performance #webdev",
          "link": "https://dev.to/enterspeed/we-measured-the-ssr-performance-of-6-js-frameworks-heres-what-we-found-1ck0",
          "publishedOn": "2022-09-05T06:35:44.000Z",
          "wordCount": 4273,
          "title": "We measured the SSR performance of 6 JS frameworks - here's what we found",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--am_cPbMF--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/c1vlghlhjps2toxu0m25.jpg"
        },
        {
          "id": "https://dev.to/codewithtee/15-array-methods-in-javascript-1p1m",
          "author": "Tabassum Khanum",
          "description": "#javascript #webdev #beginners #programming",
          "link": "https://dev.to/codewithtee/15-array-methods-in-javascript-1p1m",
          "publishedOn": "2022-09-04T18:05:05.000Z",
          "wordCount": 4044,
          "title": "15+ Array Methods in Javascript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--E2de0xXe--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vtkz5a0fnln38z578ikg.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/6-must-have-chrome-extensions-for-web-developers-1ma2",
          "author": "Tapajyoti Bose",
          "description": "#webdev #javascript #productivity #programming",
          "link": "https://dev.to/ruppysuppy/6-must-have-chrome-extensions-for-web-developers-1ma2",
          "publishedOn": "2022-09-04T06:15:00.000Z",
          "wordCount": 2385,
          "title": "6 must-have Chrome Extensions for Web Developers 🚀🌐",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--2XIBrsLR--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ba1979d6k9jju5e6ia6p.png"
        },
        {
          "id": "https://dev.to/sarath_pm/git-cheatsheet-414e",
          "author": "Sarath P M",
          "description": "#git #programming #github #codenewbie",
          "link": "https://dev.to/sarath_pm/git-cheatsheet-414e",
          "publishedOn": "2022-09-03T13:35:05.000Z",
          "wordCount": 3460,
          "title": "Git Cheatsheet",
          "imageUrl": "https://dev.to/social_previews/article/1178295.png"
        },
        {
          "id": "https://dev.to/heyjtk/big-o-notation-basics-made-dead-simple-1c9m",
          "author": "JTK",
          "description": "#softwareengineering #algorithms #coding",
          "link": "https://dev.to/heyjtk/big-o-notation-basics-made-dead-simple-1c9m",
          "publishedOn": "2022-09-02T19:06:38.000Z",
          "wordCount": 5195,
          "title": "Big O notation basics made dead simple",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--3OHOMm_M--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ia3qpqezyrd0lyr5j6dg.jpg"
        },
        {
          "id": "https://dev.to/surajondev/awesome-github-repositories-for-web-developer-part-2-1h8b",
          "author": "Suraj Vishwakarma",
          "description": "#github #webdev #javascript #beginners",
          "link": "https://dev.to/surajondev/awesome-github-repositories-for-web-developer-part-2-1h8b",
          "publishedOn": "2022-09-01T11:36:22.000Z",
          "wordCount": 3112,
          "title": "Awesome GitHub Repositories for Web Developer - Part 2",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--HfSsorGN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/n562actscws9k9rfsvpq.png"
        },
        {
          "id": "https://dev.to/whitep4nth3r/whats-the-difference-between-and-in-css-23p4",
          "author": "Salma Alam-Naylor",
          "description": "#css #webdev #beginners",
          "link": "https://dev.to/whitep4nth3r/whats-the-difference-between-and-in-css-23p4",
          "publishedOn": "2022-09-01T09:41:50.000Z",
          "wordCount": 2866,
          "title": "What's the difference between : and :: in CSS?",
          "imageUrl": "https://dev.to/social_previews/article/1181288.png"
        },
        {
          "id": "https://dev.to/francescoxx/how-to-learn-web3-september-2022-3h9h",
          "author": "Francesco Ciulla",
          "description": "#web3 #blockchain #beginners #programming",
          "link": "https://dev.to/francescoxx/how-to-learn-web3-september-2022-3h9h",
          "publishedOn": "2022-09-01T06:03:23.000Z",
          "wordCount": 6015,
          "title": "How to Learn Web3 (September 2022)",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--L7sp3K03--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ir3ojvhv20khaipk7x9l.jpg"
        },
        {
          "id": "https://dev.to/meshvpatel18/top-heroku-alternatives-for-free-46g1",
          "author": "Meshv Patel",
          "description": "#heroku #webdev #programming",
          "link": "https://dev.to/meshvpatel18/top-heroku-alternatives-for-free-46g1",
          "publishedOn": "2022-08-31T13:49:56.000Z",
          "wordCount": 4827,
          "title": "Top Heroku Alternatives for free",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--r_6FrH43--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/6p9g6fa8h6n8w0wfx453.png"
        },
        {
          "id": "https://dev.to/devdevcharlie/building-an-aircraft-radar-system-in-javascript-4ml8",
          "author": "Charlie Gerard",
          "description": "#javascript #webusb #rtlsdr",
          "link": "https://dev.to/devdevcharlie/building-an-aircraft-radar-system-in-javascript-4ml8",
          "publishedOn": "2022-08-29T16:00:41.000Z",
          "wordCount": 3971,
          "title": "Building an aircraft radar system in JavaScript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--bbckrCHJ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://res.cloudinary.com/devdevcharlie/image/upload/v1661734283/Group_36_i7nacq.png"
        },
        {
          "id": "https://dev.to/ijsucceed/7-useful-articles-every-new-developer-should-bookmark-bpg",
          "author": "Jeremy Ikwuje",
          "description": "#codenewbie #webdev #beginners #javascript",
          "link": "https://dev.to/ijsucceed/7-useful-articles-every-new-developer-should-bookmark-bpg",
          "publishedOn": "2022-08-29T13:56:00.000Z",
          "wordCount": 2221,
          "title": "7 Useful Articles Every New Developer Should Bookmark 👍💯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Hp-eZub_--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/g3jvno0v82x6r247c1qo.png"
        },
        {
          "id": "https://dev.to/refine/5-most-common-usestate-mistakes-react-developers-often-make-3aig",
          "author": "Necati Özmen, refine",
          "description": "#react #webdev #programming #opensource",
          "link": "https://dev.to/refine/5-most-common-usestate-mistakes-react-developers-often-make-3aig",
          "publishedOn": "2022-08-29T09:26:00.000Z",
          "wordCount": 5703,
          "title": "5 Most Common useState Mistakes React Developers Often Make",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--icsJRQJA--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/8hwypzqq79uayyyj6ff9.png"
        },
        {
          "id": "https://dev.to/j471n/i-made-all-countries-flags-using-html-css-4cnc",
          "author": "Jatin Sharma",
          "description": "#css #webdev #html #beginners",
          "link": "https://dev.to/j471n/i-made-all-countries-flags-using-html-css-4cnc",
          "publishedOn": "2022-08-28T09:08:00.000Z",
          "wordCount": 6484,
          "title": "I made all countries' flags using HTML & CSS",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Gd_3mxyQ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/bq099o7ud7g1xj3fa2at.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/7-neat-tricks-for-js-that-you-probably-did-not-know-358d",
          "author": "Tapajyoti Bose",
          "description": "#javascript #webdev #programming #productivity",
          "link": "https://dev.to/ruppysuppy/7-neat-tricks-for-js-that-you-probably-did-not-know-358d",
          "publishedOn": "2022-08-28T05:02:31.000Z",
          "wordCount": 2805,
          "title": "7 neat tricks for JS that you probably did not know",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--WA6O6eXN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/f263nocop0yni6w4d3ot.jpg"
        },
        {
          "id": "https://dev.to/daveson217/free-alternatives-to-heroku-3jh9",
          "author": "David Babalola",
          "description": "#help #heroku #webdev #python",
          "link": "https://dev.to/daveson217/free-alternatives-to-heroku-3jh9",
          "publishedOn": "2022-08-26T10:28:07.000Z",
          "wordCount": 5152,
          "title": "Free Alternatives to Heroku",
          "imageUrl": "https://dev.to/social_previews/article/1176747.png"
        }
      ]
    },
    {
      "title": "少数派 -- Matrix",
      "feedUrl": "https://rsshub.app/sspai/matrix",
      "siteUrl": "https://sspai.com/matrix",
      "articles": [
        {
          "id": "https://sspai.com/post/75858",
          "author": "Theia在路上",
          "description": "在这个大众觉醒的时代，我们常常听到「我们需要探索自我，了解自己」。但是，假设我们很粗暴地把人分为三种：认为不需要寻找自我的人（或不知道「寻找自我」重要性的人）、正在寻找自我的人、以及找到了自我的人，第一类人是绝大多数，第二类是少数，第三类是少数中的少数。\n这其实也对应了我们认识自我的三个阶段。\n第一阶段是我们需要觉醒，意识到探索自我的重要性。\n为什么探索自我对每个人都很重要？\n人是需要意义驱动的动物，我们天生有实现自身价值的冲动。但每个人的价值、优势是不同的。我的性格是怎样的？我想做的事情是什么？对我来说，什么最重要？我未来的方向是什么？我想过上怎么样的生活？我的价值实现在哪？这些问题如果得不到解答，短短一生很容易忙忙碌碌、随着大流就这样过去了，实在可惜。\n项飙在《把自己作为方法》中说：\n\n（瓶颈的问题）是回到自己作为一个边缘者、回到我是谁的问题。想清楚究竟我能做什么，我跟世界的关系是什么。我认为世界上所有的人都有这个问题，都得搞清楚自己是谁，否则都会有这种危机，除非完全盲目地被主流裹挟进去。\n\n当我们意识到探索自我的需求之后，我们还需要方法，这就来到了第二阶段——开始寻找自我。但我感觉，很多人对于探索自我的方法却没有什么头绪。\n困难之处，在于「自我」是非常复杂的，我们之所以是今天这样，受到了童年经历、社交媒体、朋友亲人、国家文化等等各种因素的影响，这些影响之中大部分更是在日常不知不觉之中就成为了我们的一部分，所以无论是从横向（各种因素的复杂性）和纵向（性格和价值观形成过程的复杂性）看，自我都是极其复杂的。\n但好在，这几年通过各种各样的渠道和自证，我积累了一些有用的、可执行的方法，想在这里分享给你。\n再多读几本书\n阅读有什么用呢？学习知识肯定是好处之一，可是看完可能就忘了；拓展眼界也是的，可是没去亲身经历还是差了一点。\n那最大的用处是什么呢？我认为， 是读自己。\n在《活下去…",
          "link": "https://sspai.com/post/75858",
          "publishedOn": "2022-09-23T02:15:33.000Z",
          "wordCount": 526,
          "title": "探索自我是一条漫长的路",
          "imageUrl": "https://cdn.sspai.com/2022/09/21/eb77593e76fd2723f1289768ee243036.png"
        },
        {
          "id": "https://sspai.com/post/75709",
          "author": "hkoch24",
          "description": "个人日程管理的需求\n在选择日程管理的形式或者app的时候，我的要求很简单：即先确定需求，再按照需求探索日程管理方式。我对日程管理的需求有几点：\n\n任务与日程要在同一个页面；\n尽可能随手拿起就能使用；\n有较大的自由度，即可以根据个人需求添加备注等；\n要能够自上而下地「俯视」整个日程管理过程；\n随时可以逃离。\n\n根据这几点需求，我开始了自己的日程管理尝试1。\n日程管理尝试\n1. 纸质日程本\n本科时期，还在用着黑莓9790、z10等一些「非主流」手机，他们没办法与电脑形成一个良好的生态系统，所以没有习惯用他们来做日程管理，而是使用传统的纸质日程本。\n当时，已经在用Moleskine的单行笔记本做日记本，对M家的本子很有好感，尤其是口袋本，非常便携。出于一种仪式感的传承，我开始尝试M家的周记本：本子摊开，左边是一周的日程记录，可以记录有确定时间的日程，也可以记录只固定日期的日程；右边是一整面的横线页面，可以写下一些备忘事项，例如可能需要本周或者下周要做的事情等，也可以记录本周的一些打卡事项。\n\n后来尝试了M家特有的400页超厚日程本，一天一页，每一页都是当天从8点到22点的日程记录。本子非常厚，携带有点不方便；记录是方便许多，能写的位置也多了很多，但因为不是每天都有排满的日程，一些琐事写进去也没意思，最终本子留了许多空，总感觉有点浪费，尤其是年终总结的时候觉得似乎是虚度了时光一样。\n\n后来也尝试过MUJI的月记本，但是总感觉没有周记本好用，我便回归Moleskine的周记本，直到我后来舍弃它。\n2. 手机自带日程管理工具\n舍弃纸质日程本的原因有两个：\n\n设备和系统升级了，从「非主流」机升级到了带有安卓系统的Blackberry Keyone，自带的日历强大了很多；\n当时正在读研究生，我们的课比谁都多，每天都被课程排满，而这些课程都写进纸质笔记本里不太可能，只把课程外的待办事项写进本…",
          "link": "https://sspai.com/post/75709",
          "publishedOn": "2022-09-22T05:26:19.000Z",
          "wordCount": 530,
          "title": "日程管理 with Firstseed Calendar",
          "imageUrl": "https://cdn.sspai.com/2022/09/21/e34a123795319a6d562d3dcad16b2a1a.jpg"
        },
        {
          "id": "https://sspai.com/post/75841",
          "author": "CLU",
          "description": "上一篇《exping：一个地图创作工具是怎么诞生的？》 和大家分享了 exping 的诞生故事后。感谢大家的支持与建议，也感谢少数派的推荐，让更多的人认识了 exping ，其中也有投资人、媒体关注到了我们。这是意料之外的收获。时隔3个月，我们有了许多的变化与提升。在这段时间里，也有更多的机会去接触用户，进行深入的交流，从中也更清晰我们的产品定位，以及我们的使命。\n「地图」就像一张画布，是另类的创作载体\n从地图诞生以来，大家对地图的认识，更多是作为「导航指引」用途。其中涉及了不少的学科，如「地图学」、「地理学」、「测绘学」、「遥感技术」等等。根据地图的应用场景，结合这些学科专业，绘制不同的专用地图。\n因此，地图创作对大家来说似乎需要有一定的专业要求。而 exping 的诞生始于让每个人可以轻松、容易地呈现自己的品味地图。地图就像一幅画的画布，一个另类的创作载体。（欢迎看看小编写的文章《emoji + 地图 = exping》）在此之上以标记「点」，绘制「路线」，表达基于地理位置上的故事。「地图」作为重要的画布，重点在于可塑性，如何帮助创作者对地点进行多样性的表达。那或许一般的地图不足以满足这些需求，借此，这次我们和设计师聊聊，exping 专属地图的一些设计心路历程。\n \n\n作为 exping 的设计师，你怎么理解 exping？\n当大家还在以图文的方式分享一个好地方的时候，exping 开始将地图作为主视角。 Explorer 可以方便快捷地添加去过、计划要去的地方以及设计路线，简单或隆重地补充对该地点的评价，上传相关照片。\n通过这种更直接的方式，将你的数据传递给你的观众，大幅度减少了“这是哪里？”，“我也想去”，“环境怎么样？”等问答游戏。\n在这之前，exping 的地图风格是怎样的？\n在 exping v0.1~0.3 的地图风格从 Light （简约）到 Stree…",
          "link": "https://sspai.com/post/75841",
          "publishedOn": "2022-09-21T04:36:13.000Z",
          "wordCount": 582,
          "title": "和设计师聊聊，exping 专属地图是如何设计？",
          "imageUrl": "https://cdn.sspai.com/2022/09/21/614d44f49dd37dfe145e8ff4c2999411.jpg"
        },
        {
          "id": "https://sspai.com/post/75833",
          "author": "一克",
          "description": "阅读初衷\n平时一无聊下来，偶尔会通过消费购物，来提起自己的生活兴致，买东西从挑选，到想象自身使用场景，再到下单盼望着快递，最后拆封这个过程，能在很长一段日子里给自己提供着生活的兴致。而有些时候，反省下觉得单纯是无聊想买买买，而不是使用需求强烈促使我去购物。自觉这种动机是不健康的，同时也很好奇为什么有这种心理，于是便在网络推荐下接触到了这本书——《超市里的原始人》，想借此机会，弄清楚什么是消费主义，对我这种自以为不健康的消费行为如何解剖。\n从看到书名中的「原始人」开始，我就期待着书中内容将追根到底消费的欲望最原始的动机是什么。首先需要引用一下在生物学中对人作为社会性灵长类动物特点的描述：\n\n人类在进化过程中形成了许多小范围的社会集体，身在其中，你的形象和地位就是至关重要的，这已经不仅仅是为了满足生存的需求，还是为了吸引伴侣、娱乐朋友和抚育后代。\n\n消费这件事情之所以扯到这么遥远和深层的角度呢，是因为作者主张需要从进化心理学的角度才能透彻地了解消费主义的根源，消费者虽然会半自觉地设法炫耀出财富、地位和品味，但真正想要展现的是更深层次的心理特质（比如善良、智慧和创意）和生理特质（比如生育能力、强壮、美貌）。\n《超市里的原始人》中的三个关键论点：\n\n人试图展示自身特质的本能与消费主义关系紧密。\n我们用于识别关键人类特质和情感的社交感知系统经过漫长的进化历程变得准确高效，能将所有能收集到的不同暗示聚集起来，察觉出一个人的身体、脸部、语言和行为。\n消费主义在很大程度上就是一种画蛇添足的行为。我们得到了有惊人适应力的人类自我展示的能力，即语言、智慧、善良、创造力和美丽，然后却忘记了如何用它们来结交朋友、吸引配偶和获取声望。相反，我们却依赖通过教育、工作、消费获得的商品 和服务来向他人展示自己的个人特质。这些高成本信号大都是多余的或是误导性的， 所以别人通常都会对其视而不见。\n\n消费主义中…",
          "link": "https://sspai.com/post/75833",
          "publishedOn": "2022-09-20T06:03:03.000Z",
          "wordCount": 518,
          "title": "《超市里的原始人》札记",
          "imageUrl": "https://cdn.sspai.com/2022/09/20/bb8cfd48fe8d7ca5fdde06fc80fb3edb.jpg"
        },
        {
          "id": "https://sspai.com/post/75803",
          "author": "猴猴说话",
          "description": "你用过人工智能写作工具吗？前两个月，我看到了一些AI写作工具推出了文章续写功能。\n\n只要你写上一篇文章的开头和结尾，智能系统就能自动生成一篇完整的文章。虽然现在技术还不成熟，积累的样本数据还不够完善，写出的内容还是会被挑剔，但是我总感觉排布好内容逻辑是迟早的事情。\n在那个时候，AI就能代替我们写作吗？\n作为内容创作者，我们还有活路吗？现在能帮人进行AI写作的工具有很多，从媒体报道、工作汇报这些角度看，人工智能会逐步替代人工写作。它只追求客观报道和逻辑推导，但无法完成偏主观价值判断的内容生产，因为AI不能代替的是我们对内容的「审美」。\n人工智能与审美\n前段时间AI绘画掀起了一阵火热，只要输入一些文字和句子，表达画的风格和内容，AI就能自动生产出一副艺术作品。有的画真的能与大神媲美，吊打国内外大部分艺术工作者。但是，这里的问题是，这个作品从「点子」到「作品」之间，完全忽略了过程。\n怎么判断一个作品已经做到最好了？还能不能更好？这一笔触能不能再调一调？那一个色块能不能再深一些？如果单独抠几个细节，那是调整，如果从头开始就抠细节，那就是「创作」。\nAI写作能根据你前面写的一个词、一段话，自动生成出后面的句子和篇章，但是它对于一个真正想表达的人来说，生产出的段落总会让人差强人意，甚至因为一个字的误用就导致表达结果与表达目的南辕北辙。\n说到底，AI写作只能成为我们的工具，是基于创作者的审美的工具。倘若作者的审美和沉淀不够，反而会出现被工具主导，甚至被代替的困境。如同普通人去使用AI绘画一样，对绘画细节失控，除了标题能自己把控，后面的笔触、构图、用色等细节都和自己无关。如果我们本身就懂绘画，那么还可以去微调，但当我们什么都不懂的时候，剩下的只有无尽的赞叹。通过AI生产出了一个远超自己能力范畴的作品，或者说，它远远超出了我们对作品的审美极限。所以，无法对它进行细节的判定。\n就如同我们在写作…",
          "link": "https://sspai.com/post/75803",
          "publishedOn": "2022-09-20T03:09:38.000Z",
          "wordCount": 496,
          "title": "当 AI 能代替我们写作，我们还有什么？",
          "imageUrl": ""
        },
        {
          "id": "https://sspai.com/post/75822",
          "author": "人形睿",
          "description": "与其说双链是笔记软件，不如说他们是知识管理软件或思维工具。而这个认知上的错位便是导致目前双链饱受争议的原因之一。\n\n双链是个伪概念？\n双链笔记软件目前的争议不少，大家对其的批判也非常实际，可谓是针针见血：\n\n双链的底层逻辑尚未普及，用户无所适从。链接有什么用？哪些应该链接？\nnotion、语雀、印象笔记都能一定程度上双向链接各种文章。虽然稍微简化了一些，但好像也能用啊。\n界面太“硬核”了，不优雅，不美观，基本没有办法给别人看。\n没有办法共享和协作。\n导出十分麻烦，有时候还要靠插件。\n各种命令、快捷键、插件，学习成本高。\n代码程度较高，没有代码基础的人被劝退。\n知识图谱功能基本只是用来装逼，东西一多基本没法看。\n\n可以发现，当我们以“笔记软件”的角度来看待双链，它和目前各种成熟的笔记软件相比差太多了。看着甚至像尚未完成就拿出来给人用的Alpha版本软件，非常粗糙，体验极差。\n但是，如果我们换一个视角，以“知识管理软件”和“思维工具”的角度来看待双链，结果可能会完全不同。而我认为这才是双链的核心优势。\n双链的核心优势——知识管理和思维辅助工具\n1、信息颗粒度更细，便于细化和延展\n个人认为，信息粒度是双链笔记最核心的优势。比起印象笔记以\"篇\"为单位、notion以“块”为单位，双链笔记是以“点”为单位。这就以为着，我们可以将大块的知识细化为一个个相对独立的知识点。同时，在细化的过程中，我们逐渐把各个知识点从原有的语境中解放（抽象）出来，进而形成能够在长时间的考验下保留下来的知识。这样，当日后遇到新的情景的时候，我们也能迅速知识结构，以支持新的目标。\n\n具体而言，以roam research为例，在使用过程中，你任何时候都可以用 [[]] 来关联另一个概念或者页面，或用 (()) 来关联一个句子或一个块。\n2、记录成本低\n大部分双链笔记都是基于大纲笔记的，即整体的框架类似于bull…",
          "link": "https://sspai.com/post/75822",
          "publishedOn": "2022-09-20T03:03:18.000Z",
          "wordCount": 490,
          "title": "双链笔记是伪概念？聊聊双链的核心优势——知识管理",
          "imageUrl": "https://cdn.sspai.com/2022/09/19/94f4c9326acaa41dccd8faa88b7bbaa4.png"
        },
        {
          "id": "https://sspai.com/post/75828",
          "author": "John",
          "description": "在正式开始说体验前，先谈谈索尼在 9 月初正式发布的全新真·小屏旗舰——Xperia 5 IV，在设计上融合了 Xperia 1 系列的特点，总算是更换了硬朗的边框以及磨砂质感的后盖玻璃，可以说完全契合个人的审美爱好，更不用说破天荒加入了无线充电，我对 Xperia 5 III 最不满意的两点都解决了，还有什么理由不买呢？加上最近在各种视频网站看到关于 Xperia 1 IV、5 III 等机器的吐槽，于是就想在 5 IV 到手前，和大家分享一下我的使用体验。\n为何购买 Xperia 5 III\n说起来在今年入手 5 III 之前，我在用的是三星 Galaxy S22 Ultra，S22U 真的什么都好，拍照、系统啥的我都挺满意，而且外观更是延续了曾经最爱的 Xperia XZ Premium 的神韵，当时一发售就冲了。只是在实际使用时，总会觉得这机器实在是太大了，单手用太累，可我又不像当年用黑莓 Passport 那样充满喜爱，对其体积无下限容忍，于是乎就又考虑换台趁手的小屏旗舰机器。\n然后说起现在的小屏机器，基本上没得选，iPhone 就只有 SE 和 12、13 mini，Android 这边能看上眼的就是魅族 18、Galaxy S22 和 Xperia 5 III。综合来看，12、13 mini 因为刘海直接 pass，SE 电量实在担忧，魅族 18 不防水也 pass，只能让 5 III PK S22。作为一个曾经的 Xperia 5 用户，对于 5 III 可以说是完全不担心，唯一的问题就是臭名昭著的火龙 888，但 S22 用的是 8 Gen1，这对卧龙凤雏就随便吧，毕竟我都能接受 S22U 的 8 Gen1 了。最后特意跑去三星官方店实际上手体验 S22 的感觉，由于 S22 70.6mm 的宽度握持时有点撑手不舒服，于是乎 68mm 宽度的 Xperia…",
          "link": "https://sspai.com/post/75828",
          "publishedOn": "2022-09-19T16:31:19.000Z",
          "wordCount": 750,
          "title": "写在 Xperia 5 IV 到手前，我的 Xperia 5 III 体验",
          "imageUrl": "https://cdn.sspai.com/2022/09/20/1528338ded5332b25ded04ff431aa921.jpg"
        },
        {
          "id": "https://sspai.com/post/75799",
          "author": "Journey",
          "description": "Matrix 首页推荐 \nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。\n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\n我是一个拥有七年工龄的年过三十的打工人，base 在北京。\n工作的前五年，我任职于一家外企。凭借着年轻和朝九晚六，工作的大多数时候我都能轻松应付，并没有把运动当回事儿。工作五年后我跳槽到了互联网行业，工作强度和工作时长陡增，对体力和精力都有了新的考验，因此运动也不得不提上了日程。\n但是运动这件事只有想法是没办法做成的，我花了一年多的时间断断续续走了很多弯路。三天打鱼两天晒网经常发生，一下子荒废半个月的情况也并不少见。而最终让我养成运动习惯的是我狠下心氪金，配齐了各种运动辅助工具，并在各种工具的综合作用下，让运动成为了我生活习惯。\n此文写作时间为 2022 年 9 月 19 日，我刚刚收到了 Apple Watch 发送给我的「最坚持奖 - 22 天」的奖章。一个习惯的养成需要 21 天，这个奖章也让我动了念头，想把这个过程分享出来，于是就有了这篇文章。\n2022 年 9 月 19 日 收到最坚持奖 22 天\n我的典型一天：工作日运动\n时间选择\n工作日大家都疲于奔命，很难抽出大块时间来专门运动。所以选择适合自己的运动时间很重要。\n我首先尝试的是下班后跟着 Keep App 来做一些运动。但是遇到了两个阻碍：一个是下班时间不固定，有时候到家已经九点多了，不方便再做剧烈运动，会直接影响睡眠质量；另一个是有时候晚饭吃了比较多的主食，所以整个人头昏脑胀的，大多数时候只想躺着刷剧，并没有意志力再爬起来。\n然后我尝试了在中午的时间运动。我会早十五分钟锁定电脑屏幕赶去健身房，并点好一个定时派送的外卖（运动完后食堂已经关门）。这样实行了快半年时间…",
          "link": "https://sspai.com/post/75799",
          "publishedOn": "2022-09-19T06:47:21.000Z",
          "wordCount": 670,
          "title": "我是如何用工具组合养成运动习惯的",
          "imageUrl": "https://cdn.sspai.com/2022/09/19/d0362c2ee19bc83bee8387af52e98e2e.jpeg"
        },
        {
          "id": "https://sspai.com/post/75786",
          "author": "商隐商隐商商隐",
          "description": "起初，我从未感受到我妈对于衰老的恐惧。直到大概五六年前我家重新装修房子的时候，我妈坚持要在他们卧室的厕所里装一个马桶，后来问了原因才知道，她大概是觉得以后自己老了，万一腿脚不方便了，用马桶会轻松很多。从那一刻起，我才猛然发觉这种隐秘的恐惧。\n第七次全国人口普查的的数据显示，目前中国60岁及以上的人口数量已超2.6亿，这个人数占总人数的18.7%。这就意味着，有相当一部分老人正在经历着这种关于衰老的隐秘恐惧，还会有越来越多的人陷入这种关于衰老的恐惧。\n为了回应这些恐惧，很多人可能最先想到的是“适老化改造”。当然，适老化改造是一个相当大的问题域，本文目前所要探讨的仅仅是房屋的适老化改造，特别是对现有的城镇房屋进行一些“修补性”的适老化改造。\n为什么要进行房屋适老化改造？\n我们需要先回答一个问题：为什么我们要率先对“房屋”这样一个区域进行适老化改造呢？这个问题的答案有很多。\n首先是出于目前国内养老格局的考虑。国内养老事业呈现出一种所谓的“9073”的格局。也就是说，90%左右的老年人居家养老，大约7%的老年人需要依托社区进行养老，最后3%左右的老年人将入住养老院。这意味着大多数老人会在自己的家中度过大部分的晚年时光。这几乎是最适合老人，同时也是最经济的养老方式。\n其次是出于老人活动范围的考虑。随着年龄的增长，老人的社会活动范围会逐渐缩小，老人对于居住空间的依赖程度也会越来越高。这意味着，居住环境成为老人晚年生活最重要的空间载体，居住条件的好坏将会直接影响老人的生活质量。[1]\n再次是出于老年人人体工学的考虑。据老年人人体工学的研究，在衰老过程中人体的尺寸也会发生变化。医学研究资料显示：人在28-30岁时身高最高，35-40岁之后逐渐出现衰减，70岁时身高会比年轻时减少2.5%-3%。[2]这就意味着，随着居住者年龄的增长，房屋也应该发生一些改变。\n所以，出于上述的种种原因，除了大…",
          "link": "https://sspai.com/post/75786",
          "publishedOn": "2022-09-19T02:44:24.000Z",
          "wordCount": 481,
          "title": "房屋适老化改造，为了那场终将到来的落幕",
          "imageUrl": ""
        },
        {
          "id": "https://sspai.com/post/75789",
          "author": "酱紫表",
          "description": "前几天看到时间线上 latter21 有晒 Elgato 的 Stream Deck，感觉很炫酷自定义程度也很高就想买一个。我一查价格居然要一千多一个，太贵了买不起。然后我又看到「爱运动的数码君」有将小爱触屏音箱安装 Macro Deck 的视频，这就是我想要的：一百多能实现 Stream Deck「贫替」。我折腾完用了几天感觉还不错，今天就写个教程和使用体验给大家分享下。\n准备工作\n\n小爱触屏音箱。\nWindows 电脑\nMicro USB 数据线\n下载需要的文件（包含了驱动、刷机包、搞机工具箱、和安卓端的 App）\n\n安装改版固件\n小爱触屏音箱的官方系统是不能安装第三方 app 的，而是需要刷入改版固件才行。安装改版固件不影响小爱同学的正常功能， 也不影响保修。\n安装驱动\n安装驱动\n将文章开头的工具包下载解压，打开 FlashTool - Driver 文件夹里的 Mediatek-Drivers-Install.bat（需要管理员权限），跟随提示完成驱动安装。\n进行刷机\n设置刷机\n打开 FlashTool 文件夹里的 _SPFT.exe 刷机工具，如果弹出报错提示，直接确认忽略即可。\n\n下载 DA 框选择：FlashTool 下 Hikaru_resign-Xiaomi 文件夹里的 DA_Mi_Hikaru-resign.bin\n配置文件选择 Image 文件夹里的 MT8167_Android_scatter.txt\n验证文件选择 FlashTool 下 Hikaru_resign-Xiaomi 文件夹里的 auth_sv5.auth\n\n然后我们将下方的选框从下载改到固件升级。\n刷机过程\n点击下载按钮后，通过数据线连接小爱触屏音箱就会开始刷机。刷机的过程可能需要几分钟到十几分钟，在此期间小爱同学触屏音箱会始终处于黑屏状态，只要能在设备管理器中找到其 com 端口即连…",
          "link": "https://sspai.com/post/75789",
          "publishedOn": "2022-09-18T13:42:39.000Z",
          "wordCount": 625,
          "title": "小爱触屏音箱实现 Stream Deck 贫替",
          "imageUrl": "https://cdn.sspai.com/2022/09/18/fa3f0f3250ff6c3da5a2635eccb52e04.JPG"
        },
        {
          "id": "https://sspai.com/post/75783",
          "author": "玉树芝兰",
          "description": "前些日子，我给你介绍了本地使用 Stable Diffusion 人工智能绘画工具的方法（如何在你的 M1/M2 Mac 本地运行 Stable Diffusion？）。不少小伙伴们反馈说玩儿得很开心。\n\n不过也有不开心的，因为手头儿没有 M1/M2 的 Mac 电脑。\n\n是不是因为设备限制，就只能眼巴巴看着别人体验新科技成果呢？\n当然不是。人工智能技术的普及化，已经是科技发展的潮流趋势了。我今天给你介绍一个不需要安装任何应用的体验方式。而且，更好的消息是，你都不用把自己的想法翻译成英文了，直接输入中文就行。\n这是个微信小程序，叫做「盗梦师」。开发者是西湖大学蓝振忠老师团队。\n我这里给你做个演示。\n今早我看到有人分享了一段视频，是喷气式背包的实验场景。很有意思。\n\n于是我就在朋友圈发了一番感慨：\n\n有了这玩意儿，上班堵车不是事儿了。\n\n感慨之后，觉得光用文字表达不够形象，刚好就可以用「盗梦师」画出来。\n于是我打开小程序，输入了这样一段话：\n\n一个背着喷气式背包的中年人在交通拥堵的马路上轻松自在飞行\n\n这里注意你可以选择绘画的类型。我选择的是「赛博朋克」，我觉得和主题很搭。\n\n然后是选择画家风格。我对赛博朋克艺术家不了解，于是设置成为「不限定」。\n\n下面还有一个选项，是画面的长宽比例。我觉得对于展示的画作来说， 16:9 感觉上比较好。\n好了，做了这些设定后，就可以直接画了。\n\n这里需要等上几秒钟即可，比本地 M1 Mac 运行起 Stable Diffusion 来快多了。画做好了，你感觉怎么样呢？\n\n有了这样的形象画面，朋友圈里的评论一下子就丰富了起来，例如：\n\n假发套得粘的紧一点\n\n以及：\n\n当姑娘们画好了妆，做好了头发，美美的在街上走着，然后突然被人用喷气背包的风吹乱的时候，你猜她们会不会捡石头把它打下来\n\n我觉得，这些担心，都不无道理，值得背包开发商们认真记录和讨论。\n如果你感兴趣的话，直接打开微信，搜索这个小程序试试看吧。上文图中也包含了二维码可以直达。目前阶段，每天有 5 次免费创作机会。然后每分享给一位好友，双方可以获得 20 次创作额度。\n当然，我也尝试了一些其他的图画，例如中国风的「雪中山寺古钟」。\n\n雪、山都齐全了，只是寺庙在哪里？找了半天没看到，哈哈。如果你玩儿过 Stable Diffusion ，应该知道很多时候你需要多画几张，从中选择更合适的图画。所以我准备等明天有了新的额度，再用同样的文本，多画几张对比看看。\n欢迎把你的尝试结果和经验心得分享到留言区，咱们一起交流讨论。\n祝人工智能绘画愉快！\n如果你觉得本文有用，请充电。\n如果本文可能对你的朋友有帮助，请转发给他们。\n欢迎关注我的专栏「科研利器」，以便及时收到后续的更新内容。\n  \n \n延伸阅读\n\n【知识星球精选】刻意练习区的辅助线\n“没有灵魂” 的 AI 文本生成，有啥用？\n可视化卡片笔记写作？我试了最近才开放的 Heptabase\n大块的写作时间？这个时代，它是奢侈品\n互联网上的时光机器",
          "link": "https://sspai.com/post/75783",
          "publishedOn": "2022-09-18T03:44:08.000Z",
          "wordCount": 521,
          "title": "如何免费用微信小程序中文 AI 绘画？",
          "imageUrl": "https://cdn.sspai.com/2022/09/18/0dcfda33859af6cf3caed4de8194ca20.jpeg"
        },
        {
          "id": "https://sspai.com/post/75736",
          "author": "kinh_l",
          "description": "播客的形式和内容日益丰富，其中不乏一些可以与文章、视频媲美的信息价值和密度。我们会通过剪藏、截图来收集文字和图像，然而对于声音为媒介的播客，是否你也产生了“要是能把这段单独截出来就好了”的想法？\n作为半个播客爱好者，我目前一直在使用 Spotify，无论是设备进度同步，还是UI交互，播客的基础功能都算基本满足，唯一遗憾是当听到精彩的片段时，没有裁剪和收藏片段的功能。\n因此开始在市面上寻找这样的应用，我的需求算比较清晰，首先必须要有片段截取功能；其次需要能创建公开链接，无论用于分享朋友还是收集； 最后软件的播客功能需要能过得去，如果能跨平台也是加分项；\n在市面上找了一轮，大体能满足要求的找到了三款，下面就通过比较 Snipd、Airr 和 QlipCast 三个播客应用，给有类似需求的读者做参考。\n💡 喜马拉雅也包含片段截取的“卡擦”功能，但由于广告泛滥和部分内容限制，我个人不纳入考虑，不介意的朋友可以尝试喜马拉雅，从功能齐全、多端同步、网络稳定上都是较优选择，注意敏感内容即可。\n   \n具体比较\n1、整体设计风格\nSnipd 整体风格和 Spotify 相近，大线条的图标以及深蓝渐变和绿色的色彩；\nAirr 界面简洁干净，主要以黑白交错为主，首层只有两个模块：第一个主要是看自己和他人分享的一些片段，第二块包含关注或订阅的播客、听过的节目和创建过的片段。\nQilpCast 作为最近更新已经是两年前的软件，UI 虽无法媲美前两者，也还算得差强人意。\n左：Snipd；中：Airr；右：QlipCast\n2、片段创建和分享功能\n这部分的功能可以说是我的需求核心，功能对比也聚焦在主要的操作流上，即：裁剪与创建片段→ 管理与编辑片段 → 分享/导出\n💡 截取的片段名称在各软件叫法各异，Snip（Snipd），Quote（Airr）和 Qlip（QlipCast），为阅读理解便利，以…",
          "link": "https://sspai.com/post/75736",
          "publishedOn": "2022-09-18T02:50:45.000Z",
          "wordCount": 593,
          "title": "听播客也要收集精彩片段，哪个播客应用更适合？",
          "imageUrl": "https://cdn.sspai.com/2022/09/15/fce71d2176ad98449f0b5675143ce87f.png"
        },
        {
          "id": "https://sspai.com/post/75781",
          "author": "闲者时间_王掌柜",
          "description": "打算开一个新的系列「Obsidian 综述」，不同于「玩转 Obsidian」系列，「综述」更关注 Obsidian 的功能和插件的使用，而「玩转」系列更成体系，它们的区别：\n\n综述系列重点在「介绍」，针对 Obsidian 近期的新功能、新插件、新主题进行体验。并在使用过一段时间之后，进行简单的介绍和归纳。\n玩转系列重点在「方法论」，是在吃透了「综述」内容之后，结合自己的体验进行总结和提炼。\n\nv0.16 重磅更新\n最近 Obsidian 重磅发布了 v0.16 ，当然目前还属于「内部预览」版，只有付费支持的用户才能体验，不过大家也不用着急，通常「公开版」也不会等太久。\n最大的升级是「重新设计了 Obsidian 的界面」带来了「标签组」等重磅功能，官方内部对这次新 UI 称为 Dragonglass（龙晶），从体验上看完全颠覆了从前我对 Obsidian 界面和易用性上的感知，贴几张个人使用的图大家感受一下：\n\n这次 UI 升级是重头戏，本篇不会事无巨细的介绍所有升级点，我会挑选几条个人最满意的地方跟大家展开介绍，如果您想了解本次所有升级功能可以参考官方文档：\n\n中文介绍\n英文介绍\n\n工作区支持「标签组」\n本次升级引入了「标签组」概念，「标签组」简单理解，就像我们在「浏览器」上使用「标签组」一样，在 Obsidian 中通过多个「标签组」每个组多个「标签页」，可以较大限度的实现「平铺散列」的阅读方式，如图：\n \n\n「标签组」的优势在于一方面我们可以通过快速切换「标签组」内的不同「标签页」，提高「信息摄入速度」；另一方面「标签组」也极大拓展了我们打开「笔记」的数量。这两点优势在「整理知识」和「创意输出」的时候非常有用。\n在升级前我们只能采用「下图」中的方式打开多篇「笔记」，这种方式最大的问题是「最多同时可以看到 2篇笔记全貌」，如果想要看到更多需要将笔记拖拽到「中间区域」…",
          "link": "https://sspai.com/post/75781",
          "publishedOn": "2022-09-17T17:39:57.000Z",
          "wordCount": 682,
          "title": "Obsidian 综述 - 新 UI 新征程（v0.16 发布之际）",
          "imageUrl": "https://cdn.sspai.com/2022/09/18/9dc96a22ac7544635050e9bcb38541a5.jpeg"
        },
        {
          "id": "https://sspai.com/post/75769",
          "author": "雪伊莲梦璃",
          "description": "小众消息的冯大辉前两天推送了一篇很有意思的文章，大概是探讨一个B站视频对微信存储机制可能存在的误解。文中提出了一个实验方法，看到做了试验可能会有奖品，我眼睛一下放光，不如就趁此机会做几个试验，好好探讨一下微信在iOS上的文件存储机制，包括：\n\n转发文件是否会占用额外的存储空间？\n从同一人处多次接收同一份文件是否会占用额外的空间？\n从不同人处多次接收同一份文件是否会占用额外的空间？\n微信和WeChat在以上这些问题上是否存在差异？\n同一台手机上的不同微信账号接收的同一文件是否占用额外存储空间？\n\n试验的环境是iOS 14.8.1、iPhone 11、微信8.0.28。首先我们删除手机上的微信重新安装。登录一个WeChat小号（小号A）。此时微信占用的空间是少的可怜的752.2MB，其中数据占244.5MB。我提前准备好了一个Ubuntu的iso镜像（880MB）。将它发送给这个小号。下载后重启手机，可以看到，微信占用的空间变成了1.77GB，其中数据占1.26GB。多出来大约1GB的空间，可能是除了文件以外的缓存、其他需要的程序和资源文件。\n接收文件前后的微信\n接下来我们正式开始实验。我们讲接收到的文件转发给三个不同的小号。重启手机，可以看到，如冯大辉所料，微信所占用的存储空间并没有增加。依然是1.77GB（数据1.26GB)。微信显然做了最基本的文件存储去重。\n所占空间没有变化\n接下来，我从另一个微信号将刚刚发送的文件再次转发给小号三遍。当我点进新发送的文件时，看到需要接受文件，我有一种不详的预感。难道微信真会重新接收一遍文件？所幸，当我点击接收文件后，文件在一瞬间就接收完成了。显然，微信也伴有服务器端的去重，在服务器上的同一份文件，在本地并不会接收多次。重启手机也可以看到，微信占用的空间并无增加。\n看似要重新接收，实际所占空间没有明显变化\n按照这个逻辑，即使是不同的人转发给我的同一份文件，应该也不会需要重复下载，或是占用额外的空间。我试着用另外两个小号（小号B、小号C）将同一份文件转发给小号A。虽然也显示需要接收文件，但同刚才一样，一瞬间就完成了接收。再次重启手机，微信所占用的空间依旧没有变化。\n不过，刚才验证的情况中，虽然是多个账号转发给一个小号，但是微信很容易在服务器端追溯到，这些文件的源头是同一个。那假如各个账号是各自上传的同一份文件，微信在服务器端是否也有去重能力呢？为此，我在另一台小米手机上登录小号B与小号C，各自发送同一份文件给小号Ａ。发送文件的时间较长。这似乎足以让人判断出，微信大概没有类似百度网盘的文件去重判断。\n然而出人意料的是，小号A还是一瞬间就完成了文件的接收。重启手机后也可以看到，微信所占用的空间并没有明显增加（总计1.83GB，数据1.32GB）。这说明至少在服务器端，微信确实能够判断出一份文件是否曾经上传过。而缺少类似网盘的秒传功能，可能是微信本身没有相关功能，也可能是Android端微信需要优化。\n实际所占空间依然只有一份文件大小\n出于好奇，我又尝试从小号B发送一份内容相同，只有文件名不同的文件，看看微信的查重是否基于文件名，或是基于文件本身。经过等待漫长的发送，如我所料，接收只在一瞬间就完成了。由此可知，微信的文件去重基于内容，并不依赖名字。\n不同文件名也不会多占用空间\n上面测试的都是同一账号下的情况。那么，同一台手机上的不同账号间又是怎样呢？我尝试在刚刚登录小号A的手机上切换了一个微信账号B。可以看到，这次转发收到的相同文件，需要重新接收下载。重启手机也能看到微信的占用空间变为3.8G（数据3.29G）。不过在这一微信账号下，同一文件仍然只需要下载保存一份，再次收到就能秒存。同时利用这个微信账号简单试了一下，我发现以上WeChat的文件存储机制对微信也同样成立。\n实打实地需要下载，所占空间也倍增了\n到这里，我们可以基本得出结论，iOS的微信文件存储去重做得还是比较令人满意的。同一账号下的同一个文件，只要内容相同，就只会在本地留存一份。未来微信团队可以努力的方向是不同账号间的文件存储去重。\n另外值得一提的是，微信大概是真的有在代码层面实现去重，而非依赖APFS的CoW特性。因为即使只占一份空间，iPhone在统计容量时也会重复计算一个文件的多次拷贝。通过多次复制粘贴同一份文件，你能很容易地复现苹果的这个Bug：\n苹果什么时候出4T iPhone？\n在我原本的设想中，我写出这篇文章后，与其拿到那500元钱，我更想获得一个与Fenng交流的机会，说服他微信是一个糟糕的产品。但转念一下，即使我做到了，也并不能改变得了微信这个产品本身，以及我们必须使用它的环境。更何况再一看那篇文章，是要证明微信没有去重才能拿到那笔钱。是我审题不细了😀\n\n如果你觉得我的这篇文章不错，也欢迎你阅读我之前有关微信的两篇文章：虎头蛇尾的《微信戒断实验》与尝试减少微信占用空间的《微微微信怎么办》。",
          "link": "https://sspai.com/post/75769",
          "publishedOn": "2022-09-17T15:03:28.000Z",
          "wordCount": 490,
          "title": "试探索iOS微信文件存储机制",
          "imageUrl": ""
        },
        {
          "id": "https://sspai.com/post/72429",
          "author": "Pendulumchirs",
          "description": "智能家居。我的理解是：智能的、易用的，能给生活提供极大便利的，才能称之为「智能家居」。\n大家好，我是少数派新晋 Martix 作者，目前从事主要以政府项目为主的运营。作为我在少数派潜水多年后的第一篇内容，就是如何利用极低的成本打造属于你的智能家居。\n内容背景\n\n本文将以「Home Assistant」智能家居平台（简称 「Home Assistant」，下同），开展工作，并通过 iOS 的 HomeKit 及 Android 自身的设备管理器来控制智能家居配件。关于「Home Assistant」的详细介绍，如何部署及安装插件的教学，少数派已有前辈进行了详细说明，这里不再赘述。\n\n需强调的是，笔者通过 Debian 10 进行部署，版本是 2022.3.8，预装插件与其他方法略有出入。\n由于系统过于老旧，「Home Assistant」的 Home Assistant Supervisor 不再支持 Debian 10 ，但使用下来，似乎实际上没有影响。\n重复造轮子？\n\n既然前辈已经在少数派中发表了基于「Home Assistant」构建的「智能家居」内容，为何笔者仍然要以此作为在少数派的第一篇内容？不是前辈撰写的内容不好，只是内容方向不同，本文将基于 YAML 语言来定制属于自己的「智能家居」。\n本文将尽可能使用通俗的语言，力求做到即使每一位读者未曾接触也不能理解 YAML 语言的情况下能码出自己想要的配置文件，但由于笔者对 YAML 语法也未能做到了然于胸，更多地是一边学习一边进行，涉及到变量的部分无可奉告。\n自身情况及案例\n自身情况\n\n笔者家中由于入网设备较多，以及需要多网合并带宽等需求，传统路由器性能已无法达到笔者需求，因此家中有一台低功耗服务器作为软路由使用，部署在 VMware 虚拟机中。\n\n所使用网络基于中国电信，配备有公网非固定 IP 和动态域名。\n自身案例…",
          "link": "https://sspai.com/post/72429",
          "publishedOn": "2022-09-16T08:13:13.000Z",
          "wordCount": 1225,
          "title": "跟着操作，50元创造属于你的智能家居",
          "imageUrl": ""
        },
        {
          "id": "https://sspai.com/post/75740",
          "author": "四喜茶茶",
          "description": "近日（2022/9/15）设计圈有个大新闻，Adobe 公布了收购 Figma 的消息：\n\nAdobe 的官方公告\nFigma 的官方公告\nFigma CEO 的推特\n\nAdobe 决定用 200 亿美元（一半股票，一半现金）收购 Figma，交易还需要获得监管部⻔的批准，预计将在 2023 年完成。\n这对于设计界来说是一个爆炸性的新闻，虽然在此前也有征兆，早在去年（2021）Figma 的最早的两个联合创始人之一，与现任 Figma CEO 在大学时期一起创建 Figma 的前 CTO Evan Wallace 从 Figma 离职了，可能在那时就已经决定了 Figma 的命运。\n对于这次收购，很多设计师对 Figma 非常的悲观，相比 Figma 而言 Adobe 更像是一个无情的资本机器，收购来的产品鲜有好下场的，上一个 Adobe 收购的界面设计工具 Macromedia Fireworks 已经死在 2013 年了。\nMacromedia Fireworks 1.0\n而 Adobe 的旧有产品缓慢又迟钝的更新，在设计师群体中形成了 Adobe 就是一头笨拙的大象的印象。在过去，设计师们既不满意又无法逃过 Adobe 的魔掌，Figma 的出现让设计师至少在 UI 设计领域上挣脱了 Adobe 的束缚，可惜即使 Figma 在 UI 设计领域战胜了 Adobe，又拓宽了设计与协作的领域，最终还是被 Adobe 花钱摆平了。\n很多设计师对 Adobe 收购最有印象的是 2005 年收购 Macromedia，曾经风靡一时的 Macromedia 产品 Dreamweaver、Fireworks、Flash、 Authorware 几乎都死在了 Adobe 手上，其实 Adobe 的买买买从更早就开始了，Adobe 的代表产品 Photoshop 就是 1995 年收购…",
          "link": "https://sspai.com/post/75740",
          "publishedOn": "2022-09-16T08:12:18.000Z",
          "wordCount": 759,
          "title": "Adobe 收购 Figma 之后会怎样",
          "imageUrl": "https://cdn.sspai.com/2022/09/16/186307ab773070e83bb4550e016075b6.png"
        },
        {
          "id": "https://sspai.com/post/75751",
          "author": "Krrrrrik",
          "description": "Spotify 可以说是少数派中无所不知的一款音乐软件，简洁克制的界面设计和无干扰的听歌体验吸引了不少听众。但是一直以来，Spotify 在 Android 上算不上有特别好的体验。尤其是一直没有修复的手势条沉浸问题，一条黑色的底边让人感到非常膈应。Spotify 似乎也没有做Light Mode 的打算，如果能有个亮色主题也会非常好看。\n来源：@酱紫表\n⚠️使用该 App 需要有 Spotify Premium\nIntroducing to New redesign Spotify: Jetispot\n\n打开应用的第一个界面，我就已经被吸引到了。这些控件按钮都有十足的“原生”的味道\nWelcome to Jetispot!\n开始体验一下全新风格的 Spotify\n登录后，可以看到主界面和Spotify的基本排布类似。Navigation Bar 上分为主页、搜索和资料库，右上角的三个小图标排布也相同。不过可以看到，作者还添加了两个分类标签：Music 和 Podcasts & Shows。我认为这是一个很实用的功能，毕竟谁也不想在公共场合打开后看到播客里显示一些很奇怪的东西 可惜这个App本身还未完成，这部分还不能正常使用。\n\n随意探索一下\n可以看到在搜索页面依然是大差不差。最明显的就是 Browse all 所有的卡片都用上了圆角。不过也能看到搜索栏功能还尚未实现。\n\n现在，我们来选择一个专辑看看\n可以看到在专辑页面中，背景色不再是原来的偏向于黑暗的页面。背景的渐变颜色是根据专辑封面来选取的，与 Spotify 相比感觉没有那么的压抑，整体显得很轻快明亮。\n\n选择一首歌来听听\n感觉加载速度和 Spotify 比起来没有很大的延迟，就是一个用起来不会因为加载不动而感到不舒适。不过这个音乐界面相对来说有一些简陋，上半部分很空旷。同时进度条也没有用上长得像蛇一样的波浪条👀\n\n还可以做的更好\n\n整体而言，我对 Android 上能有一个外观不错的 Spotify 第三方还是很满意了。\n毕竟 Spotify 连个手势条沉浸都不管\nJetispot 可以说是很好看，但绝对算不上稳定优秀。\n在我使用的过程中经常会偶尔遇到闪退和 Bug。而且这个软件很多功能尚未完成：搜索栏尚未支持，消息通知点无法使用，主页的筛选也无法使用，点赞的功能尚未实现，通知栏中的小图标也尚未适配。\n小图标的位置只有空虚⚪\n该 App 目前仍然在继续开发中。作者在 Telegram Channel 中还发布了正在制作歌词部分的预览。\n以下是作者在 Github 上的规划\n\nWhat's working:\n\nsign in (login/pass only, no FB/Meta/whatsoever support, no Smart Lock either)\n\"browse\", \"home\", album, premium plan, artist and genre screens (some of the blocks might be unsupported)\nlibrary: \"liked songs\" w/ tag&sort support, rootlist (liked playlists) + pins + artist/album support w/ nice animations, delta updates + pub/sub processing support\nbasic playback w/ Spotify Connect support (connect support is very WIP)\nfairly optimized R8 rules, providing approx. 5-6 megabytes release APK size (with the playback and protobuf parts!)\n\nWhat's in progress:\n\n\"Now Playing\" improvements\nbetter service (notification improvements)\n\n希望可以能够长久的发展下去，RIP for Xpo Music🙏\n你可以在 Github 或 Telegram Channel 免费下载使用 Jetispot。",
          "link": "https://sspai.com/post/75751",
          "publishedOn": "2022-09-16T07:28:05.000Z",
          "wordCount": 631,
          "title": "App+1 | Android 上更加好看的 Spotify ：Jetispot",
          "imageUrl": "https://cdn.sspai.com/2022/09/16/fe65a64116a42932c7cbf62aeb9c2356.jpg"
        },
        {
          "id": "https://sspai.com/post/75685",
          "author": "猴猴说话",
          "description": "如果你到了一个陌生的地方旅游，你会选择哪种方式？\n\n方式一：去名胜古迹，或被证明过很好玩的地方打卡；\n方式二：随机开车，走到哪儿就在哪儿玩。\n\n我是属于比较保守的那类人，我会选择第一种，这样感觉更保险。但是我住在加拿大的姨娘选择的是第二种。下面这个是她的朋友圈：\n\n随机点地图的出行方式让我心生艳羡，于是评论道「特别好」。\n但我想很多人，包括我在内，都会觉得这种靠随机点地图就走的方式比较冒险，就像去到一家陌生的商场里，会先通过大众点评的评级进行一轮筛选，然后再去看对应店家下的评论，最后确定在了一家网红餐厅上。\n这种由别人构建出的无形的价值系统，会让我们不自觉地去遵从，我把这种价值系统称作「体裁」。\n拧巴、纠结、焦虑，都可能是因为你身处的体裁与你的内在目标产生了矛盾。我想通过这篇文章，疏通一下你的「自我拧巴」情绪。\n一、体裁与规则\n体裁原本指的是「一切艺术作品的种类和样式」。一个表现形式，只有在特定的场景中，才会发挥应该有的意义。\n赵衡毅在《趣味符号学》里说1：\n\n所有的符号文本，都从属于一定的体裁，体裁是一种符号发出者与接收者都接受的一个文化契约，在契约中，符号的发送者与接收者互相限制对方的自由，但是增加了效率。\n\n比如，小说和说明书就是不同的体裁，两者都有对应的呈现形式。而对于读者而言，看小说可以不用当真，但是看说明书需要一板一眼地照着指示来改变现实。\n在看一本书之前，先知道它属于什么体裁，就能提高你和作者的沟通效率。再比如谍战人员之间秘密传输的暗号，就需要严格按照对应的体裁规范，去生成信息和解析信息。\n体裁如果延伸到我们的生活方式里，它就是某一个群体约定俗成的潜规则。这些规则会束缚着我们的思想和行为。群体有大有小，小到某一个兴趣社群，大到社会性别的约束。\n20年前，一位陕西咸阳附近农村的家庭妇女，从小的家里教育就是要孝敬公婆、做好饭、做好衣服、照顾孩子。\n她是大家眼里的好…",
          "link": "https://sspai.com/post/75685",
          "publishedOn": "2022-09-15T09:44:18.000Z",
          "wordCount": 479,
          "title": "打工人如何让自己从「商品」变成「艺术品」？",
          "imageUrl": "https://cdn.sspai.com/2022/09/12/257f53b8a76aef0a27bf7a75e6170846.jpg"
        },
        {
          "id": "https://sspai.com/post/75719",
          "author": "莱森",
          "description": "Part 0 引入\n众所周知，Watch 有两种视图。第一个是「列表视图」，第二个则是「蜂窝视图」。我第一次用蜂窝视图的时候觉得这种交互模式非常炫酷，但是用了一段时间后的感受是 —— 「就像把杂货箱的东西全部倾倒出来，然后直到找着这一次需要的东西」。这无疑是一个非常糟糕的体验，因为每一次找 App 都要反复体验一下找杂物的难受感。所以这里触发了一个痛点是：「买完 Apple Watch 之后，我们应该如何快速找到并打开目标 app 呢？」\n回忆一下小时候混乱的工具箱\n本篇文章的前提 —— 在抛除了「Siri」、「程序坞」、「表盘上的快捷入口」三种检索方式的基础之上，再来探索有没有办法可以进一步提高效率，让我们的「应用菜单」也可以具备更强的检索性，做到井井有条。\nGrid View（网格视图，我也喜欢称为蜂窝视图）\nPart 1 思路总括\n一开始我是换回了习惯的「列表视图」，依靠皇冠的转动来找到 App。但是列表视图有个问题是 —— 你无法调整 App 的显示顺序。就算你可以调整并分类 App，你也有可能需要在「单向」上线性地浏览众多的 App 之后才能找到目标，\nList View（列表视图）\n所以思路开始清晰起来 —— 如果我们把应用进行分类，并从中心延伸到几个不同的方向，就可以减少查找的时间和查找的路径长度。基于此，我们利用蜂窝的特性，从中心恰好可以切割出 6 条大方向，代表 6 个大类，然后把最主要的 App 直接放到 6 条线上。相当于至少提高检索速度 6 倍。\n自制演示图\nPart 2 和我一起来分类\n现在，请大家停下 1 分钟，和我一起思考：我的 Apple Watch 上大致都有哪些 app 呢？对于我而言，我会分为以下 6 大类（逆时针），然后把最常用的放到线上：\n\n健康\n运动\n音乐·声音\n办公·社交·信息\n支付\n其他工具\n\nPart 3 和我一起思考 6 …",
          "link": "https://sspai.com/post/75719",
          "publishedOn": "2022-09-15T06:56:56.000Z",
          "wordCount": 635,
          "title": "一日一技｜六边形法迅速查找 Apple Watch 中的 app",
          "imageUrl": "https://cdn.sspai.com/2022/09/14/d128741fed4c4eeeed1bf4df750df0ae.jpeg"
        },
        {
          "id": "https://sspai.com/post/75731",
          "author": "拐子狼",
          "description": "大雾重重，时代喧哗造物忙。火光忷忷，指引盗寇入太行。\n近期，微信因推出输入法再次冲上热搜，由于越使用占用空间越大，又一次激起了人们对微信「小而美」的调侃。\n为什么微信越来越臃肿了？在过去十一年来，微信是如何一步一步成为一个超级 APP 的？为了了解背后的发展故事，我作了此文加以梳理。研究中国最大的社交软件的发展史，其实也是研究过去十几年来简中移动互联网的变迁过程。也是试图解答一个徘徊许久的疑问：这些在摇滚精神和改革开放理念下成长的一代人，简中世界互联网的掌门人，作为新中国历史以来最成功的阶级上升案例，又是如何一步一步，从勇者变成恶龙的。\n本文亦有视频版本。\n老大哥在看着你\n在 1984 的开篇有这么一句话：无论你走往哪个方向，总有一双眼睛跟着你。Big Brother is watching you.\n\n如今，无论身处何时何地，只要打开手机，也有一双眼睛在看着你。\n船票：新大陆与旧秩序\n今年是世界末日后的第十年。在今天，很多人可能并不了解或已经遗忘了 2012 的含义。但在十年前，桌面互联网发展的高峰之时，新兴媒体里关于世界末日的讨论贯穿了 2012 年始末。2012 贴吧也是那一年里最热门的百度贴吧之一。有人发帖说自己变卖了全部家产，准备在末日到来前玩个痛快。\n风靡一时的 2012 贴吧\n待到末日论调随新年钟响而息鼓偃旗，人们发现生活还要继续；曾以为世界将有很大的变化，然而现实来临时却总是似是而非，但未来的确将有所不同。\n2011 年，采用三明治架构的、被视作时代经典的 iPhone 4 进入中国市场；同年，iPhone 4S 在乔布斯逝世前一天发布，被喻为乔布斯的遗作，引起了热烈的抢购和黄牛加价。「割肾换爱疯」的梗也从那时流传开来。十月份，《乔布斯传》中文版上市，成为当年排行第一的畅销书，销量甚至力压了当时常年霸占销冠、各有新书的韩寒和郭敬明。在一篇《萌芽》杂志对韩寒的…",
          "link": "https://sspai.com/post/75731",
          "publishedOn": "2022-09-15T04:59:20.000Z",
          "wordCount": 639,
          "title": "微信，成为老大哥",
          "imageUrl": "https://cdn.sspai.com/2022/09/15/834886cdbed3c4fe77e99cc4d0c8bb05.png"
        }
      ]
    },
    {
      "title": "Opensource.com",
      "feedUrl": "https://opensource.com/feed",
      "siteUrl": "https://opensource.com/",
      "articles": [
        {
          "id": "70199 at https://opensource.com",
          "author": "Seth Kenlon",
          "description": "Drop your database for PostgreSQL\nSeth Kenlon\nSat, 09/24/2022 - 03:00\n\n            \nDatabases are tools to store information in an organized but flexible way. A spreadsheet is essentially a database, but the constraints of a graphical application render most spreadsheet applications useless to programmers. With Edge and IoT devices becoming significant target platforms, developers need powerful but lightweight solutions for storing, processing, and querying large amounts of data. One of my favourite combinations is the PostgreSQL database and Lua bindings, but the possibilities are endless. Whatever language you use, Postgres is a great choice for a database, but you need to know some basics before adopting it.\nInstall Postgres\nTo install PostgreSQL on Linux, use your software repository. …",
          "link": "https://opensource.com/article/22/9/drop-your-database-for-postgresql",
          "publishedOn": "2022-09-24T07:00:00.000Z",
          "wordCount": 2554,
          "title": "Drop your database for PostgreSQL",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/lenovo-thinkpad-laptop-concentration-focus-windows-office.png"
        },
        {
          "id": "70205 at https://opensource.com",
          "author": "Raigor Jiang",
          "description": "How to build a dynamic distributed database with DistSQL\nRaigor Jiang\nFri, 09/23/2022 - 03:00\n\n            \nDistributed databases are common for many reasons. They increase reliability, redundancy, and performance. Apache ShardingSphere is an open source framework that enables you to transform any database into a distributed database. Since the release of ShardingSphere 5.0.0, DistSQL (Distributed SQL) has provided dynamic management for the ShardingSphere ecosystem.\nIn this article, I demonstrate a data sharding scenario in which DistSQL's flexibility allows you to create a distributed database. At the same time, I show some syntax sugar to simplify operating procedures, allowing your potential users to choose their preferred syntax.\nA series of DistSQL statements are run through practica…",
          "link": "https://opensource.com/article/22/9/dynamic-distributed-database-distsql",
          "publishedOn": "2022-09-23T07:00:00.000Z",
          "wordCount": 3731,
          "title": "How to build a dynamic distributed database with DistSQL",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/BIZ_darwincloud_520x292_0311LL.png"
        },
        {
          "id": "70200 at https://opensource.com",
          "author": "Seth Kenlon",
          "description": "Install JDBC on Linux in 3 steps\nSeth Kenlon\nFri, 09/23/2022 - 03:00\n\n            \nWhen you write an application, it's common to require data storage. Sometimes you're storing assets your application needs to function, and other times you're storing user data, including preferences and save data. One way to store data is in a database, and in order to communicate between your code and a database, you need a database binding or connector for your language. For Java, a common database connector is JDBC (Java database connectivity.)\n1. Install Java\nOf course, to develop with Java you must also have Java installed. I recommend SDKman for Linux, macOS, and WSL or Cygwin. For Windows, you can download OpenJDK from developers.redhat.com.\n\nMore on Java\nWhat is enterprise Java programming?\nRed Hat …",
          "link": "https://opensource.com/article/22/9/install-jdbc-linux",
          "publishedOn": "2022-09-23T07:00:00.000Z",
          "wordCount": 1391,
          "title": "Install JDBC on Linux in 3 steps",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/java-coffee-mug.jpg"
        },
        {
          "id": "70204 at https://opensource.com",
          "author": "Alan Formy-Duval",
          "description": "5 Git configurations I make on Linux\nAlan Formy-Duval\nThu, 09/22/2022 - 03:00\n\n            \nSetting up Git on Linux is simple, but here are the five things I do to get the perfect configuration:\nCreate global configuration\nSet default name\nSet default email address\nSet default branch name\nSet default editor\nI manage my code, shell scripts, and documentation versioning using Git. This means that for each new project I start, the first step is to create a directory for its content and make it into a Git repository:\n$ mkdir newproject\ncd newproject\ngit init\n\n\n\n            \nMore on Git\nWhat is Git?\nGit cheat sheet\nMarkdown cheat sheet\nNew Git articles\nThere are certain general settings that I always want. Not many, but enough that I don't want to have to repeat the configuration each time. I l…",
          "link": "https://opensource.com/article/22/9/git-configuration-linux",
          "publishedOn": "2022-09-22T07:00:00.000Z",
          "wordCount": 2051,
          "title": "5 Git configurations I make on Linux",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/linux_keyboard_desktop.png"
        },
        {
          "id": "70202 at https://opensource.com",
          "author": "Stephan Avenwedde",
          "description": "6 Python interpreters to try in 2022\nStephan Avenwedde\nWed, 09/21/2022 - 03:00\n\n            \nPython, one of the most popular programming languages, requires an interpreter to execute the instructions defined by the Python code. In contrast to other languages, which compile directly into machine code, it’s up to the interpreter to read Python code and translate its instructions for the CPU performing the related actions. There are several interpreters out there, and in this article, I’ll take a look at a few of them.\nPrimer to interpreters\nWhen talking about the Python interpreter, it’s usually the /usr/bin/python binary being referred to. That lets you execute a .py file.\nLexing - The human-made source code is converted into a sequence of logical entities, the so called lexical tokens.\nPar…",
          "link": "https://opensource.com/article/22/9/python-interpreters-2022",
          "publishedOn": "2022-09-21T07:00:00.000Z",
          "wordCount": 2115,
          "title": "6 Python interpreters to try in 2022",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/python-programming-code-keyboard.png"
        },
        {
          "id": "70201 at https://opensource.com",
          "author": "Amar Gandhi",
          "description": "My favorite open source alternatives to Notion\nAmar Gandhi\nWed, 09/21/2022 - 03:00\n\n            \nIf you have notes to yourself scattered throughout your hard drive, you might need a notes application to collect and organize your personal reminders. A notes system can help you track ideas, important tasks, and works in progress. A popular application that isn't open source is Notion, but here are two options that respect your privacy and data.\nStandard Notes\nStandard Notes is an open source (AGPL 3.0 license) notes application featuring a password manager, a to-do list, and, of course, a great system for writing and storing notes.\nOne of the most important things about taking notes is finding them again, so organization is critical. Standard Notes uses an intuitive and natural tagging syste…",
          "link": "https://opensource.com/article/22/9/open-source-alternatives-notion",
          "publishedOn": "2022-09-21T07:00:00.000Z",
          "wordCount": 1535,
          "title": "My favorite open source alternatives to Notion",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/notebook_pen_cc_anniversary_desk.png"
        },
        {
          "id": "70196 at https://opensource.com",
          "author": "Don Watkins",
          "description": "3 ways to use the Linux inxi command\nDon Watkins\nTue, 09/20/2022 - 03:00\n\n            \nI was looking for information about the health of my laptop battery when I stumbled upon inxi. It's a command line system information tool that provides a wealth of information about your Linux computer, whether it's a laptop, desktop, or server.\nThe inxi command is licensed with the GPLv3, and many Linux distributions include it. According to its Git repository: \"inxi strives to support the widest range of operating systems and hardware, from the most simple consumer desktops, to the most advanced professional hardware and servers.\"\nDocumentation is robust, and the project maintains a complete man page online. Once installed, you can access the man page on your system with the man inxi command.\n\nMore Li…",
          "link": "https://opensource.com/article/22/9/linux-inxi-command",
          "publishedOn": "2022-09-20T07:00:00.000Z",
          "wordCount": 1992,
          "title": "3 ways to use the Linux inxi command",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/code_computer_laptop_hack_work.png"
        },
        {
          "id": "70186 at https://opensource.com",
          "author": "Seth Kenlon",
          "description": "Security buzzwords to avoid and what to say instead\nSeth Kenlon\nTue, 09/20/2022 - 03:00\n\n            \nTechnology is a little famous for coming up with \"buzzwords.\" Other industries do it, too, of course. \"Story-driven\" and \"rules light\" tabletop games are a big thing right now, \"deconstructed\" burgers and burritos are a big deal in fine dining. The problem with buzzwords in tech, though, is that they potentially actually affect your life. When somebody calls an application \"secure,\" to influence you to use their product, there's an implicit promise being made. \"Secure\" must mean that something's secure. It's safe for you to use and trust. The problem is, the word \"secure\" can actually refer to any number of things, and the tech industry often uses it as such a general term that it becomes …",
          "link": "https://opensource.com/article/22/9/security-buzzword-alternatives",
          "publishedOn": "2022-09-20T07:00:00.000Z",
          "wordCount": 1790,
          "title": "Security buzzwords to avoid and what to say instead",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/security-lock-password.jpg"
        },
        {
          "id": "70197 at https://opensource.com",
          "author": "Oluwaseun",
          "description": "I got my first pull request merged!\nOluwaseun\nMon, 09/19/2022 - 03:00\n\n            \n\nWords cannot express my joy when I got the notification about the merge below, and I owe it to my current engineering school, AltSchool Africa.\n  \n\n\n      \n   \nImage by: \n(Awosise Oluwaseun, CC BY-SA 4.0)\nBefore this, I had been introduced to open source many times, told about its importance in the tech space, and even attended open source conferences (e.g., OSCAFest). I had all the instant excitement to start, but imposter syndrome set in on opening GitHub to create something.\nFast forward to Monday, the 8th of August, 2022, when I watched Bolaji's video on contributing to open source. I felt pumped again, but I wanted to apply what I learned, so I noted some steps.\nThe steps:\nI made up my mind I was goin…",
          "link": "https://opensource.com/article/22/9/first-pull-request-merged",
          "publishedOn": "2022-09-19T07:00:00.000Z",
          "wordCount": 1714,
          "title": "I got my first pull request merged!",
          "imageUrl": "https://opensource.com/sites/default/files/dandelion_zoom.jpg"
        },
        {
          "id": "70185 at https://opensource.com",
          "author": "Moshe Zadka",
          "description": "PyLint: The good, the bad, and the ugly\nMoshe Zadka\nMon, 09/19/2022 - 03:00\n\n            \nHot take: PyLint is actually good!\n\"PyLint can save your life\" is an exaggeration, but not as much as you might think! PyLint can keep you from really really hard to find and complicated bugs. At worst, it can save you the time of a test run. At best, it can help you avoid complicated production mistakes.\nThe good\nI'm embarrassed to say how common this can be. Naming tests is perpetually weird: Nothing cares about the name, and there's often not a natural name to be found. For instance, look at this code:\ndef test_add_small():\n# Math, am I right?\nassert 1 + 1 == 3\ndef test_add_large():\nassert 5 + 6 == 11\ndef test_add_small():\nassert 1 + 10 == 11\n\nThe test works:\ncollected 2 items                      …",
          "link": "https://opensource.com/article/22/9/pylint-good-bad-ugly",
          "publishedOn": "2022-09-19T07:00:00.000Z",
          "wordCount": 1607,
          "title": "PyLint: The good, the bad, and the ugly",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/python_programming_question.png"
        }
      ]
    },
    {
      "title": "The Verge -  All Posts",
      "feedUrl": "https://www.theverge.com/rss/index.xml",
      "siteUrl": "https://www.theverge.com/",
      "articles": [
        {
          "id": "https://www.theverge.com/2022/9/23/23369233/apple-tv-mlb-yankees-red-sox-stream-ny-ag-letitia-james-cable-yes-network",
          "author": null,
          "description": "Photo by Sarah Stier/Getty Images\n    \n\n  \nYankees star Aaron Judge could break a home run record at Friday’s game against the Boston Red Sox, and you’ll be able to watch the game for free through Apple TV’s Friday Night Baseball broadcast. But in tweets ahead of the game, New York Attorney General Letitia James confusingly called for the game to be brought over to New York’s local Yankee Entertainment and Sports (YES) cable network, and after slightly walking that back, called the steps to watch Apple’s broadcast “burdens.”\nThe whole saga started with a tweet from James at 3:04PM ET. \nMillions of New Yorkers paid their cable bills expecting to see live sports programming. Denying them the chance to watch Aaron Judge step up to the plate to make history tonight is wrong and...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/23/23369233/apple-tv-mlb-yankees-red-sox-stream-ny-ag-letitia-james-cable-yes-network",
          "publishedOn": "2022-09-23T23:05:00.000Z",
          "wordCount": 12205,
          "title": "NY AG tries to explain how Apple’s free Yankees stream is worse than cable TV",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/5sef8zAjcBt4Yzuq9WaRC56z_Tg=/0x0:3000x2000/1200x628/filters:focal(1500x1000:1501x1001)/cdn.vox-cdn.com/uploads/chorus_asset/file/24049935/1426386033.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/23/23368924/nasa-artemis-tropical-depression-storm-launch",
          "author": null,
          "description": "NASA’s SLS on the pad on September 3rd, 2022 | Photo by Joe Burbank / Orlando Sentinel / Tribune News Service via Getty Images\n    \n\n  \nI’ve got good news and bad news for fans of big NASA space launches. \nThe good news is that after repeated delays and a nail-biting test of a leaky fuel system, NASA’s Space Launch System (SLS) could make its big debut as soon as Tuesday. The bad news is currently named Tropical Depression Nine. It’s a developing storm in the Caribbean with the potential to become a major hurricane and a trajectory that is currently headed toward Florida. \nThere is just a 20 percent chance that the weather on September 27th will cooperate, according to a Friday forecast from the Space Force’s 45th weather squadron, which is in charge of determining whether or not the weather is good enough to launch.\nThis particular launch will be the start of Artemis I,...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/23/23368924/nasa-artemis-tropical-depression-storm-launch",
          "publishedOn": "2022-09-23T21:58:44.000Z",
          "wordCount": 12411,
          "title": "NASA’s Artemis I launch faces a new obstacle: the weather",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/NVP1DLK-QfnDphy7FL28Fhk2pe0=/0x0:1600x1022/1200x628/filters:focal(816x477:817x478)/cdn.vox-cdn.com/uploads/chorus_asset/file/24048761/1243018508.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/23/23367296/openai-whisper-transcription-speech-recognition-open-source",
          "author": null,
          "description": "The benefits of AI without the drawbacks of the cloud. | Kristen Radtke / The Verge; Getty Images\n    \n\n  \nOpenAI, the company behind image-generation and meme-spawning program DALL-E and the powerful text autocomplete engine GPT-3, has launched a new, open-source neural network meant to transcribe audio into written text (via TechCrunch). It’s called Whisper, and the company says it “approaches human level robustness and accuracy on English speech recognition” and that it can also automatically recognize, transcribe, and translate other languages like Spanish, Italian, and Japanese.\nAs someone who’s constantly recording and transcribing interviews, I was immediately hyped about this news — I thought I’d be able to write my own app to securely transcribe audio right from my computer. While cloud-based services like Otter.ai and Trint work for...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/23/23367296/openai-whisper-transcription-speech-recognition-open-source",
          "publishedOn": "2022-09-23T21:38:19.000Z",
          "wordCount": 13647,
          "title": "I used OpenAI’s new tech to transcribe audio right on my laptop",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/pmRwbnxGrmqhMNxQ0L04Fh3GBS4=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23954046/VRG_Illo_STK427_K_Radtke_Getty_Mics.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/23/23368339/hydrogen-clean-energy-biden-administration-strategy",
          "author": null,
          "description": "One of the world’s first plants for the production of green hydrogen in Wesseling, Germany, on July 2nd, 2021. | Photo by INA FASSBENDER/AFP via Getty Images\n    \n\n  \nRamping up production of hydrogen fuel is now a high priority for the Biden administration as it tries to put an end to the fossil fuel pollution causing climate change. The Department of Energy wants to produce 10 million metric tons of “clean” hydrogen by 2030, according to a draft National Clean Hydrogen Strategy and Roadmap released yesterday. \nAbout 10 million metric tons of hydrogen is already produced in the US each year, but that’s mostly “gray” hydrogen made with dirty natural gas. The shift would be to pair that natural gas with controversial technologies that capture carbon dioxide emissions as well as make more hydrogen using renewable energy sources and nuclear energy. \n“A high priority technology for this administration”\nC...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/23/23368339/hydrogen-clean-energy-biden-administration-strategy",
          "publishedOn": "2022-09-23T21:07:08.000Z",
          "wordCount": 13237,
          "title": "The US wants to become a hydrogen production powerhouse",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/OopOx0lvocJKXhKQ01zGu53QwIE=/0x0:5150x3333/1200x628/filters:focal(2575x1667:2576x1668)/cdn.vox-cdn.com/uploads/chorus_asset/file/24049288/1233767461.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/23/23369097/trombone-champ-comedy-games-interview-dan-vecchitto-interview-holy-wow-studios",
          "author": null,
          "description": "The “NASTY!” message when you flub a note is inspired. | Image: Holy Wow Studios\n    \n\n  \nTrombone Champ has been the star of my timeline this week; I’m constantly running into absurd renditions of songs like “Take Me Out to the Ball Game.” But in a conversation with Dan Vecchitto, the founder of Trombone Champ developer Holy Wow Studios, he brought up something I think is a major factor in the game’s success: we just don’t see a lot of comedy in gaming right now.\nGames have been pushing the boundaries of capital-S Serious Storytelling for some time with series like The Last of Us. Others remain popular because of their high-skill and high-stress competitive multiplayer. But we just don’t see many games that embrace their own comedy in the way that Trombone Champ does.\nWhile there are a growing number of games that are...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/23/23369097/trombone-champ-comedy-games-interview-dan-vecchitto-interview-holy-wow-studios",
          "publishedOn": "2022-09-23T21:05:24.000Z",
          "wordCount": 13003,
          "title": "Trombone Champ’s creator thinks more games need to go all in on comedy",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/IpxuJVFAkej7NDvD7blXX1sK3AU=/0x0:1920x1080/1200x628/filters:focal(1271x556:1272x557)/cdn.vox-cdn.com/uploads/chorus_asset/file/24049479/tchamp_screen5.jpeg"
        },
        {
          "id": "https://www.theverge.com/2022/9/23/23368633/apple-airpods-pro-ear-tips-incompatible-mesh",
          "author": null,
          "description": "The original AirPods Pro tips (left) have denser mesh than the new second-gen tips (right). | Photo by Chris Welch / The Verge\n    \n\n  \nIn my review of the new second-generation AirPods Pro, I pointed out that the inner mesh / filter of the ear tips is slightly different than those belonging to the original earbuds. As it turns out, that’s part of why Apple advises against using first-gen tips on the new model and vice versa. As MacRumors noticed, the company has updated its support page on AirPods Pro ear tips with a new section that says “ear tips have been designed specifically for their AirPods Pro generation, to deliver the highest-fidelity audio experience.”\n“As a result, use the ear tips that come with your AirPods Pro. AirPods Pro (1st generation) ear tips have noticeably denser mesh than AirPods Pro (2nd generation) ear tips,” Apple’s support site reads. \nCould...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/23/23368633/apple-airpods-pro-ear-tips-incompatible-mesh",
          "publishedOn": "2022-09-23T20:23:07.000Z",
          "wordCount": 12610,
          "title": "Apple says old and new AirPods Pro ear tips are incompatible because of mesh density",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/-QCQGhULZkfPNJWR3NiyPN7OQRA=/0x0:1285x857/1200x628/filters:focal(643x429:644x430)/cdn.vox-cdn.com/uploads/chorus_asset/file/24048462/mesh2.jpg"
        },
        {
          "id": "https://www.theverge.com/good-deals/22876408/best-gaming-headset-deals-sales",
          "author": null,
          "description": "Logitech’s budget-friendly G435 boasts color and comfort, as well as a host of solid features. | Photo by Amelia Holowaty Krales / The Verge\n    \n\n  \nA good gaming headset is practically a necessity these days. Clean and precise audio is essential for competitive gaming, allowing you to pinpoint your enemies and communicate effectively with your teammates. Moreover, recent developments in spatial audio and virtual surround sound have allowed headsets to meet — and occasionally surpass — more expensive audio setups, allowing even the most budget-conscious gamer to obtain a competitive edge at a fraction of the price.\nWhile you could always invest in a massive pair of speakers, they’re likely to earn you the dubious distinction of the worst roommate of the decade. Thankfully, the right headset will allow you to keep the running and gunning to yourself, which is why we’ve rounded up a...\nContinue reading…",
          "link": "https://www.theverge.com/good-deals/22876408/best-gaming-headset-deals-sales",
          "publishedOn": "2022-09-23T19:59:20.000Z",
          "wordCount": 20187,
          "title": "The best gaming headset deals you can get right now",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/bPUgwlncMAXmOMR99OgvLGyNWEo=/0x0:2040x1360/1200x628/filters:focal(1040x719:1041x720)/cdn.vox-cdn.com/uploads/chorus_asset/file/23001470/akrales_211109_4870_0299.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/23/23368202/microsoft-xbox-series-x-white-model-logitech-ad",
          "author": null,
          "description": "A white Xbox Series X has been spotted in an Astro Gaming ad. | Image: Astro Gaming (YouTube)\n    \n\n  \nUpdate 3:45PM ET: Per David Perez, the head of communications for gaming at Logitech, the simplest answer is the correct one — he says they simply wrapped that Xbox Series X.\nA white Xbox Series X has appeared in Logitech’s latest Astro Gaming commercial. The white model appears in a new ad for the Logitech-owned Astro Gaming headphone line, featuring the new A30 wireless headphones that are compatible with Xbox Series X, PS5, and more. The commercial shows a white Xbox Series X alongside a regular PS5 and the white and pink Blue Yeti microphones that were part of a collaboration between Logitech and Blue.\nLogitech-owned Astro Gaming might have chosen to use a custom white wrap on the Xbox Series X, but the company hasn’t customized any...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/23/23368202/microsoft-xbox-series-x-white-model-logitech-ad",
          "publishedOn": "2022-09-23T19:48:22.000Z",
          "wordCount": 12829,
          "title": "Why does Logitech have a white Xbox Series X? (Because they put a skin on it.)",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/JnOqaMpg8MG3m8ERjTrQNwJuyAU=/0x0:3600x2026/1200x628/filters:focal(1800x1013:1801x1014)/cdn.vox-cdn.com/uploads/chorus_asset/file/24047545/a30_pdp_full_bleed_3_desktop.png"
        }
      ]
    },
    {
      "title": "Ars Technica",
      "feedUrl": "https://arstechnica.com/feed/",
      "siteUrl": "https://arstechnica.com",
      "articles": [
        {
          "id": "https://arstechnica.com/?p=1884284",
          "author": "Andrew Cunningham",
          "description": "A new version of the GeForce Experience software will fix the issue.",
          "link": "https://arstechnica.com/?p=1884284",
          "publishedOn": "2022-09-23T22:44:10.000Z",
          "wordCount": 1278,
          "title": "GeForce GPUs are slowing down after installing the Windows 11 2022 Update",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/08/IMG_1568-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884140",
          "author": "Eric Berger",
          "description": "Space agency officials seem OK with leaving the rocket out in a tropical storm.",
          "link": "https://arstechnica.com/?p=1884140",
          "publishedOn": "2022-09-23T21:06:42.000Z",
          "wordCount": 1933,
          "title": "NASA seems to be in full “send it” mode for the Artemis I mission",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/Image-760x380.jpeg"
        },
        {
          "id": "https://arstechnica.com/?p=1884201",
          "author": "Ashley Belanger",
          "description": "Since 2015, crashes involving Amazon vehicles have killed more than 75 people.",
          "link": "https://arstechnica.com/?p=1884201",
          "publishedOn": "2022-09-23T20:50:59.000Z",
          "wordCount": 2077,
          "title": "Amazon hires unsafe trucking firms twice as often as peers, WSJ finds",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1387165772-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884104",
          "author": "Benj Edwards",
          "description": "Hobbyist and IEEE editor Stephen Cass upgrades a broken laptop from 1983.",
          "link": "https://arstechnica.com/?p=1884104",
          "publishedOn": "2022-09-23T20:13:32.000Z",
          "wordCount": 1600,
          "title": "39-year-old Radio Shack laptop gets new CPU, keeps original screen",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/trs80_model100_hero-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884070",
          "author": "Dan Goodin",
          "description": "For 2nd time in 4 years, Amazon loses control of its IP space in BGP hijacking.",
          "link": "https://arstechnica.com/?p=1884070",
          "publishedOn": "2022-09-23T18:04:11.000Z",
          "wordCount": 1565,
          "title": "How 3 hours of inaction from Amazon cost cryptocurrency holders $235,000",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-11477585601-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884083",
          "author": "Jon Brodkin",
          "description": "Starlink capacity limits hit users—SpaceX says more satellites will make it faster.",
          "link": "https://arstechnica.com/?p=1884083",
          "publishedOn": "2022-09-23T17:57:20.000Z",
          "wordCount": 1937,
          "title": "Starlink is getting a lot slower as more people use it, speed tests show",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/starlink-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884067",
          "author": "Sam Machkovech",
          "description": "If charges stick, arrest counts as fast turnaround for high-profile data breach.",
          "link": "https://arstechnica.com/?p=1884067",
          "publishedOn": "2022-09-23T17:35:23.000Z",
          "wordCount": 1711,
          "title": "Report: UK authorities have arrested a teenager linked to GTA VI leak",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/Screenshot-2000-760x380.png"
        },
        {
          "id": "https://arstechnica.com/?p=1884047",
          "author": "Ron Amadeo",
          "description": "At first it's optional, but Fitbit accounts will be shut down in 2025.",
          "link": "https://arstechnica.com/?p=1884047",
          "publishedOn": "2022-09-23T17:23:56.000Z",
          "wordCount": 1820,
          "title": "Google will start assimilating Fitbit accounts next year",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2018/12/google-web-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884060",
          "author": "Kyle Orland",
          "description": "20 fps original is smoothed out without ruining the original pacing.",
          "link": "https://arstechnica.com/?p=1884060",
          "publishedOn": "2022-09-23T16:37:23.000Z",
          "wordCount": 1774,
          "title": "SNES Star Fox now runs at a silky 60 fps thanks to a new hack",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2020/03/superfx-599x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1879525",
          "author": "Jeremy Reimer",
          "description": "In 1983, Acorn Computers needed a CPU. So 10 people built one.",
          "link": "https://arstechnica.com/?p=1879525",
          "publishedOn": "2022-09-23T15:47:46.000Z",
          "wordCount": 1632,
          "title": "A history of ARM, part 1: Building the first chip",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/acorn-computers-birth-of-arm-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884026",
          "author": "Jonathan M. Gitlin",
          "description": "16 trucks used biofuels to haul between the final three European races this year.",
          "link": "https://arstechnica.com/?p=1884026",
          "publishedOn": "2022-09-23T14:47:08.000Z",
          "wordCount": 1637,
          "title": "Mercedes’ F1 team cut its freight emissions by 89% with biofuel switch",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/M327731-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1883651",
          "author": "K.E.D. Coan",
          "description": "A new approach calculates the sustainability of multi-ingredient foods.",
          "link": "https://arstechnica.com/?p=1883651",
          "publishedOn": "2022-09-23T14:39:17.000Z",
          "wordCount": 1813,
          "title": "Many of the most nutritious foods are also the most sustainable",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1344862156-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1882587",
          "author": "Eric Berger",
          "description": "This is the first time the Rocket Report has used the word \"yeeted\" in its history.",
          "link": "https://arstechnica.com/?p=1882587",
          "publishedOn": "2022-09-23T11:00:01.000Z",
          "wordCount": 2239,
          "title": "Rocket Report: SpaceX fires up seven Raptors; SpinLaunch raises big funding round",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/SUSIEstagingArianeGroup-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1883870",
          "author": "Sam Machkovech",
          "description": "The modern-retro goodness of Shovel Knight returns with a refreshing take on roguelites.",
          "link": "https://arstechnica.com/?p=1883870",
          "publishedOn": "2022-09-23T00:07:06.000Z",
          "wordCount": 1717,
          "title": "Impressions: Shovel Knight Dig is my new roguelite gaming addiction",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/shovel-knight-dig-listing-760x380.png"
        },
        {
          "id": "https://arstechnica.com/?p=1880352",
          "author": "Jennifer Ouellette",
          "description": "One was struck on the head and stabbed; the other had massive cervical spine trauma.",
          "link": "https://arstechnica.com/?p=1880352",
          "publishedOn": "2022-09-22T22:47:20.000Z",
          "wordCount": 1684,
          "title": "The case of the murdered mummies: “Virtual autopsy” reveals foul play",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/autopsy7-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1883728",
          "author": "Scharon Harding",
          "description": "$90 adapter makes Wi-Fi 6E adoption slightly easier.",
          "link": "https://arstechnica.com/?p=1883728",
          "publishedOn": "2022-09-22T22:14:35.000Z",
          "wordCount": 1459,
          "title": "USB-A adapter adds instant Wi-Fi 6E support to Windows 11 PCs",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/listing-3-e1663882622279-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1883817",
          "author": "Ron Amadeo",
          "description": "AV1's Alliance for Open Media wants more royalty-free standards.",
          "link": "https://arstechnica.com/?p=1883817",
          "publishedOn": "2022-09-22T21:40:03.000Z",
          "wordCount": 1596,
          "title": "After pushing AV1 codec, Google goes after Dolby with HDR and audio standards",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/30-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1883867",
          "author": "Benj Edwards",
          "description": "Registration of AI-assisted comic comes amid fierce online debate about AI art ethics.",
          "link": "https://arstechnica.com/?p=1883867",
          "publishedOn": "2022-09-22T21:38:04.000Z",
          "wordCount": 1549,
          "title": "Artist receives first known US copyright registration for latent diffusion AI art",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/zarya_hero-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1883832",
          "author": "Ashley Belanger",
          "description": "Europol also identified dozens of online users suspected of exploiting refugees.",
          "link": "https://arstechnica.com/?p=1883832",
          "publishedOn": "2022-09-22T20:47:05.000Z",
          "wordCount": 1783,
          "title": "Hackathon finds dozens of Ukrainian refugees trafficked online",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1240100930-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1883835",
          "author": "John Timmer",
          "description": "New study shows eruption plume circled the globe multiple times in the stratosphere.",
          "link": "https://arstechnica.com/?p=1883835",
          "publishedOn": "2022-09-22T20:37:34.000Z",
          "wordCount": 1854,
          "title": "Hunga Tonga eruption put over 50B kilograms of water into the stratosphere",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/Screen-Shot-2022-09-22-at-3.32.42-PM-760x380.png"
        }
      ]
    },
    {
      "title": "Business Latest",
      "feedUrl": "https://www.wired.com/feed/category/business/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "632ca371995b6da54b57efe1",
          "author": "Megan Farokhmanesh",
          "description": "The company is going after cryptocurrency gambling—but will that be enough to satisfy concerned streamers?",
          "link": "https://www.wired.com/story/twitch-crypto-gambling-sliker-pokimane-devin-nash-boycott/",
          "publishedOn": "2022-09-23T15:25:18.000Z",
          "wordCount": 18787,
          "title": "Twitch's Crypto Casino Ban Ignores the Bigger Play",
          "imageUrl": "https://media.wired.com/photos/632cee9d8990652479ff39bf/191:100/w_1280,c_limit/Twitch-Gambling-Business-GettyImages-1395854967.jpg"
        },
        {
          "id": "632caf9920bc56769c4131cc",
          "author": "Steven Levy",
          "description": "Plus: The Supreme Court in cyberspace, what’s up with Web3, and ghost town resurrections.",
          "link": "https://www.wired.com/story/plaintext-bogus-fears-of-censorship-could-spell-the-end-of-content-moderation/",
          "publishedOn": "2022-09-23T13:00:00.000Z",
          "wordCount": 24903,
          "title": "Bogus Fears of Censorship Could Spell the End of Content Moderation",
          "imageUrl": "https://media.wired.com/photos/632ce98ac4d3ebc9237bc689/191:100/w_1280,c_limit/plaintext_texas_biz_GettyImages-656427940.jpg"
        },
        {
          "id": "632cf64c977791160bfcd395",
          "author": "Morgan Meaker",
          "description": "An 8-year-old’s YouTube snafu—and one unlikely parent activist—sparked a nationwide debate on the tech giant’s ubiquity and handling of children’s data.",
          "link": "https://www.wired.com/story/denmark-google-schools-data/",
          "publishedOn": "2022-09-23T11:00:00.000Z",
          "wordCount": 22268,
          "title": "A Danish City Built Google Into Its Schools—Then Banned It",
          "imageUrl": "https://media.wired.com/photos/632cf64cd884b4dcc9416570/191:100/w_1280,c_limit/Denmark_google_GettyImages-1213059825.jpg"
        },
        {
          "id": "632c79038990652479ff398c",
          "author": "Caitlin Harrington",
          "description": "Elizabeth Warren and Cori Bush led over two dozen congressional Democrats in urging Amazon, Lyft, Uber, and others to reclassify contractors as employees.",
          "link": "https://www.wired.com/story/lawmakers-pressure-tech-companies-over-abortion-benefits-for-gig-workers/",
          "publishedOn": "2022-09-22T16:15:05.000Z",
          "wordCount": 19300,
          "title": "US Lawmakers Push Tech Firms on Abortion Benefits for Gig Workers",
          "imageUrl": "https://media.wired.com/photos/632ba9c640fe1e8870aa3b5c/191:100/w_1280,c_limit/Warren-Abortion-Gig-Employers-Business-1233338537.jpg"
        },
        {
          "id": "62fd21627072d2c1f58788c0",
          "author": "Steven Levy",
          "description": "Steve Case, founder of AOL, predicts the dominance of tech companies on the coasts will give way to a flourishing of startups from smaller cities.",
          "link": "https://www.wired.com/story/the-next-silicon-valley-will-be-in-the-us-heartlands/",
          "publishedOn": "2022-09-22T16:00:00.000Z",
          "wordCount": 23235,
          "title": "The Next Silicon Valley Will Be in the US Heartland",
          "imageUrl": "https://media.wired.com/photos/632ba570f2203b5586fabfec/191:100/w_1280,c_limit/Business-Next-Silicon-Valley-US-Heartlands-1399265458.jpg"
        },
        {
          "id": "6328f8e440fe1e8870aa3b4e",
          "author": "Jennifer Conrad",
          "description": "The EU’s chief antitrust enforcer Margrethe Vestager says that US tech companies are changing their behavior as global regulators question their dominance.",
          "link": "https://www.wired.com/story/the-us-and-eu-are-teaming-up-to-contain-big-tech/",
          "publishedOn": "2022-09-22T12:00:00.000Z",
          "wordCount": 21218,
          "title": "The US and EU are Teaming Up to Contain Big Tech",
          "imageUrl": "https://media.wired.com/photos/632b962cc4d3ebc9237bc67d/191:100/w_1280,c_limit/QA_biz_GettyImages-1232706719.jpg"
        },
        {
          "id": "6328b71020bc56769c413195",
          "author": "Aarian Marshall",
          "description": "Uber and Lyft spent millions promoting a controversial ballot measure. A new study suggests it has lowered driver wages.",
          "link": "https://www.wired.com/story/california-voted-for-cheaper-uber-rides-it-may-have-hurt-drivers/",
          "publishedOn": "2022-09-21T16:00:00.000Z",
          "wordCount": 21453,
          "title": "California Voted for Cheaper Uber Rides. It May Have Hurt Drivers",
          "imageUrl": "https://media.wired.com/photos/632a31898990652479ff393d/191:100/w_1280,c_limit/prop22-uber-lyft-biz-GettyImages-1167514356.jpg"
        },
        {
          "id": "6328ed95977791160bfcd2ea",
          "author": "Will Knight",
          "description": "Artists are free to create fantasies or nightmares with unrestricted image generator Stable Diffusion, but some fear a flood of AI-made horrors.",
          "link": "https://www.wired.com/story/the-joy-and-dread-of-ai-image-generators-without-limits/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 22133,
          "title": "The Joy and Dread of AI Image Generators Without Limits",
          "imageUrl": "https://media.wired.com/photos/632a20908990652479ff393a/191:100/w_1280,c_limit/lede_Corruption-of-a-Dark-mage.jpg"
        },
        {
          "id": "632a4d3440fe1e8870aa3b57",
          "author": "William Ralston",
          "description": "A new study shows that cycling packages the final few miles to their recipients isn’t just greener than using a van, but often quicker too.",
          "link": "https://www.wired.com/story/cargo-bikes-greener-quicker/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 21209,
          "title": "It’s Time for Cities to Ditch Delivery Trucks—for Cargo Bikes",
          "imageUrl": "https://media.wired.com/photos/632ab26d00704d14b5ffb99d/191:100/w_1280,c_limit/Cargo-Bike-Delivery-Science-455162274.jpg"
        },
        {
          "id": "6329c23beecde8c117e7f4ea",
          "author": "Peter Guest",
          "description": "The encrypted messaging app is a haven for politically motivated vitriol, but users are increasingly bringing threats to targets’ doorsteps.",
          "link": "https://www.wired.com/story/telegrams-doxing-problem/",
          "publishedOn": "2022-09-20T13:39:51.000Z",
          "wordCount": 21272,
          "title": "Telegram Has a Serious Doxing Problem",
          "imageUrl": "https://media.wired.com/photos/6329c23b00704d14b5ffb995/191:100/w_1280,c_limit/Doxing_telgram_biz_GettyImages-1173158197-(1).jpg"
        },
        {
          "id": "6328ff5574ce5b82a68ef2e9",
          "author": "Chris Baraniuk",
          "description": "From stamps and cash to passports and postboxes, the minting of the United Kingdom’s new royal iconography will take years.",
          "link": "https://www.wired.com/story/updating-british-royal-iconography/",
          "publishedOn": "2022-09-20T11:00:00.000Z",
          "wordCount": 21292,
          "title": "What Happens to Everything With Queen Elizabeth II’s Image?",
          "imageUrl": "https://media.wired.com/photos/6328ff5536c33c0247a2f0ac/191:100/w_1280,c_limit/queen_elizabeth_biz_GettyImages-163212621.jpg"
        },
        {
          "id": "6328fc0820bc56769c41319c",
          "author": "Chris Stokel-Walker",
          "description": "Users try to control the video platform’s algorithm by giving content a thumbs-down, but Mozilla researchers say it’s not so simple.",
          "link": "https://www.wired.com/story/youtube-dislike-button-mozilla-research/",
          "publishedOn": "2022-09-20T08:00:00.000Z",
          "wordCount": 20005,
          "title": "YouTube’s ‘Dislike’ Button Doesn’t Do What You Think",
          "imageUrl": "https://media.wired.com/photos/6328fc08f2203b5586fabfc9/191:100/w_1280,c_limit/youtube_dislike_biz_GettyImages-1024603538.jpg"
        },
        {
          "id": "631fb2ab62435d269fdbdaf0",
          "author": "Aarian Marshall, Matt Simon",
          "description": "By 2035, the batteries in California’s zero-emission cars could power every home in the state for three days.",
          "link": "https://www.wired.com/story/electric-vehicles-could-rescue-the-us-power-grid/",
          "publishedOn": "2022-09-19T11:00:00.000Z",
          "wordCount": 22086,
          "title": "Electric Vehicles Could Rescue the US Power Grid",
          "imageUrl": "https://media.wired.com/photos/6324830036c33c0247a2f08b/191:100/w_1280,c_limit/EVs_Science_GettyImages-1351239126.jpg"
        },
        {
          "id": "632354efc4d3ebc9237bc605",
          "author": "Steven Levy",
          "description": "Plus: Depicting the nerd mindset; the best lettuce; and the future is flooding.",
          "link": "https://www.wired.com/story/plaintext-neal-stephenson-named-the-metaverse-now-hes-building-it/",
          "publishedOn": "2022-09-16T13:00:00.000Z",
          "wordCount": 23837,
          "title": "Neal Stephenson Named the Metaverse. Now, He’s Building It",
          "imageUrl": "https://media.wired.com/photos/6323716274ce5b82a68ef252/191:100/w_1280,c_limit/Neal-Stephenson-Metaverse-Company-Business-Redux-h_8.01924852.jpg"
        },
        {
          "id": "63221ac5d884b4dcc9416509",
          "author": "Aarian Marshall",
          "description": "People must both drive less and switch to electric vehicles to reduce carbon emissions enough to avoid the worst effects of climate change.",
          "link": "https://www.wired.com/story/banning-gas-cars-is-good-but-itll-take-more-to-save-the-planet/",
          "publishedOn": "2022-09-16T11:00:00.000Z",
          "wordCount": 20136,
          "title": "Banning Gas Cars Is Good, but It’ll Take More to Save the Planet",
          "imageUrl": "https://media.wired.com/photos/63239e208990652479ff386f/191:100/w_1280,c_limit/California-Strategies-To-Reduce-Driving-Business-1241831020.jpg"
        },
        {
          "id": "63223fe940fe1e8870aa3ad0",
          "author": "Caitlin Harrington",
          "description": "A preliminary agreement prevented a total shutdown, but many supply chains still face delays and disruption caused by staff shortages.",
          "link": "https://www.wired.com/story/a-us-rail-strike-was-averted-but-the-crisis-is-far-from-over/",
          "publishedOn": "2022-09-15T21:02:20.000Z",
          "wordCount": 19314,
          "title": "A US Rail Strike Was Averted—but the Crisis Is Far From Over",
          "imageUrl": "https://media.wired.com/photos/6322602f74ce5b82a68ef210/191:100/w_1280,c_limit/Looming-US-Rail-Worker-Strike-Business-1423407361.jpg"
        },
        {
          "id": "6320a9edc9bb1af7ef249735",
          "author": "Vittoria Elliott",
          "description": "The Russian blockade and bombardments are cutting off thousands of tons of grain, threatening the food supply in countries that rely on wheat exports.",
          "link": "https://www.wired.com/story/satellites-ukraine-russia-grain/",
          "publishedOn": "2022-09-15T18:53:09.000Z",
          "wordCount": 19204,
          "title": "Satellite Data Shows How Russia Has Destroyed Ukrainian Grain",
          "imageUrl": "https://media.wired.com/photos/632235fcc4d3ebc9237bc5c6/191:100/w_1280,c_limit/Satellite-Images-Reveal-Scale-of-Russian-Grain-Blockades-Business-1241878175.jpg"
        },
        {
          "id": "6320f8e900704d14b5ffb882",
          "author": "Matt Laslo",
          "description": "Peiter “Mudge” Zatko’s allegations about the social media platform renewed a sense of urgency for lawmakers to rein in Big Tech.",
          "link": "https://www.wired.com/story/peiter-mudge-zatko-twitter-senate-judiciary-testimony/",
          "publishedOn": "2022-09-14T19:01:41.000Z",
          "wordCount": 18779,
          "title": "The Twitter Whistleblower’s Testimony Has Senators Out for Blood",
          "imageUrl": "https://media.wired.com/photos/632115df20bc56769c4130e7/191:100/w_1280,c_limit/Congress's%20takeaways%20from%20the%20Twitter%20whistleblower%20hearing-GettyImages-1423404059.jpg"
        },
        {
          "id": "631a39e1f1e5c40d2b1bc5f4",
          "author": "Gideon Lichfield",
          "description": "WIRED’s editor in chief considers Silicon Valley’s visions for the future of governance, plus more thoughts on this month’s headlines.",
          "link": "https://www.wired.com/story/who-gets-to-build-the-next-software-stack-of-civilization/",
          "publishedOn": "2022-09-14T11:00:00.000Z",
          "wordCount": 19312,
          "title": "Who Gets to Build the Next Software Stack of Civilization?",
          "imageUrl": "https://media.wired.com/photos/6321090e74ce5b82a68ef205/191:100/w_1280,c_limit/system-update-september.jpg"
        },
        {
          "id": "631fc39f8990652479ff3848",
          "author": "Matt Burgess",
          "description": "Exposing wrongdoing is risky on the best of days. Whistleblower Aid cofounder John Tye explains the extensive steps needed to keep people safe.",
          "link": "https://www.wired.com/story/whistleblower-safety-mudge-twitter-senate-hearing/",
          "publishedOn": "2022-09-13T11:00:00.000Z",
          "wordCount": 19584,
          "title": "How Whistleblowers Navigate a Security Minefield",
          "imageUrl": "https://media.wired.com/photos/631fc39f00704d14b5ffb878/191:100/w_1280,c_limit/How-Whistleblowers-Navigate-a-Security-Minefield-Security-GettyImages-1242680586.jpg"
        }
      ]
    },
    {
      "title": "Feed: Artificial Intelligence Latest",
      "feedUrl": "https://www.wired.com/feed/tag/ai/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "6328ed95977791160bfcd2ea",
          "author": "Will Knight",
          "description": "Artists are free to create fantasies or nightmares with unrestricted image generator Stable Diffusion, but some fear a flood of AI-made horrors.",
          "link": "https://www.wired.com/story/the-joy-and-dread-of-ai-image-generators-without-limits/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 22133,
          "title": "The Joy and Dread of AI Image Generators Without Limits",
          "imageUrl": "https://media.wired.com/photos/632a20908990652479ff393a/191:100/w_1280,c_limit/lede_Corruption-of-a-Dark-mage.jpg"
        },
        {
          "id": "6320a9edc9bb1af7ef249735",
          "author": "Vittoria Elliott",
          "description": "The Russian blockade and bombardments are cutting off thousands of tons of grain, threatening the food supply in countries that rely on wheat exports.",
          "link": "https://www.wired.com/story/satellites-ukraine-russia-grain/",
          "publishedOn": "2022-09-15T18:53:09.000Z",
          "wordCount": 19204,
          "title": "Satellite Data Shows How Russia Has Destroyed Ukrainian Grain",
          "imageUrl": "https://media.wired.com/photos/632235fcc4d3ebc9237bc5c6/191:100/w_1280,c_limit/Satellite-Images-Reveal-Scale-of-Russian-Grain-Blockades-Business-1241878175.jpg"
        },
        {
          "id": "6315e68a44c07c3774c4cba0",
          "author": "Khari Johnson",
          "description": "The US regulator is eager to end unfair use of artificial intelligence and commercial surveillance, but experts remain skeptical.",
          "link": "https://www.wired.com/story/ftc-ai-regulation/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 21141,
          "title": "The FTC Is Closing in on Runaway AI",
          "imageUrl": "https://media.wired.com/photos/631a70b320bc56769c413043/191:100/w_1280,c_limit/business-ftc-ai.jpg"
        },
        {
          "id": "631134165d32e4cad34d6f3b",
          "author": "Amit Katwala",
          "description": "The Alphabet-backed AI firm is using virtual games to help its digital creations move more like humans.",
          "link": "https://www.wired.com/story/alphabet-deepmind-ai-humanoids-soccer-camp/",
          "publishedOn": "2022-09-02T11:00:00.000Z",
          "wordCount": 20840,
          "title": "Why DeepMind Is Sending AI Humanoids to Soccer Camp",
          "imageUrl": "https://media.wired.com/photos/631134163dfe1372fb611162/191:100/w_1280,c_limit/soccer_HZ_science_GettyImages-520264154.jpg"
        },
        {
          "id": "630506f9cea7c0581e825d21",
          "author": "Khari Johnson",
          "description": "The academic search engine’s policy on name changes is out of step with other search tools and publishers.",
          "link": "https://www.wired.com/story/trans-researchers-want-google-scholar-to-stop-deadnaming-them/",
          "publishedOn": "2022-09-01T11:00:00.000Z",
          "wordCount": 24093,
          "title": "Trans Researchers Want Google Scholar to Stop Deadnaming Them",
          "imageUrl": "https://media.wired.com/photos/630fe159567860ab6c66c667/191:100/w_1280,c_limit/business-deadnames-google.jpg"
        }
      ]
    },
    {
      "title": "Gear Latest",
      "feedUrl": "https://www.wired.com/feed/category/gear/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "60dc74924abd3c033f4a0180",
          "author": "Scott Gilbertson",
          "description": "Need an ultrafast drive for video editing or a rugged option to back up your photos in the field? We’ve got a solution for every situation.",
          "link": "https://www.wired.com/story/best-portable-external-storage-drives/",
          "publishedOn": "2022-09-23T14:00:00.000Z",
          "wordCount": 23290,
          "title": "These Are the Best Portable Storage Drives",
          "imageUrl": "https://media.wired.com/photos/60e4e904aacef0398a186163/191:100/w_1280,c_limit/Gear-Crucial-X6.jpg"
        },
        {
          "id": "607895413c4558580f4abffa",
          "author": "Julian Chokkattu, Gear Team",
          "description": "Sitting at a desk for hours? Upgrade your WFH setup and work in style with these WIRED-tested comfy seats.",
          "link": "https://www.wired.com/gallery/best-office-chairs/",
          "publishedOn": "2022-09-23T13:00:00.000Z",
          "wordCount": 29691,
          "title": "Give Your Back a Break With Our Favorite Office Chairs",
          "imageUrl": "https://media.wired.com/photos/618978f7665f24682a2d21d0/191:100/w_2580,c_limit/Gear-Herman-Miller-Aeron.jpg"
        },
        {
          "id": "630fcbbbdbc9ebd1c95a746a",
          "author": "Parker Hall",
          "description": "Plug in this bright yellow audio interface, and you can play live music with anyone within 620 miles.",
          "link": "https://www.wired.com/review/elk-live-bridge/",
          "publishedOn": "2022-09-23T12:00:00.000Z",
          "wordCount": 13941,
          "title": "The Elk Live Bridge Lets You Jam Together Online",
          "imageUrl": "https://media.wired.com/photos/632ca6ec036b54662b5105e8/191:100/w_1280,c_limit/Elk-Live-Bridge-Featured-Gear.jpg"
        },
        {
          "id": "5ba41f704bb3fa2ced83094f",
          "author": "Simon Hill, Brian Barrett",
          "description": "Welcome to your new Apple smartphone. Here's how to get the most out of it right out of the box.",
          "link": "https://www.wired.com/story/how-to-set-up-a-new-iphone/",
          "publishedOn": "2022-09-23T11:00:00.000Z",
          "wordCount": 22056,
          "title": "How to Set Up Your New iPhone",
          "imageUrl": "https://media.wired.com/photos/632cb9cb8990652479ff39a0/191:100/w_1280,c_limit/iPhone-Set-Up-Featured-Gear.jpg"
        },
        {
          "id": "60084ece15db9ef1886a34f6",
          "author": "Scott Gilbertson, Simon Hill",
          "description": "Keep your phone, tablet, laptop, and other electronics running with these handheld power banks.",
          "link": "https://www.wired.com/gallery/best-portable-chargers-power-banks/",
          "publishedOn": "2022-09-22T13:00:00.000Z",
          "wordCount": 27107,
          "title": "Power Up Anywhere With Our Favorite Portable Chargers",
          "imageUrl": "https://media.wired.com/photos/6205847949455570f3fe45c0/191:100/w_2580,c_limit/Gear-Elecjet_PowerPie_P20.jpg"
        },
        {
          "id": "632b345720bc56769c4131b6",
          "author": "Parker Hall",
          "description": "This is a good example of how you make already-great wireless earbuds even better.",
          "link": "https://www.wired.com/review/apple-airpods-pro-2nd-generation/",
          "publishedOn": "2022-09-22T13:00:00.000Z",
          "wordCount": 15204,
          "title": "Apple Made the Right Upgrades in the New AirPods Pro",
          "imageUrl": "https://media.wired.com/photos/632b71c4f1e5c40d2b1bc705/191:100/w_1280,c_limit/AirPods-Pro-2nd-Gen-Gear.jpg"
        },
        {
          "id": "632b6c05f2203b5586fabfe4",
          "author": "WIRED Staff",
          "description": "This week, we talk about Peloton’s growing product lineup, and whether our days of sweating along to streamed exercise classes at home are over.",
          "link": "https://www.wired.com/story/gadget-lab-podcast-567/",
          "publishedOn": "2022-09-22T12:00:00.000Z",
          "wordCount": 41940,
          "title": "Peloton Row and the Future of At-Home Workouts",
          "imageUrl": "https://media.wired.com/photos/632b925feecde8c117e7f5b6/191:100/w_1280,c_limit/Gear-GL-Peloton-Row_Lifestyle3.jpg"
        },
        {
          "id": "5f7214734266579a211f5085",
          "author": "Adrienne So",
          "description": "Now that the Series 8 and Ultra sport watch are here, we can help you figure out which version to get (and which to avoid).",
          "link": "https://www.wired.com/gallery/best-apple-watch/",
          "publishedOn": "2022-09-22T12:00:00.000Z",
          "wordCount": 18756,
          "title": "Which Apple Watch Is Best Right Now?",
          "imageUrl": "https://media.wired.com/photos/632b6fafd884b4dcc9416568/191:100/w_2580,c_limit/Apple-Watch-SE-2022-Gear.jpg"
        },
        {
          "id": "62476d5dedc71717de2ded88",
          "author": "Louryn Strampe",
          "description": "Games for every console, plus DLC and freebies—all in one spot.",
          "link": "https://www.wired.com/story/best-video-game-deals/",
          "publishedOn": "2022-09-22T11:00:00.000Z",
          "wordCount": 20726,
          "title": "The Best Video Game Deals This September",
          "imageUrl": "https://media.wired.com/photos/632a2caf40fe1e8870aa3b54/191:100/w_1280,c_limit/Cheap-and-Free-Games-Cyberpunk-2077-Gear.jpg"
        },
        {
          "id": "62ff5278f06d7dee6f53bb5f",
          "author": "Simon Hill",
          "description": "These mobile accessories will make your smartphone a better—and safer—road trip companion.",
          "link": "https://www.wired.com/gallery/best-car-phone-mounts-chargers-and-accessories/",
          "publishedOn": "2022-09-21T13:00:00.000Z",
          "wordCount": 19553,
          "title": "The Best Car Phone Mounts and Chargers",
          "imageUrl": "https://media.wired.com/photos/632a198d62435d269fdbdb96/191:100/w_2580,c_limit/Otterbox_Dual_Port_Car_Charger-SOURCE-Otterbox-Gear.jpg"
        },
        {
          "id": "63294359f1e5c40d2b1bc6ec",
          "author": "Adrienne So",
          "description": "With Crash Detection and longer battery life in Low Power mode, the wearables seem to be designed for an increasingly terrifying world.",
          "link": "https://www.wired.com/review/apple-watch-series-8-and-apple-watch-se/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 14852,
          "title": "The Apple Watch Series 8 Wants to Be Your Lifeline",
          "imageUrl": "https://media.wired.com/photos/632a1fd0995b6da54b57efd1/191:100/w_1280,c_limit/Apple-Watch-Series-8-Review-Gear.jpg"
        },
        {
          "id": "62f55d453787a50a7ae8c947",
          "author": "Jaclyn Greenberg",
          "description": "Duolingo's gamification made Spanish lessons fun—and helped bridge the gap with my tween.",
          "link": "https://www.wired.com/story/duolingo-language-learning-family-relationships/",
          "publishedOn": "2022-09-20T13:00:00.000Z",
          "wordCount": 20030,
          "title": "How My Daughter and I Learned to Speak the Same Language",
          "imageUrl": "https://media.wired.com/photos/6328de9762435d269fdbdb84/191:100/w_1280,c_limit/How-My-Daughter-and-I-Learned-to-Speak-the-Same-Language-GettyImages-1385416081.jpg"
        },
        {
          "id": "5fd1ea6cefa5f68151a599d7",
          "author": "Julian Chokkattu, Simon Hill",
          "description": "Stop fumbling for cables in the dark. These WIRED-tested stands and pads will take the hassle out of recharging your iPhone or Android phone.",
          "link": "https://www.wired.com/gallery/best-wireless-chargers/",
          "publishedOn": "2022-09-20T13:00:00.000Z",
          "wordCount": 33371,
          "title": "25 Great Wireless Chargers to Refuel Your Phone (or Watch)",
          "imageUrl": "https://media.wired.com/photos/622273c19e8883344f3ae359/191:100/w_2580,c_limit/Gear-Twelve-South-PowerPic-Mod-Wireless-Charger-Twelve-South.jpg"
        },
        {
          "id": "6148d470eb28d4df0601baac",
          "author": "Julian Chokkattu",
          "description": "We tested MagSafe compatibility on everything from cases to wireless chargers.",
          "link": "https://www.wired.com/gallery/best-iphone-13-cases-and-accessories/",
          "publishedOn": "2022-09-20T12:00:00.000Z",
          "wordCount": 28283,
          "title": "The Best iPhone 13 Cases and Accessories",
          "imageUrl": "https://media.wired.com/photos/61561af0a62d729110ec10ea/191:100/w_2580,c_limit/Gear-Apple-Leather-MagSafe-Case-SOURCE-Apple.jpg"
        },
        {
          "id": "6324a27562435d269fdbdb7c",
          "author": "Brenda Stolyar",
          "description": "With one long press, you can finally unsend that ill-considered rant—as long as both you and your contact have iOS 16.",
          "link": "https://www.wired.com/story/how-to-unsend-and-edit-messages-ios-16/",
          "publishedOn": "2022-09-20T11:00:00.000Z",
          "wordCount": 17472,
          "title": "How to Unsend and Edit Messages in iOS 16",
          "imageUrl": "https://media.wired.com/photos/632943b2c9bb1af7ef249860/191:100/w_1280,c_limit/Unsending-Text-mesages-gear-1368516400.jpg"
        },
        {
          "id": "6328b5f2d884b4dcc941652e",
          "author": "Lauren Goode",
          "description": "Peloton Row is the company’s latest high-priced piece of workout equipment—and a holdover from a previous Peloton era.",
          "link": "https://www.wired.com/story/peloton-row/",
          "publishedOn": "2022-09-20T11:00:00.000Z",
          "wordCount": 20541,
          "title": "Peloton’s New Rowing Machine Is Here. Get Ready to Pay Up",
          "imageUrl": "https://media.wired.com/photos/6328e6bf40fe1e8870aa3b4d/191:100/w_1280,c_limit/Peloton-Row-Gear.jpg"
        },
        {
          "id": "6328840740fe1e8870aa3b0d",
          "author": "Scott Gilbertson",
          "description": "Snag a pair of zero-drop, minimalist shoes and rediscover the ground beneath your feet.",
          "link": "https://www.wired.com/story/xero-z-trail-barefoot-shoes-sale-september-2022/",
          "publishedOn": "2022-09-19T17:04:00.000Z",
          "wordCount": 17207,
          "title": "Our Favorite Xero Barefoot Shoes Are on Sale Right Now",
          "imageUrl": "https://media.wired.com/photos/5fa5da72ed97b6b30c266243/191:100/w_1280,c_limit/Gear-ZTrail-Black-SOURCE-Xero-Shoes.jpg"
        },
        {
          "id": "5f3ea5d786a7c014331d160f",
          "author": "Matt Jancer",
          "description": "Don’t overpay for Verizon, T-Mobile, or AT&T. It might make sense for you to go with one of these smaller providers instead.",
          "link": "https://www.wired.com/story/guide-to-mvno-phone-plans/",
          "publishedOn": "2022-09-19T13:00:00.000Z",
          "wordCount": 28115,
          "title": "The Best Budget Phone Plans to Ditch the Big Carriers",
          "imageUrl": "https://media.wired.com/photos/5f4423c7c83d017a112ec55d/191:100/w_1280,c_limit/Gear-Phone-Plans-1264346596.jpg"
        },
        {
          "id": "62ea930fbb7ad736f1d6a9c4",
          "author": "Adam Speight",
          "description": "These 2-in-1 and clamshell computers upgrade the norm with touch displays, 360-degree hinges, and detachable keyboards.",
          "link": "https://www.wired.com/gallery/best-touchscreen-laptops/",
          "publishedOn": "2022-09-19T13:00:00.000Z",
          "wordCount": 19592,
          "title": "Feel the Magic Touch With Our Favorite Touchscreen Laptops",
          "imageUrl": "https://media.wired.com/photos/5f220d8ba0678d15fe4c788b/191:100/w_2580,c_limit/Gear-Asus-Chromebook-Flip-C434-SOURCE-Asus.jpg"
        },
        {
          "id": "631a171036c33c0247a2f012",
          "author": "Parker Hall",
          "description": "You won’t need all the pixels, but Samsung’s 8K flagship TV will be the prettiest screen in your neighborhood.",
          "link": "https://www.wired.com/review/samsung-qn900b/",
          "publishedOn": "2022-09-19T12:00:00.000Z",
          "wordCount": 13075,
          "title": "In 2022, This Samsung Is the One TV to Rule Them All",
          "imageUrl": "https://media.wired.com/photos/63238eeaf2203b5586fabf6d/191:100/w_1280,c_limit/Samsung-QN900B-TV-Gear.jpg"
        }
      ]
    },
    {
      "title": "Ideas Latest",
      "feedUrl": "https://www.wired.com/feed/category/ideas/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "632b3054d884b4dcc941655d",
          "author": "Albert Fox Cahn",
          "description": "When “if you see something, say something” becomes “we see everything,” everyone loses.",
          "link": "https://www.wired.com/story/the-surveillance-solutionism-of-putting-cameras-in-nyc-subways/",
          "publishedOn": "2022-09-22T12:00:00.000Z",
          "wordCount": 19544,
          "title": "The ‘Surveillance Solutionism’ of Putting Cameras in NYC Subways",
          "imageUrl": "https://media.wired.com/photos/632bad8e36c33c0247a2f0be/191:100/w_1280,c_limit/cameras-nyc-subway.jpg"
        },
        {
          "id": "6328bee136c33c0247a2f0ab",
          "author": "WIRED Ideas",
          "description": "Many associate the ‘America First’ movement with Trump, but its origins—and rebirth—are more complicated.",
          "link": "https://www.wired.com/story/america-first-meme-politics/",
          "publishedOn": "2022-09-21T12:00:00.000Z",
          "wordCount": 23242,
          "title": "This Dangerous Meme in US Politics Is Over a Century Old",
          "imageUrl": "https://media.wired.com/photos/632a55bc3c360bac53306190/191:100/w_1280,c_limit/dangerous-meme-america-first.jpg"
        },
        {
          "id": "63288cb640fe1e8870aa3b0e",
          "author": "Adrian Hon",
          "description": "What do puzzles, video games, and conspiracy theories have in common?",
          "link": "https://www.wired.com/story/qanon-games-alternate-reality-conspiracy-theories/",
          "publishedOn": "2022-09-20T12:00:00.000Z",
          "wordCount": 24495,
          "title": "Games, Mysteries, and the Lure of QAnon",
          "imageUrl": "https://media.wired.com/photos/63291007c9bb1af7ef24985e/191:100/w_1280,c_limit/games-mysteries-qanon.jpg"
        },
        {
          "id": "630fa634333af8e1504c49a1",
          "author": "Paul Ford",
          "description": "Retrocomputing is about more than nostalgic nerdery. It’s also a way to keep your tech in perspective.",
          "link": "https://www.wired.com/story/modern-humans-learn-ancient-software-retrocomputing/",
          "publishedOn": "2022-09-15T13:00:00.000Z",
          "wordCount": 19645,
          "title": "What Modern Humans Can Learn From Ancient Software",
          "imageUrl": "https://media.wired.com/photos/630fa99379f10149f7bb9e38/191:100/w_1280,c_limit/WI100122_ST_Ford_01.jpg"
        },
        {
          "id": "63208fea20bc56769c4130dc",
          "author": "Matt Perault",
          "description": "New privacy and expression laws that vary state to state will be a nightmare for platforms, and for users’ rights.",
          "link": "https://www.wired.com/story/the-end-of-roe-will-spark-a-digital-civil-war/",
          "publishedOn": "2022-09-14T12:00:00.000Z",
          "wordCount": 20302,
          "title": "The End of Roe Will Spark a Digital Civil War",
          "imageUrl": "https://media.wired.com/photos/63212a43c9bb1af7ef2497c0/191:100/w_1280,c_limit/roe-digital-civil-war.jpg"
        },
        {
          "id": "630fb1b9dbc9ebd1c95a7469",
          "author": "Virginia Heffernan",
          "description": "When TV came online in the aughts, it was exciting. Then Facebook took over.",
          "link": "https://www.wired.com/story/i-want-the-internet-tv-we-were-all-promised/",
          "publishedOn": "2022-09-13T13:00:00.000Z",
          "wordCount": 19506,
          "title": "The Vast Wasteland of Internet Television",
          "imageUrl": "https://media.wired.com/photos/631f6121f1e5c40d2b1bc632/191:100/w_1280,c_limit/Heffernan_TV_Internet_Backchannel_IMG_3692_horizontal.jpg"
        },
        {
          "id": "630f9ec45d32e4cad34d6f24",
          "author": "Meghan O'Gieblyn",
          "description": "WIRED’s spiritual advice columnist reassures a literary reader that it’s OK to communicate with images.",
          "link": "https://www.wired.com/story/am-i-wrong-to-judge-talking-in-emoji/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 21628,
          "title": "Am I Wrong to Judge People for Talking to Me in Emoji?",
          "imageUrl": "https://media.wired.com/photos/630fa20cf89e2120665181db/191:100/w_1280,c_limit/WI100122_ST_CloudSupport_LO_01.jpg"
        },
        {
          "id": "62fd1fe9b07577beee1be7f9",
          "author": "Charlotte Kent",
          "description": "Jennifer Lyn Morone became a corporation in hopes of protecting her data privacy. Her experience shows the downfalls of treating data like property.",
          "link": "https://www.wired.com/story/art-data-property-roe/",
          "publishedOn": "2022-09-08T13:00:00.000Z",
          "wordCount": 25668,
          "title": "The Woman Who Became a Company Has Lessons for a Post-Roe World",
          "imageUrl": "https://media.wired.com/photos/63192414977791160bfcd0ac/191:100/w_1280,c_limit/woman-became-company.jpg"
        },
        {
          "id": "6303a03afd602ff2f11e6ffa",
          "author": "Erica Berry",
          "description": "Tech dependence is following many students back to school—but waging a war against devices helps no one.",
          "link": "https://www.wired.com/story/cell-phone-bans-school/",
          "publishedOn": "2022-09-07T11:00:00.000Z",
          "wordCount": 24280,
          "title": "Banning Phones in Class? Not So Fast",
          "imageUrl": "https://media.wired.com/photos/6317e88a00704d14b5ffb7ca/191:100/w_1280,c_limit/phones-in-class.jpg"
        },
        {
          "id": "6306003d1814a994d3a63460",
          "author": "Katherine Cross",
          "description": "Telling people to quit the platform is less effective than stopping influential elites from using the site in harmful ways.",
          "link": "https://www.wired.com/story/twitter-democracy-harm-reduction/",
          "publishedOn": "2022-09-06T13:00:00.000Z",
          "wordCount": 25518,
          "title": "So, You Want Twitter to Stop Destroying Democracy",
          "imageUrl": "https://media.wired.com/photos/631296005d32e4cad34d6f9b/191:100/w_1280,c_limit/twitter-stop-destroying-democracy.jpg"
        },
        {
          "id": "63122b60a4a22698f6d24aae",
          "author": "Kate Knibbs",
          "description": "It’s more than an unproven medical treatment—it’s a view into the antiabortion movement’s larger project.",
          "link": "https://www.wired.com/story/abortion-pill-reversal-essay/",
          "publishedOn": "2022-09-05T13:00:00.000Z",
          "wordCount": 27591,
          "title": "What Abortion Pill ‘Reversal’ Really Accomplishes",
          "imageUrl": "https://media.wired.com/photos/631276b8a4a22698f6d24aba/191:100/w_1280,c_limit/abortion-pill-reversal.jpg"
        },
        {
          "id": "630629f0fd602ff2f11e70a4",
          "author": "Jennifer Conrad",
          "description": "Johns Hopkins' long history with student-spies suggests this most recent incident will not lead to much change—but maybe that's OK.",
          "link": "https://www.wired.com/story/national-security-spies-johns-hopkins/",
          "publishedOn": "2022-09-01T12:00:00.000Z",
          "wordCount": 25217,
          "title": "The Russian Spy in My Econ Class",
          "imageUrl": "https://media.wired.com/photos/63100b03f89e2120665181e1/191:100/w_1280,c_limit/russian-spy-econ-class.jpg"
        },
        {
          "id": "630e23a9567860ab6c66c659",
          "author": "Justin Sherman",
          "description": "The agency’s lawsuit against Kochava should squash the industry’s core defense—and help keep sensitive info off the open market.",
          "link": "https://www.wired.com/story/the-ftc-may-finally-protect-americans-from-data-brokers/",
          "publishedOn": "2022-08-31T12:00:00.000Z",
          "wordCount": 19714,
          "title": "The FTC May (Finally) Protect Americans From Data Brokers",
          "imageUrl": "https://media.wired.com/photos/630ec0bb9fbbe8d3536bfa07/191:100/w_1280,c_limit/ftc-data-brokers.jpg"
        },
        {
          "id": "62fb9c2216995ea7b1a92dd3",
          "author": "Josephine Wolff",
          "description": "Cyberinsurance doesn't cover acts of war. But even as cyberattacks mount, the definition of \"warlike\" actions remains blurry.",
          "link": "https://www.wired.com/story/russia-ukraine-cyberwar-cyberinsurance/",
          "publishedOn": "2022-08-30T13:00:00.000Z",
          "wordCount": 22662,
          "title": "Who Pays for an Act of Cyberwar?",
          "imageUrl": "https://media.wired.com/photos/630d6253f89e2120665181d0/191:100/w_1280,c_limit/who-pays-cyberwar.jpg"
        },
        {
          "id": "62fd5532fd602ff2f11e6fbe",
          "author": "Luke Burgis",
          "description": "What does Athens have to do with Jerusalem—and what do either have to do with Silicon Valley?",
          "link": "https://www.wired.com/story/technology-philosophy-three-city-problem/",
          "publishedOn": "2022-08-28T11:00:00.000Z",
          "wordCount": 29165,
          "title": "The Three-City Problem of Modern Life",
          "imageUrl": "https://media.wired.com/photos/630931d752512a466ff8f66d/191:100/w_1280,c_limit/three-cities.jpg"
        }
      ]
    },
    {
      "title": "Science Latest",
      "feedUrl": "https://www.wired.com/feed/category/science/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "631bae99d884b4dcc94164e1",
          "author": "Rhett Allain",
          "description": "If you want to attain high speeds without getting airborne, it helps to know a little something about friction.",
          "link": "https://www.wired.com/story/the-physics-of-going-fast-but-not-too-fast-on-a-giant-slide/",
          "publishedOn": "2022-09-23T13:00:00.000Z",
          "wordCount": 25084,
          "title": "The Physics of Going Fast—but Not Too Fast—on a Giant Slide",
          "imageUrl": "https://media.wired.com/photos/632c9d0c00704d14b5ffb9a9/191:100/w_1280,c_limit/friction_slide_Science_GettyImages-1272469804-(1).jpg"
        },
        {
          "id": "632ccb63d884b4dcc941656f",
          "author": "Jonathan O'Callaghan",
          "description": "Virgin Orbit will launch satellites from the country for the first time, bringing orbital flight capability to Europe.",
          "link": "https://www.wired.com/story/first-british-satellite-launch/",
          "publishedOn": "2022-09-23T11:00:00.000Z",
          "wordCount": 21010,
          "title": "The UK Is Rejoining the Space Race",
          "imageUrl": "https://media.wired.com/photos/632ccb6236c33c0247a2f0c3/191:100/w_1280,c_limit/Virgin-Orbit-87_science.jpg"
        },
        {
          "id": "632cddeea8bb66572c8c044e",
          "author": "Charlie Metcalfe",
          "description": "An ambitious cable project aims to power thousands of homes with renewable energy by 2030.",
          "link": "https://www.wired.com/story/the-uks-wild-plan-to-use-a-giant-cable-to-catch-sun-from-the-sahara/",
          "publishedOn": "2022-09-23T11:00:00.000Z",
          "wordCount": 21077,
          "title": "The Wild Plan to Export Sun From the Sahara to the UK",
          "imageUrl": "https://media.wired.com/photos/632cddee977791160bfcd393/191:100/w_1280,c_limit/Grid_UK_Biz_GettyImages-1368441144.jpg"
        },
        {
          "id": "632a125774ce5b82a68ef2f9",
          "author": "Emily Mullin",
          "description": "The technique had largely been limited to editing patients’ cells in the lab. New research shows promise for treating diseases more directly.",
          "link": "https://www.wired.com/story/theres-new-proof-crispr-can-edit-genes-inside-human-bodies/",
          "publishedOn": "2022-09-22T13:00:00.000Z",
          "wordCount": 20061,
          "title": "There’s New Proof Crispr Can Edit Genes Inside Human Bodies",
          "imageUrl": "https://media.wired.com/photos/632b96bef1e5c40d2b1bc708/191:100/w_1280,c_limit/dna_crispr_science_GettyImages-498187798.jpg"
        },
        {
          "id": "6329fa9874ce5b82a68ef2f8",
          "author": "Matt Simon",
          "description": "Meticulous turf is environmentally terrible. Yet grass does have one charm: It “sweats,” helping cool the local area.",
          "link": "https://www.wired.com/story/lawns-are-dumb-but-ripping-them-out-may-come-with-a-catch/",
          "publishedOn": "2022-09-22T12:00:00.000Z",
          "wordCount": 20675,
          "title": "Lawns Are Dumb. But Ripping Them Out May Come With a Catch",
          "imageUrl": "https://media.wired.com/photos/632b9524c9bb1af7ef24986e/191:100/w_1280,c_limit/lawn_science_GettyImages-557383651.jpg"
        },
        {
          "id": "632b748b8990652479ff394a",
          "author": "April Reese",
          "description": "Extreme temperatures are the direct result of climate change, which means more intense heat events, wildfires, and droughts to come.",
          "link": "https://www.wired.com/story/europe-heat-wave-limits/",
          "publishedOn": "2022-09-22T11:00:00.000Z",
          "wordCount": 20870,
          "title": "Europe’s Heat Waves Offer a Grim Vision of the Future",
          "imageUrl": "https://media.wired.com/photos/632b748b74ce5b82a68ef31b/191:100/w_1280,c_limit/Spain_Wildfire_Science_GettyImages-1409603369.jpg"
        },
        {
          "id": "631f7fcfd884b4dcc94164f3",
          "author": "Ruha Benjamin",
          "description": "As a young Black woman, I saw my pregnancy treated like a problem. So I ditched the doctors for home delivery and found an alternative model for health care.",
          "link": "https://www.wired.com/story/ruha-benjamin-pregnancy-black-maternal-mortality/",
          "publishedOn": "2022-09-22T10:00:00.000Z",
          "wordCount": 31010,
          "title": "A Better Birth Is Possible",
          "imageUrl": "https://media.wired.com/photos/632a2e6f74ce5b82a68ef2fd/191:100/w_1280,c_limit/Backchannel_Alanna-Fields_RuhaBenjamin.jpg"
        },
        {
          "id": "632a4d3440fe1e8870aa3b57",
          "author": "William Ralston",
          "description": "A new study shows that cycling packages the final few miles to their recipients isn’t just greener than using a van, but often quicker too.",
          "link": "https://www.wired.com/story/cargo-bikes-greener-quicker/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 21209,
          "title": "It’s Time for Cities to Ditch Delivery Trucks—for Cargo Bikes",
          "imageUrl": "https://media.wired.com/photos/632ab26d00704d14b5ffb99d/191:100/w_1280,c_limit/Cargo-Bike-Delivery-Science-455162274.jpg"
        },
        {
          "id": "6318fe21c4d3ebc9237bc511",
          "author": "Maryn McKenna",
          "description": "A global fungal pandemic wiped out amphibians, destroyed biodiversity, and ultimately increased human illness. Now a second similar pathogen is on the way.",
          "link": "https://www.wired.com/story/the-fungus-that-killed-frogs-and-led-to-a-surge-in-malaria/",
          "publishedOn": "2022-09-20T16:00:00.000Z",
          "wordCount": 21262,
          "title": "The Fungus That Killed Frogs—and Led to a Surge in Malaria",
          "imageUrl": "https://media.wired.com/photos/6328e00a20bc56769c413199/191:100/w_1280,c_limit/Chiriqui-Harlequin-frog_Panama_science_(c)-Marcos-Guerra,-Smithsonian-Tropical-Research-Institute-(1).jpg"
        },
        {
          "id": "63235caf20bc56769c4130f0",
          "author": "Gregory Barber",
          "description": "Recent studies have revealed flaws in the heat index. With rising temperatures and humidity, maybe it’s time for a more holistic approach.",
          "link": "https://www.wired.com/story/the-us-is-measuring-extreme-heat-wrong/",
          "publishedOn": "2022-09-20T11:00:00.000Z",
          "wordCount": 21951,
          "title": "The US Is Measuring Extreme Heat Wrong",
          "imageUrl": "https://media.wired.com/photos/6328e23beecde8c117e7f4e6/191:100/w_1280,c_limit/heatindex_Science_GettyImages-1234663319-(1).jpg"
        },
        {
          "id": "631f6903c4d3ebc9237bc5b6",
          "author": "Maggie Chen",
          "description": "Neurons get a lot of attention—but researchers think this star-shaped brain cell type could hold the key to treating some disorders.",
          "link": "https://www.wired.com/story/to-understand-brain-disorders-consider-the-astrocyte/",
          "publishedOn": "2022-09-19T12:00:00.000Z",
          "wordCount": 21134,
          "title": "To Understand Brain Disorders, Consider the Astrocyte",
          "imageUrl": "https://media.wired.com/photos/6324834336c33c0247a2f08d/191:100/w_1280,c_limit/astrocytes_science_ScienceSource_SS2359343.jpg"
        },
        {
          "id": "631fb2ab62435d269fdbdaf0",
          "author": "Aarian Marshall, Matt Simon",
          "description": "By 2035, the batteries in California’s zero-emission cars could power every home in the state for three days.",
          "link": "https://www.wired.com/story/electric-vehicles-could-rescue-the-us-power-grid/",
          "publishedOn": "2022-09-19T11:00:00.000Z",
          "wordCount": 22086,
          "title": "Electric Vehicles Could Rescue the US Power Grid",
          "imageUrl": "https://media.wired.com/photos/6324830036c33c0247a2f08b/191:100/w_1280,c_limit/EVs_Science_GettyImages-1351239126.jpg"
        },
        {
          "id": "631f681e036b54662b510484",
          "author": "Ingrid Wickelgren",
          "description": "A statistical analysis of chemical tags on DNA may help unify disparate theories of aging.",
          "link": "https://www.wired.com/story/epigenetic-clocks-predict-animals-true-biological-age/",
          "publishedOn": "2022-09-18T12:00:00.000Z",
          "wordCount": 30223,
          "title": "Epigenetic ‘Clocks’ Predict Animals’ True Biological Age",
          "imageUrl": "https://media.wired.com/photos/6324b3f81ff1d31425318562/191:100/w_1280,c_limit/Quanta_Aging_2560_Lede.jpg"
        },
        {
          "id": "631f676474ce5b82a68ef1a9",
          "author": "Stephanie Mencimer",
          "description": "The razorback sucker has survived in the river for more than 3 million years. Climate change could end that.",
          "link": "https://www.wired.com/story/the-colorado-river-is-dying-can-its-aquatic-dinosaurs-be-saved/",
          "publishedOn": "2022-09-17T12:00:00.000Z",
          "wordCount": 32794,
          "title": "The Colorado River Is Dying. Can Its Aquatic Dinosaurs Be Saved?",
          "imageUrl": "https://media.wired.com/photos/6324810140fe1e8870aa3adc/191:100/w_1280,c_limit/climatedesk_coloradoriver_science_razorbacksucker_GettyImages-599935834.jpg"
        },
        {
          "id": "632522c740fe1e8870aa3b0a",
          "author": "Chris Stokel-Walker",
          "description": "The line to see Queen Elizabeth II lying in state is snaking across central London. Could it have been done better?",
          "link": "https://www.wired.com/story/queen-elizabeth-ii-queue/",
          "publishedOn": "2022-09-17T11:00:00.000Z",
          "wordCount": 20688,
          "title": "How to Design the Perfect Queue, According to Crowd Science",
          "imageUrl": "https://media.wired.com/photos/632522c762435d269fdbdb7f/191:100/w_1280,c_limit/Designing-the-Queue-London-Security-GettyImages-1243175631-(1).jpg"
        },
        {
          "id": "6324633c977791160bfcd28c",
          "author": "Matt Reynolds",
          "description": "The British documentarian is a national treasure. But soaring strings and stunning drone shots feel frozen in an earlier era of climate activism.",
          "link": "https://www.wired.com/story/david-attenborough-documentaries/",
          "publishedOn": "2022-09-16T11:52:54.000Z",
          "wordCount": 20653,
          "title": "The World Has Reached Peak Attenborough",
          "imageUrl": "https://media.wired.com/photos/6324633ceecde8c117e7f401/191:100/w_1280,c_limit/Attenborough_Science_GettyImages-1236259058.jpg"
        },
        {
          "id": "632340c5c9bb1af7ef2497c9",
          "author": "Emily Mullin",
          "description": "CAR-T therapy has been successful at treating cancer. Now, it’s driven lupus into remission in a handful of patients.",
          "link": "https://www.wired.com/story/how-a-living-drug-could-treat-autoimmune-disease/",
          "publishedOn": "2022-09-16T11:00:00.000Z",
          "wordCount": 19227,
          "title": "How a ‘Living Drug’ Could Treat Autoimmune Disease",
          "imageUrl": "https://media.wired.com/photos/63238e72995b6da54b57ef24/191:100/w_1280,c_limit/tcell_science_5950870236_64af74c06d_o.jpg"
        },
        {
          "id": "63235cf3036b54662b5104de",
          "author": "Ramin Skibba",
          "description": "These are tantalizing hints that microbes might have lived on Mars billions of years ago, but scientists need to study the rocks back on Earth to be sure.",
          "link": "https://www.wired.com/story/nasas-perseverance-rover-digs-up-organic-molecules-on-mars/",
          "publishedOn": "2022-09-15T20:34:06.000Z",
          "wordCount": 18781,
          "title": "NASA’s Perseverance Rover Digs Up Organic Molecules on Mars",
          "imageUrl": "https://media.wired.com/photos/6323627ad884b4dcc941650d/191:100/w_1280,c_limit/Jerezo_Science_PIA24928.jpg"
        },
        {
          "id": "630d2a44dec8aa69fd32238c",
          "author": "Maryn McKenna",
          "description": "Many people changed their behavior, the vaccines might be helping, and the virus might someday burn itself out—but there’s not enough data to know.",
          "link": "https://www.wired.com/story/monkeypox-cases-falling-united-states/",
          "publishedOn": "2022-09-15T16:01:46.000Z",
          "wordCount": 21813,
          "title": "Monkeypox Cases in the US Are Falling. There's No One Reason Why",
          "imageUrl": "https://media.wired.com/photos/63223ac8f2203b5586fabf20/191:100/w_1280,c_limit/monkeypox-Science_GettyImages-1243186301.jpg"
        },
        {
          "id": "63227cb7036b54662b5104dd",
          "author": "Maria Perez Ortiz",
          "description": "A software update can help turbines become less disruptive to their neighbors and distribute the wind more efficiently.",
          "link": "https://www.wired.com/story/wind-turbine-efficiency-algorithm/",
          "publishedOn": "2022-09-15T11:00:00.000Z",
          "wordCount": 20782,
          "title": "Teaching ‘Selfish’ Wind Turbines to Share Can Boost Productivity",
          "imageUrl": "https://media.wired.com/photos/63227cb600704d14b5ffb891/191:100/w_1280,c_limit/windturbines_Science_GettyImages-1203659530.jpg"
        }
      ]
    },
    {
      "title": "Security Latest",
      "feedUrl": "https://www.wired.com/feed/category/security/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "632b349f00704d14b5ffb9a1",
          "author": "Andy Greenberg",
          "description": "New research shows how third-party apps could be exploited to infiltrate these sensitive workplace tools.",
          "link": "https://www.wired.com/story/slack-microsoft-teams-app-security/",
          "publishedOn": "2022-09-23T16:52:52.000Z",
          "wordCount": 21826,
          "title": "Slack’s and Teams’ Lax App Security Raises Alarms",
          "imageUrl": "https://media.wired.com/photos/632d0df220bc56769c4131d5/191:100/w_1280,c_limit/security-slack-teams.jpg"
        },
        {
          "id": "632dcedd20bc56769c4131d7",
          "author": "Matt Burgess",
          "description": "Amid protests against the killing of Mahsa Amini, authorities have cut off mobile internet, WhatsApp, and Instagram. The death toll continues to rise.",
          "link": "https://www.wired.com/story/iran-protests-2022-internet-shutdown-whatsapp/",
          "publishedOn": "2022-09-23T15:23:24.000Z",
          "wordCount": 20308,
          "title": "Iran’s Internet Shutdown Hides a Deadly Crackdown",
          "imageUrl": "https://media.wired.com/photos/632dcedd36c33c0247a2f0ee/191:100/w_1280,c_limit/Iran-Internet-Shutdown-Security-AP_22264589595157.jpg"
        },
        {
          "id": "632a29ecc9bb1af7ef249865",
          "author": "Dhruv Mehrotra",
          "description": "Churches are using invasive phone-monitoring tech to discourage “sinful” behavior. Some software is seeing more than congregants realize.",
          "link": "https://www.wired.com/story/covenant-eyes-anti-porn-accountability-monitoring-apps/",
          "publishedOn": "2022-09-22T17:00:00.000Z",
          "wordCount": 26919,
          "title": "The Ungodly Surveillance of Anti-Porn ‘Shameware’ Apps",
          "imageUrl": "https://media.wired.com/photos/632ba19662435d269fdbdba4/191:100/w_1280,c_limit/security-shameware.jpg"
        },
        {
          "id": "632b295b00704d14b5ffb9a0",
          "author": "Lily Hay Newman",
          "description": "Security firm Chainguard has created a simple, open source way for organizations to defend the cloud against some of the most insidious attacks.",
          "link": "https://www.wired.com/story/chainguard-wolfi-linux-distribution/",
          "publishedOn": "2022-09-22T14:46:02.000Z",
          "wordCount": 19873,
          "title": "A New Linux Tool Aims to Guard Against Supply Chain Attacks",
          "imageUrl": "https://media.wired.com/photos/632bbd9cd884b4dcc941656d/191:100/w_1280,c_limit/Security-Open-Source-Linux-1403599186.jpg"
        },
        {
          "id": "632a4347c4d3ebc9237bc61c",
          "author": "Matt Burgess",
          "description": "But as Ukrainians retake ground, some of the firms are erasing their online presence.",
          "link": "https://www.wired.com/story/ukraine-war-mobile-networks-russia/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 20904,
          "title": "Shadowy Russian Cell Phone Companies Are Cropping Up in Ukraine",
          "imageUrl": "https://media.wired.com/photos/632a4347995b6da54b57efd7/191:100/w_1280,c_limit/Shadowy-Russian-Cell-Companies-Security-GettyImages-713877183.jpg"
        },
        {
          "id": "6329c23beecde8c117e7f4ea",
          "author": "Peter Guest",
          "description": "The encrypted messaging app is a haven for politically motivated vitriol, but users are increasingly bringing threats to targets’ doorsteps.",
          "link": "https://www.wired.com/story/telegrams-doxing-problem/",
          "publishedOn": "2022-09-20T13:39:51.000Z",
          "wordCount": 21272,
          "title": "Telegram Has a Serious Doxing Problem",
          "imageUrl": "https://media.wired.com/photos/6329c23b00704d14b5ffb995/191:100/w_1280,c_limit/Doxing_telgram_biz_GettyImages-1173158197-(1).jpg"
        },
        {
          "id": "63238b91d884b4dcc941650e",
          "author": "Olatunji Olaigbe",
          "description": "Despite having one of the strongest data-protection policies in Africa, the country’s enforcement and disclosure practices remain dangerously broken.",
          "link": "https://www.wired.com/story/nigeria-cybersecurity-issues/",
          "publishedOn": "2022-09-19T11:00:00.000Z",
          "wordCount": 21816,
          "title": "The Deep Roots of Nigeria’s Cybersecurity Problem",
          "imageUrl": "https://media.wired.com/photos/6325236a036b54662b51058f/191:100/w_1280,c_limit/Nigeria-Cybersecurity-Security-GettyImages-1193599505.jpg"
        },
        {
          "id": "6309107c567860ab6c66c64f",
          "author": "David Nield",
          "description": "Tired of advertisers spying on your private communications? This beta promises to kick tracking technology to the curb.",
          "link": "https://www.wired.com/story/how-to-use-duckduckgo-privacy-first-email/",
          "publishedOn": "2022-09-18T12:00:00.000Z",
          "wordCount": 18558,
          "title": "How to Use DuckDuckGo’s Privacy-First Email Service",
          "imageUrl": "https://media.wired.com/photos/6324febb20bc56769c41311a/191:100/w_1280,c_limit/How-to-Use-DuckDuckGo-Email-Privacy-Gear.jpg"
        },
        {
          "id": "63250dc8f2203b5586fabfbb",
          "author": "Matt Burgess",
          "description": "Snipers on buildings. Drone no-fly zones. Temporary CCTV. The security plan is even more complex than it was for the London 2012 Olympics.",
          "link": "https://www.wired.com/story/queen-elizabeth-ii-funeral-details-security/",
          "publishedOn": "2022-09-18T11:00:00.000Z",
          "wordCount": 21610,
          "title": "The Queen’s Funeral Sets Off the Biggest UK Police Operation Ever",
          "imageUrl": "https://media.wired.com/photos/63250dc8eecde8c117e7f4a4/191:100/w_1280,c_limit/Queen-Queues-London-Security-GettyImages-1243218331.jpg"
        },
        {
          "id": "6324bae4c9bb1af7ef2497d2",
          "author": "Andrew Couts",
          "description": "Plus: An AI artist exposes surveillance of Instagram users, the US charges Iranians over a ransomware campaign, and more.",
          "link": "https://www.wired.com/story/cbp-phone-database-ai-instagram-surveillance/",
          "publishedOn": "2022-09-17T13:00:00.000Z",
          "wordCount": 18475,
          "title": "US Border Agents May Have a Copy of Your Text Messages",
          "imageUrl": "https://media.wired.com/photos/6324fc19c9bb1af7ef2497da/191:100/w_1280,c_limit/US-Border-Patrol-Data-Security-GettyImages-1083178844.jpg"
        },
        {
          "id": "632496798990652479ff3877",
          "author": "Lily Hay Newman",
          "description": "An alleged teen hacker claims to have gained deep access to the company’s systems, but the full picture of the breach is still coming into focus.",
          "link": "https://www.wired.com/story/uber-hack-mfa-phishing/",
          "publishedOn": "2022-09-16T21:35:11.000Z",
          "wordCount": 19322,
          "title": "The Uber Hack’s Devastation Is Just Starting to Reveal Itself",
          "imageUrl": "https://media.wired.com/photos/6324bd9ac4d3ebc9237bc60e/191:100/w_1280,c_limit/Uber-Hack-Security-GettyImages-1238322525.jpg"
        },
        {
          "id": "631b4210eecde8c117e7f368",
          "author": "Matt Laslo",
          "description": "The American Data Privacy and Protection Act could protect people across the country. But first, it has to get past Nancy Pelosi.",
          "link": "https://www.wired.com/story/adppa-roe-democrats-congress/",
          "publishedOn": "2022-09-15T11:00:00.000Z",
          "wordCount": 24393,
          "title": "The Shaky Future of a Post-Roe Federal Privacy Law",
          "imageUrl": "https://media.wired.com/photos/63226c3020bc56769c4130ee/191:100/w_1280,c_limit/security-roe-530562743.jpg"
        },
        {
          "id": "6320f8e900704d14b5ffb882",
          "author": "Matt Laslo",
          "description": "Peiter “Mudge” Zatko’s allegations about the social media platform renewed a sense of urgency for lawmakers to rein in Big Tech.",
          "link": "https://www.wired.com/story/peiter-mudge-zatko-twitter-senate-judiciary-testimony/",
          "publishedOn": "2022-09-14T19:01:41.000Z",
          "wordCount": 18779,
          "title": "The Twitter Whistleblower’s Testimony Has Senators Out for Blood",
          "imageUrl": "https://media.wired.com/photos/632115df20bc56769c4130e7/191:100/w_1280,c_limit/Congress's%20takeaways%20from%20the%20Twitter%20whistleblower%20hearing-GettyImages-1423404059.jpg"
        },
        {
          "id": "6320f08cd884b4dcc94164fe",
          "author": "Chris Stokel-Walker",
          "description": "Yurii Shchyhol gives WIRED a rare interview about running the country’s Derzhspetszviazok and the state of the online conflict with Russia.",
          "link": "https://www.wired.com/story/yurii-shchyhol-urkaine-cyberwar-russia/",
          "publishedOn": "2022-09-14T11:00:00.000Z",
          "wordCount": 19062,
          "title": "Ukraine’s Cyberwar Chief Sounds Like He’s Winning",
          "imageUrl": "https://media.wired.com/photos/6320f08c62435d269fdbdb39/191:100/w_1280,c_limit/Ukraine%E2%80%99s-Cyberwar-Chief-Sounds-Like-He%E2%80%99s-Winning-Security-GettyImages-1242260474-GettyImages-1242283013.jpg"
        },
        {
          "id": "631fc39f8990652479ff3848",
          "author": "Matt Burgess",
          "description": "Exposing wrongdoing is risky on the best of days. Whistleblower Aid cofounder John Tye explains the extensive steps needed to keep people safe.",
          "link": "https://www.wired.com/story/whistleblower-safety-mudge-twitter-senate-hearing/",
          "publishedOn": "2022-09-13T11:00:00.000Z",
          "wordCount": 19584,
          "title": "How Whistleblowers Navigate a Security Minefield",
          "imageUrl": "https://media.wired.com/photos/631fc39f00704d14b5ffb878/191:100/w_1280,c_limit/How-Whistleblowers-Navigate-a-Security-Minefield-Security-GettyImages-1242680586.jpg"
        },
        {
          "id": "631b90a1d884b4dcc94164be",
          "author": "Lily Hay Newman",
          "description": "Safety Check and Lockdown Mode give people in vulnerable situations ways to quarantine themselves from acute risks.",
          "link": "https://www.wired.com/story/apple-ios-16-safety-check-lockdown-mode/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 20545,
          "title": "iOS 16 Has 2 New Security Features for Worst-Case Scenarios",
          "imageUrl": "https://media.wired.com/photos/631bbd66f1e5c40d2b1bc626/191:100/w_1280,c_limit/security-apple-lock.jpg"
        },
        {
          "id": "631bd10a8990652479ff3840",
          "author": "Matt Burgess",
          "description": "Plus: Albania cuts ties with Iran, claims of a TikTok data breach that didn’t happen, and much more.",
          "link": "https://www.wired.com/story/la-school-district-ransomware-albania-iran-security-roundup/",
          "publishedOn": "2022-09-10T13:00:00.000Z",
          "wordCount": 20034,
          "title": "Hackers Target Los Angeles School District With Ransomware",
          "imageUrl": "https://media.wired.com/photos/631bd10a977791160bfcd219/191:100/w_1280,c_limit/LAUSD-Ransomware-Security-GettyImages-1393843200.jpg"
        },
        {
          "id": "631939da8990652479ff376e",
          "author": "Matt Burgess",
          "description": "Samizdat Online syndicates banned news sites by hosting them on uncensored domains—allowing people to access independent reporting.",
          "link": "https://www.wired.com/story/russia-internet-censorship-samizdat-online/",
          "publishedOn": "2022-09-08T11:00:00.000Z",
          "wordCount": 21527,
          "title": "This Clever Anti-Censorship Tool Lets Russians Read Blocked News",
          "imageUrl": "https://media.wired.com/photos/631939da74ce5b82a68ef046/191:100/w_1280,c_limit/This-Clever-Anti-Censorship-Tool-Lets-Russians-Read-Blocked-News-Security-GettyImages-950362554.png"
        },
        {
          "id": "6318d57feecde8c117e7f34a",
          "author": "Matt Burgess",
          "description": "With iOS 16 and macOS Ventura, Apple is introducing passkeys—a more convenient and secure alternative to passwords.",
          "link": "https://www.wired.com/story/apple-passkeys-password-iphone-mac-ios16-ventura/",
          "publishedOn": "2022-09-07T18:45:36.000Z",
          "wordCount": 20960,
          "title": "Apple’s Killing the Password. Here’s Everything You Need to Know",
          "imageUrl": "https://media.wired.com/photos/6318d57fc9bb1af7ef249672/191:100/w_1280,c_limit/security-apple-password.jpg"
        },
        {
          "id": "630f9a9a3dfe1372fb61110f",
          "author": "Lily Hay Newman",
          "description": "US lawmakers keep warning about the popular app. But until they can explain what makes it uniquely dangerous, it’s difficult to tailor a resolution.",
          "link": "https://www.wired.com/story/tiktok-nationa-security-threat-why/",
          "publishedOn": "2022-09-06T11:00:00.000Z",
          "wordCount": 22416,
          "title": "It’s Time to Get Real About TikTok’s Risks",
          "imageUrl": "https://media.wired.com/photos/631253e1ba2a66af641b1326/191:100/w_1280,c_limit/security-tik-tok.jpg"
        }
      ]
    },
    {
      "title": "WIRED Guides Latest",
      "feedUrl": "https://www.wired.com/feed/tag/wired-guide/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": []
    },
    {
      "title": "Product Hunt — The best new products, every day",
      "feedUrl": "https://www.producthunt.com/feed",
      "siteUrl": "https://www.producthunt.com",
      "articles": [
        {
          "id": "https://www.producthunt.com/posts/sonos-sub-mini",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/sonos-sub-mini",
          "publishedOn": "2022-09-24T00:45:22.000Z",
          "wordCount": 1011,
          "title": "Sonos Sub Mini — Curvy subwoofer that drops big beats",
          "imageUrl": "https://ph-files.imgix.net/5ff4e567-ce66-48fc-b014-aa2393873014.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/nftconomy",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/nftconomy",
          "publishedOn": "2022-09-23T19:53:18.000Z",
          "wordCount": 1106,
          "title": "NFTCONOMY — Real time NFT discovery, tracking, analytics & API tools",
          "imageUrl": "https://ph-files.imgix.net/94e07256-c462-42bc-afc1-a577054979e8.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/product-promotion-stack",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/product-promotion-stack",
          "publishedOn": "2022-09-23T19:44:44.000Z",
          "wordCount": 842,
          "title": "Product Promotion Stack — Free resources to promote your product/startup in ClickUp",
          "imageUrl": "https://ph-files.imgix.net/3ff10c22-597f-48a4-8591-853b6fdb8428.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/ai-picasso",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/ai-picasso",
          "publishedOn": "2022-09-23T19:16:13.000Z",
          "wordCount": 1015,
          "title": "AI Picasso — Make art with Stable Diffusion",
          "imageUrl": "https://ph-files.imgix.net/888639df-307a-4d40-9cb0-75886a541cfd.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/popflick",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/popflick",
          "publishedOn": "2022-09-23T17:01:21.000Z",
          "wordCount": 1027,
          "title": "Popflick — Watch movies, while supporting filmmakers",
          "imageUrl": "https://ph-files.imgix.net/41a59523-b656-4521-8010-14f9ca4aff34.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/cv-builder-for-no-coders",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/cv-builder-for-no-coders",
          "publishedOn": "2022-09-23T16:31:44.000Z",
          "wordCount": 1014,
          "title": "CV Builder for No-coders — Build a NoCoder resume to land freelance jobs",
          "imageUrl": "https://ph-files.imgix.net/cc96c0f3-e3ff-4332-94fa-9b56ccb20232.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/nano-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/nano-2",
          "publishedOn": "2022-09-23T16:25:14.000Z",
          "wordCount": 886,
          "title": "Nano — Bio site for creative minds",
          "imageUrl": "https://ph-files.imgix.net/980cb1ce-45a0-46a5-87a0-bece17599a87.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/artisankonect",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/artisankonect",
          "publishedOn": "2022-09-23T13:52:03.000Z",
          "wordCount": 937,
          "title": "Artisankonect — Connecting clients with nearby artisans",
          "imageUrl": "https://ph-files.imgix.net/7238d50c-066e-42c6-b4d5-e21e4dad12a6.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/hff-products",
          "author": null,
          "description": "www.hffproducts.com , and I am here to introduce this free useful web software to help you to pick the winning products from Aliexpress.com.\nThis website contains millions of Aliexpress products, and supports various sorting, and filters to make product selection process easy. For example, a good product normally has 4.7+ review score, 4.7+ toward stores scores in term of shipping speed, and product description. This search tool make easy to find the winning product is different verticals.\nYour experience is critical to us, and don't forget to subscribe or leave feedbacks to us.\n\nThanks !\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/hff-products",
          "publishedOn": "2022-09-23T12:37:48.000Z",
          "wordCount": 1036,
          "title": "Hff Products — A search tool to find winning products from million of items",
          "imageUrl": "https://ph-files.imgix.net/ab228afb-051f-46cf-a45c-5b16cf81091a.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/whisper-by-openai",
          "author": null,
          "description": "this subtitle generator for Youtube videos.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/whisper-by-openai",
          "publishedOn": "2022-09-23T11:22:21.000Z",
          "wordCount": 930,
          "title": "Whisper by OpenAI — A neural net for speech recognition",
          "imageUrl": "https://ph-files.imgix.net/5de17489-a038-40df-9e63-306632eb5255.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/anywidget",
          "author": null,
          "description": "https://www.youtube.com/shorts/j...\nOfficial Web Guide: https://www.deltalab.top/lockscr...\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/anywidget",
          "publishedOn": "2022-09-23T10:31:52.000Z",
          "wordCount": 1013,
          "title": "AnyWidget — App Launcher, customize your Lock Screen on iPhone",
          "imageUrl": "https://ph-files.imgix.net/2e1b1f27-78db-4a9b-8eb3-09faca320d05.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/conundrumug-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/conundrumug-2",
          "publishedOn": "2022-09-23T09:47:14.000Z",
          "wordCount": 1019,
          "title": "Conundrumug — A coffe mug full of puzzles",
          "imageUrl": "https://ph-files.imgix.net/f935aee9-de48-4894-af64-fe1a04a40db3.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/cookie-dialog-monster",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/cookie-dialog-monster",
          "publishedOn": "2022-09-23T09:30:48.000Z",
          "wordCount": 976,
          "title": "Cookie Dialog Monster — Did someone say cookies?",
          "imageUrl": "https://ph-files.imgix.net/ed69acaa-6295-42a7-8cf4-3c8ae231efc5.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/slack-canvas",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/slack-canvas",
          "publishedOn": "2022-09-23T08:43:52.000Z",
          "wordCount": 1040,
          "title": "Slack Canvas — A new surface to curate and collaborate within Slack",
          "imageUrl": "https://ph-files.imgix.net/28da28a1-40cf-4eb1-bedf-203d8a3e63de.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/horizon-helvetica",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/horizon-helvetica",
          "publishedOn": "2022-09-23T07:46:52.000Z",
          "wordCount": 984,
          "title": "Horizon Helvetica® — The “Swiss army knife” of sketch tools",
          "imageUrl": "https://ph-files.imgix.net/75bf576f-077c-491b-983c-c75c6db30d32.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/vetrinalive",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/vetrinalive",
          "publishedOn": "2022-09-23T07:37:22.000Z",
          "wordCount": 1005,
          "title": "VetrinaLive — Sell digital & physical  goods without transaction fees",
          "imageUrl": "https://ph-files.imgix.net/a8dd4ab5-61f4-418c-a3f9-82c952fd4fbf.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/zoom-for-livechat",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/zoom-for-livechat",
          "publishedOn": "2022-09-23T07:09:44.000Z",
          "wordCount": 1023,
          "title": "Zoom for LiveChat — Create Zoom meetings with your clients straight in the chat",
          "imageUrl": "https://ph-files.imgix.net/77e7996f-2220-4af2-8a74-d078f6a0d73c.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/tasquitos-freelance-marketplace",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/tasquitos-freelance-marketplace",
          "publishedOn": "2022-09-23T07:08:08.000Z",
          "wordCount": 963,
          "title": "Tasquitos Freelance Marketplace — Get more leads, more sales, and more trust by better content",
          "imageUrl": "https://ph-files.imgix.net/4a8eea00-832f-4b83-92a5-1c0231e7cbec.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/media-hoarder",
          "author": null,
          "description": "https://media.hoarder.software/b...\n\nWatch this video to get an overview of the features: https://youtu.be/TGkU9e1l8HU\n\n\nFeatures of Media Hoarder:\n\n- robust import of your media and smart meta data retrieval\n- filtering and discovery on an extensive amount of meta data\n- combine filters easily to find what you are searching for\n- no breaking screen changes: almost everything is at most 2 clicks away\n- capable to manage large media collections\n\nand much more.\n\nNext up on the roadmap: TV series support\n\nSome links:\n\nMedia Hoarder Website: https://media.hoarder.software/\nGitHub project: https://github.com/theMK2k/Media...\n\ncheers!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/media-hoarder",
          "publishedOn": "2022-09-23T07:05:26.000Z",
          "wordCount": 868,
          "title": "Media Hoarder — The media frontend for data hoarders and movie lovers",
          "imageUrl": "https://ph-files.imgix.net/98cd2d1e-de4e-4de7-a6f9-1580d50e1416.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/wlb-works",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/wlb-works",
          "publishedOn": "2022-09-23T07:04:18.000Z",
          "wordCount": 1027,
          "title": "WLB.works — A job seeking website focusing on work life balance",
          "imageUrl": "https://ph-files.imgix.net/30acb6cb-eba0-4480-b086-a1db7a1d9128.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/guide-to-finding-a-crypto-job",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/guide-to-finding-a-crypto-job",
          "publishedOn": "2022-09-23T06:35:08.000Z",
          "wordCount": 1106,
          "title": "Guide to Finding a Crypto Job — 34-page free guide to Web3, crypto and blockchain jobs",
          "imageUrl": "https://ph-files.imgix.net/55a03566-2d57-49c8-905e-9292b1fd9930.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/greeningweb",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/greeningweb",
          "publishedOn": "2022-09-23T06:23:06.000Z",
          "wordCount": 944,
          "title": "GreeningWeb — A widget that makes your website traffic green",
          "imageUrl": "https://ph-files.imgix.net/fb16fad4-4685-4447-97b3-4c50191f05b5.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/luma-language-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/luma-language-2",
          "publishedOn": "2022-09-23T02:22:06.000Z",
          "wordCount": 1072,
          "title": "Luma Language — Learn French in seconds",
          "imageUrl": "https://ph-files.imgix.net/a76ace8b-2048-44b7-8ae7-72621874f124.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/fables-ink",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/fables-ink",
          "publishedOn": "2022-09-22T22:19:42.000Z",
          "wordCount": 1020,
          "title": "Fables.ink — Forget about PDF's while playing RPG",
          "imageUrl": "https://ph-files.imgix.net/68e97f7d-82b7-4691-b113-0267eb1bfa2e.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/mailscribe",
          "author": null,
          "description": "I hope you'll join us in using Mailscribe to make your email life easier! 😍\n\n---\n\n🔥🔥 Spoiler Alert! 🔥🔥\nMailscribe Inbox is just one of the Mailscribe products. We're getting ready to publish our other products in a few weeks. To follow us, you can subscribe to our newsletter on our website.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/mailscribe",
          "publishedOn": "2022-09-22T21:31:40.000Z",
          "wordCount": 957,
          "title": "Mailscribe — Keep your inbox clean",
          "imageUrl": "https://ph-files.imgix.net/367a2521-0ad9-4c9e-be50-43fba45532a5.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/task-manager-for-clickup",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/task-manager-for-clickup",
          "publishedOn": "2022-09-22T19:56:30.000Z",
          "wordCount": 948,
          "title": "Task Manager for ClickUp — Manage all your ClickUp tasks in one go.",
          "imageUrl": "https://ph-files.imgix.net/50e68705-8d97-465c-b28c-9df58f1a93e4.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/founder-anonymous",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/founder-anonymous",
          "publishedOn": "2022-09-22T18:43:03.000Z",
          "wordCount": 975,
          "title": "Founder-Anonymous — Being a founder is hard. You are not alone.",
          "imageUrl": "https://ph-files.imgix.net/eab046e2-e8f9-4a3f-a02b-1593dfac056e.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/the-hustlers",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/the-hustlers",
          "publishedOn": "2022-09-22T18:30:47.000Z",
          "wordCount": 1067,
          "title": "The Hustlers — Stories of people making money while having a full-time job",
          "imageUrl": "https://ph-files.imgix.net/c1725836-b006-4e1d-a10a-dfe2e463a063.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/getreadywithmusic-by-spotify",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/getreadywithmusic-by-spotify",
          "publishedOn": "2022-09-22T18:19:30.000Z",
          "wordCount": 1016,
          "title": "GetReadyWithMusic by Spotify — Get a playlist that matches your style",
          "imageUrl": "https://ph-files.imgix.net/7fe10f9d-f0d3-4a91-bcdc-b2e320cae303.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/first-party-data-ebook-data-audit",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/first-party-data-ebook-data-audit",
          "publishedOn": "2022-09-22T18:11:34.000Z",
          "wordCount": 1108,
          "title": "First Party Data EBook & Data Audit — How to use first-party data to grow your audience & sales",
          "imageUrl": "https://ph-files.imgix.net/ad884dcf-dc37-43c4-b1e7-7c5b31bab6bd.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/huddu",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/huddu",
          "publishedOn": "2022-09-22T17:13:22.000Z",
          "wordCount": 915,
          "title": "Huddu — Accessible logging for everyone",
          "imageUrl": "https://ph-files.imgix.net/68b37b53-b024-43e7-938e-46cc995ef3d0.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/ngrow-ai",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/ngrow-ai",
          "publishedOn": "2022-09-22T17:04:45.000Z",
          "wordCount": 990,
          "title": "nGrow.ai — AI-driven push notifications on top of your analytics",
          "imageUrl": "https://ph-files.imgix.net/b1e1beca-dffe-4fb3-b805-35b106d3da13.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/alldone-app",
          "author": null,
          "description": "https://medium.com/@karstenwysk/...\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/alldone-app",
          "publishedOn": "2022-09-22T16:05:03.000Z",
          "wordCount": 1123,
          "title": "Alldone.app — All-in-one personal productivity app to level up your life",
          "imageUrl": "https://ph-files.imgix.net/e459e5bc-2a0a-420e-81c9-1808709648e4.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/ironhack-podcast-tech-careers",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/ironhack-podcast-tech-careers",
          "publishedOn": "2022-09-22T14:33:35.000Z",
          "wordCount": 1064,
          "title": "Ironhack Podcast: Tech Careers — All of your tech career questions answered in one podcast",
          "imageUrl": "https://ph-files.imgix.net/c156e631-55ae-4d59-8fa4-24b14a488bbf.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/smiles-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/smiles-2",
          "publishedOn": "2022-09-22T12:56:47.000Z",
          "wordCount": 873,
          "title": "sMiles — Earn Bitcoin for things you already do",
          "imageUrl": "https://ph-files.imgix.net/5ce7b035-ecdd-4c3a-869a-76881719c664.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/greenspace-golf",
          "author": null,
          "description": "charlie@greenspacegolf.com\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/greenspace-golf",
          "publishedOn": "2022-09-22T11:46:43.000Z",
          "wordCount": 995,
          "title": "Greenspace Golf  — Virtual Golf Clubhouse",
          "imageUrl": "https://ph-files.imgix.net/c21c6f2f-930d-4d71-8b62-68801050bafc.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/niftify-paas",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/niftify-paas",
          "publishedOn": "2022-09-22T10:45:50.000Z",
          "wordCount": 942,
          "title": "Niftify PaaS — No-code NFT Website builder",
          "imageUrl": "https://ph-files.imgix.net/64e71ab7-bd86-4032-bbc1-70669998cb28.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/notion-icons-generator",
          "author": null,
          "description": "https://notaku.so) look much nicer and pretty 🤩\n\nLet me know what you think in the comments! 😃\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/notion-icons-generator",
          "publishedOn": "2022-09-22T10:40:10.000Z",
          "wordCount": 1023,
          "title": "Notion Icons Generator — Add icons to all your Notion pages based on their title",
          "imageUrl": "https://ph-files.imgix.net/95924d23-9af6-4d95-8f1a-5bafc9c9988c.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/trombone-champ",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/trombone-champ",
          "publishedOn": "2022-09-22T10:13:49.000Z",
          "wordCount": 983,
          "title": "Trombone Champ — It's like Guitar Hero but for Trombone",
          "imageUrl": "https://ph-files.imgix.net/fb6f0ca5-65e7-41e6-8e9d-3b12981df215.jpg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/migrating-to-web3-a-cheat-sheet",
          "author": null,
          "description": "Filebase, just released a nice ebook about how to migrate your infrastructure to web 3. If you want to be less dependent on centralized systems like AWS, it deserves checking out.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/migrating-to-web3-a-cheat-sheet",
          "publishedOn": "2022-09-21T19:54:04.000Z",
          "wordCount": 997,
          "title": "Migrating to Web3: A Cheat Sheet — Learn what Web3 is and how your business can migrate",
          "imageUrl": "https://ph-files.imgix.net/41bf6653-f625-4055-b4a4-8d3656f0ce6b.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/spriteley-voxcells",
          "author": null,
          "description": "https://discord.gg/spriteley\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/spriteley-voxcells",
          "publishedOn": "2022-09-21T19:38:37.000Z",
          "wordCount": 994,
          "title": "Spriteley Voxcells — Build and evolve blocky life",
          "imageUrl": "https://ph-files.imgix.net/f3b9c299-aa8e-4b08-ae3b-1e97ed7a21d9.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/remotelane-5-0",
          "author": null,
          "description": "Remoelane.com from scratch with a new tech stack and it's my seventh startup which is part of the 24 Startups in 24 Months Challenge. The versions of Remotelane.com before were developed together with @sonnypgs. The other seventh startup from @sonnypgs is EpicAhead.\n\nRemotelane.com is known as a remote job aggregator which shows up to 15 new remote jobs per hour from all around the web which will stay 30 days on the page. The search works simple with executing the search after stop typing for 1s without the need to press a button. \n\nThe job post cell includes now a description which you can expand/collapse per click, also you can filter by categories and tags. The \"Post a Remote Job\" Feature is as simple as possible, just provide the job title, company name, job description, the link to apply or email to apply, choose a category and add up to five optional tags. Also the newsletter is just a simple list like the website itself.\n\nA more detailed blogpost can be found here https://24startups24months.com/posts/7-startup-remotelane-com\n\nIf you should have questions or feedback, let us know in the comments below :) All feedback is welcome.\n\nCheers!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/remotelane-5-0",
          "publishedOn": "2022-09-21T12:15:46.000Z",
          "wordCount": 922,
          "title": "Remotelane 5.0 — Remote jobs for everyone",
          "imageUrl": "https://ph-files.imgix.net/453efa45-9001-4b9c-8736-7ea3cdbe898b.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/bg-eraser",
          "author": null,
          "description": "AI Image Enlarger was released three years ago, we have received quite a lot of emails, and users love using our AI tool to process their images. Now we have released a quite new tool of Bg Eraser that you can use for improving the productivity of the designing and creative works. \n\n🤓 What is Bg Eraser and How Does it Work?\nWe have integrated an AI Inpainting model that could recognize and remove the objects, guess and regenerate the content backward. If you want to remove unwanted objects, people, text, and even watermarks from an image, you can try this tool, as that is what Bg Eraser can do.\n\nBg Eraser also enables you to remove the background from an image and make it background transparent. After that, you can use the editing tool to change the background color or images. Quite easy to start.\n\nAll in all, Bg Eraser provides two great features for your creative and designing works. Increase your productivity and clean up your pictures easily.\n\n1.\tMagic Eraser: Remove unwanted objects and retouch images with reliable quality.\n2.\tBackground Eraser: Remove background from images in seconds.\n\n🔥 Why you should use BgEraser\nBg Eraser applies the latest and cut-edging technology that make your job easier.\n\nHere are some features \n1. Remove objects from an image with the AI Inpainting technology\n2. Remove background and create PNG images\n3. 100 free to use and no account required\n4. Unlimited access to the Magic Eraser tool\n5. Reliable, fast and amazing.\n\n🚀 Roadmap\n- More accurate when inpainting\n- Make the process faster\n\nJust drop me an email at support@bgeraser.com or leave your comments if you have any ideas. I would like to hear from you!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/bg-eraser",
          "publishedOn": "2022-09-21T05:48:38.000Z",
          "wordCount": 1065,
          "title": "Bg Eraser — Clean up and remove unwanted objects, background from images",
          "imageUrl": "https://ph-files.imgix.net/5d7c4568-58e0-4fec-b4b3-24d64f07cab0.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/compassion-game",
          "author": null,
          "description": "https://compassionplanet.space) as a first step. \nRather than lead protests (although I still attend) or sell some new plant-based meat, my focus is on human-centered (web) apps to motivate players, based on game principles, to gradually adopt a more compassionate plant-based diet.\nI wrote a more in-depth blog post about why I built the game here: https://compassionplanet.space/c.... \n\nI am still looking for co-founders so if you or your friends think liberating farmed animals and entrepreneurship are cool like I do, please reach out!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/compassion-game",
          "publishedOn": "2022-09-20T20:37:53.000Z",
          "wordCount": 1048,
          "title": "Compassion Game — A gamified app that motivates adopting a plant-based diet",
          "imageUrl": "https://ph-files.imgix.net/7a582444-4b06-4ace-be58-4af5f1aa1d77.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/roex-automix",
          "author": null,
          "description": "https://www.youtube.com/playlist...)\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/roex-automix",
          "publishedOn": "2022-09-20T08:30:52.000Z",
          "wordCount": 960,
          "title": "RoEx Automix — AI powered music production and distribution tool",
          "imageUrl": "https://ph-files.imgix.net/b26e786d-77ec-4d1f-8ffd-d8aff0292b66.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/quicknode-marketplace",
          "author": null,
          "description": "https://www.quicknode.com/marketplace or if you have a QuickNode account already, just click \"Developer\" on the left nav bar.\n\nWe're looking for early feedback as we just launched this yesterday at Messari's Mainnet conference. Looking forward to hearing from you!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/quicknode-marketplace",
          "publishedOn": "2022-09-20T04:11:03.000Z",
          "wordCount": 1066,
          "title": "QuickNode Marketplace — Single click add-ons for your web3 tooling",
          "imageUrl": "https://ph-files.imgix.net/dc78e2b6-286f-410d-b45d-6afdf34038ca.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/affilisting",
          "author": null,
          "description": "https://affilisting.com/#affiliate\n\nYou can get 20% off until 15 October 2022 with the code PH20OFF or by clicking on this link: \nhttps://gsouillard.gumroad.com/l...\n\n\nIf you have any questions, feel free to contact me on Twitter: https://twitter.com/affilisting\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/affilisting",
          "publishedOn": "2022-09-19T14:22:27.000Z",
          "wordCount": 923,
          "title": "Affilisting — 10K+ affiliate programs across 500+ niches for $99",
          "imageUrl": "https://ph-files.imgix.net/25bf5338-b148-46c3-ad32-a951390399eb.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/pott-d",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/pott-d",
          "publishedOn": "2022-09-19T11:42:46.000Z",
          "wordCount": 1077,
          "title": "Pott'd — Air-dry pottery kit for fun date nights or time w/ friends",
          "imageUrl": "https://ph-files.imgix.net/71ffb087-25dc-4e0a-8f9d-2932850f8add.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/doubletext-v2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/doubletext-v2",
          "publishedOn": "2022-09-18T09:31:59.000Z",
          "wordCount": 1041,
          "title": "DoubleText v2 — Fascinating analytics for Messenger and now WhatsApp chats",
          "imageUrl": "https://ph-files.imgix.net/a748fe0d-30f4-4981-a216-e7ff0405d4e9.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/versify",
          "author": null,
          "description": "Versify. We have worked extremely hard to make the process so easy that someone with zero technical knowledge can create and airdrop an NFT to their entire customer list in less than 5 minutes. Seriously, try it here.\n\nHere's what you can expect from Versify:\n🏎️ Frictionless. Not familiar with blockchain? Don't own a crypto wallet? No problem at all. Versify has the crypto newcomers in mind, so we abstracted away all technical intricacies.\n😌 Convenient. Already store your customer list in another app like Salesforce or Mailchimp? Perfect! With our pre-built integrations, you can instantly connect your other tools and automatically airdrop an NFT to any or all of your customers.\n💰 Cost-effective. Did we mention that Versify is entirely free for up to 25 mints?\n\n🎲 SCAVENGER HUNT 🎲\nIn the spirit of some Product Hunt fun & creativity, we decided to create a mini scavenger hunt using Versify Mint Links. We have hidden three collectibles within this page and the Versify dashboard. Collect all 3 to redeem free premium access (up to 1,000 mints) to the platform for a month. We'll make the first one a freebie. Here it is.\n\nWe are so excited to build Versify with you and can't wait for you to try it. To get started, create your account here. We'd love to hear all feedback, suggestions, and questions.\n\nThank you all for your support and advice.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/versify",
          "publishedOn": "2022-09-02T18:20:16.000Z",
          "wordCount": 1016,
          "title": "Versify — Engage and reward your customers with digital collectibles",
          "imageUrl": "https://ph-files.imgix.net/23de401e-722f-4083-9088-974731ac5a2e.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}