{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news/",
      "articles": [
        {
          "id": "https://www.freecodecamp.org/news/linux-basics/",
          "author": "Daniel Iwugo",
          "description": "Time to learn how to use the operating system of the average hacker 🐧. In this article, we will take a little tour of:  * The Linux operating system  * Package management  * The Linux file structure  * The Command Line Interface And you get to",
          "link": "https://www.freecodecamp.org/news/linux-basics/",
          "publishedOn": "2022-09-26T23:20:22.000Z",
          "wordCount": 4025,
          "title": "Linux for Hackers – Basics for Cybersecurity Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/linux-basics-for-hackers.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-loop-through-an-array-with-for-loop-in-javascript/",
          "author": "Dennis Temoye Charity",
          "description": "A loop is an instruction in computer programming that allows an application to repeat a process until a specific condition is met. For example, say you want to run through a list of names and output each name on your screen. If you didn't use a loop, you'd end up",
          "link": "https://www.freecodecamp.org/news/how-to-loop-through-an-array-with-for-loop-in-javascript/",
          "publishedOn": "2022-09-26T23:14:42.000Z",
          "wordCount": 1364,
          "title": "JavaScript For loop – How to Loop Through an Array in JS",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/1_9H5rmyp3MgrcA8i1emsJPg.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/iteration-in-golang/",
          "author": "Ubaydah Abdulwasiu",
          "description": "In programming, iteration (commonly known as looping) is a process where a step is repeated n number of times until a specific condition is met. Just like every other programming language, Golang has a way of iterating through different data structures and data types like structs, maps, arrays, strings, and",
          "link": "https://www.freecodecamp.org/news/iteration-in-golang/",
          "publishedOn": "2022-09-26T22:44:22.000Z",
          "wordCount": 2082,
          "title": "Iteration in Golang – How to Loop Through Data Structures in Go",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/How-to-perform-iteration-in-Golang-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-create-serverless-logic-with-azure-functions/",
          "author": "Salim Oyinlola",
          "description": "What is Serverless Computing? You can think of serverless computing as a function as a service, or a microservice that is hosted on a cloud platform.  In this setup, your business logic runs as functions, and you do not have to manually create or scale infrastructure. The cloud platform",
          "link": "https://www.freecodecamp.org/news/how-to-create-serverless-logic-with-azure-functions/",
          "publishedOn": "2022-09-26T22:35:00.000Z",
          "wordCount": 2248,
          "title": "How to Create Serverless Logic with Azure Functions",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/QWERTYUIOP.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/javascript-concepts-you-should-know-before-learning-react/",
          "author": "Ashutosh Mishra",
          "description": "React is one of the most popular JavaScript frameworks for building single page applications. Needless to say, as a JavaScript framework, it requires you to have a good knowledge of JavaScript concepts. In this article, we are going to take a look at some of those JavaScript concepts that you",
          "link": "https://www.freecodecamp.org/news/javascript-concepts-you-should-know-before-learning-react/",
          "publishedOn": "2022-09-26T19:22:52.000Z",
          "wordCount": 2533,
          "title": "The JavaScript Concepts You Should Know Before Learning React",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/pexels-pixabay-417173--1-.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/machine-learning-for-everybody/",
          "author": "Beau Carnes",
          "description": "Machine learning technology is now so common that you probably use it dozens of times a day without even realizing it. And since it has so many applications, the job prospects are great for anyone with a lot of machine learning experience. We just released a machine learning course on",
          "link": "https://www.freecodecamp.org/news/machine-learning-for-everybody/",
          "publishedOn": "2022-09-26T17:28:23.000Z",
          "wordCount": 848,
          "title": "Machine Learning for Everybody",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/machinelearning.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/html-drop-down-menu-how-to-add-a-drop-down-list-with-the-select-element/",
          "author": "Joel Olawanle",
          "description": "Many websites, applications, and web pages use drop-down menus to help display a list of information. You can use them to create navigation menus, options for forms, and more. If you're looking at some of these menus or lists, you might imagine how complex creating them could be. And yes",
          "link": "https://www.freecodecamp.org/news/html-drop-down-menu-how-to-add-a-drop-down-list-with-the-select-element/",
          "publishedOn": "2022-09-26T14:25:06.000Z",
          "wordCount": 1500,
          "title": "HTML Drop-down Menu – How to Add a Drop-Down List with the Select Element",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/cover-template--9-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/introduction-to-git-and-github/",
          "author": "Segun Ajibola",
          "description": "Git and GitHub are common tools used in programming. They help you manage different versions of your code and collaborate with other developers. Building projects is one of the core parts of being a developer. And Git and GitHub are essential tools you'll use when building projects with others. But",
          "link": "https://www.freecodecamp.org/news/introduction-to-git-and-github/",
          "publishedOn": "2022-09-26T05:23:00.000Z",
          "wordCount": 2199,
          "title": "How to Use Git and GitHub – Introduction for Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Untitled-design--6-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/html-background-image-how-to-add-wallpaper-images-to-your-website/",
          "author": "Ihechikara Vincent Abba",
          "description": "Background images can help beautify websites and make them more attractive to users.  In this article, you'll learn:   * How to add a background image to your website using the CSS background-image     property.   * Other CSS background properties for images. How",
          "link": "https://www.freecodecamp.org/news/html-background-image-how-to-add-wallpaper-images-to-your-website/",
          "publishedOn": "2022-09-23T19:18:19.000Z",
          "wordCount": 1202,
          "title": "HTML Background Image – How to Add Wallpaper Images to Your Website",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/jonatan-pie-3l3RwQdHRHg-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-use-surrealdb-with-fresh-framework/",
          "author": "Rajdeep Singh",
          "description": "SurrealDB is a newly launched database that has recently started gaining popularity in the programming world. SurrealDB was built with the Rust language and was created by Tobie Morgan Hitchcock [https://www.linkedin.com/in/tobiemorganhitchcock/] and Jaime Morgan Hitchcock [https://www.linkedin.com/in/jaimemorganhitchcock/]. SurrealDB's new database comes with many features, but I'm most interested in the Deno",
          "link": "https://www.freecodecamp.org/news/how-to-use-surrealdb-with-fresh-framework/",
          "publishedOn": "2022-09-23T17:51:53.000Z",
          "wordCount": 3329,
          "title": "How to Use SurrealDb with the Fresh Framework and Deno",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Surreal-DB--and-deno-fresh-CMS--4-.png"
        }
      ]
    },
    {
      "title": "DEV Community 👩‍💻👨‍💻",
      "feedUrl": "https://dev.to/feed",
      "siteUrl": "https://dev.to",
      "articles": [
        {
          "id": "https://dev.to/hr21don/enable-dark-mode-for-your-astro-website-via-css-variables-ohe",
          "author": "Helitha Rupasinghe",
          "description": "The use of a dark mode has grown in popularity. Many large websites and applications are developing their own version of it which is often done using CSS variables.\nIn this post, we'll look at how to add support for dark mode to your website in two ways: first with CSS and then with a JavaScript toggle.\nI highly recommend you go ahead and fork a Astro starter from Astro.new.\n\nYou can choose a template of your choice and then open the template in CodeSandbox which will automatically handle the required dependencies.\nInside the components folder, I've added a new component called ThemeChange.astro. It's basic functionality includes a clickable element alongside our svg images for our toggle.\n<div class=\"theme-switch-wrapper\">\n          <label class=\"theme-switch\" for=\"checkbox\">\n            …",
          "link": "https://dev.to/hr21don/enable-dark-mode-for-your-astro-website-via-css-variables-ohe",
          "publishedOn": "2022-09-27T10:37:58.000Z",
          "wordCount": 1966,
          "title": "Enable Dark Mode For Your Astro Website via CSS Variables",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--q5jz1gqN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/jwgss9njgvxmi545zq68.png"
        },
        {
          "id": "https://dev.to/emanuelferreira/should-i-use-database-index-or-not-2m7e",
          "author": "Emanuel Ferreira",
          "description": "Indexes are a database structure to efficiently optimize your queries. A pointer is created to quickly find data instead of scanning your entire collection/table.\nHowever, you need to know when to use or which type of index to optimize your queries.\nJust as this can speed up your queries, it can slow down your entire database and increase the maintenance cost. Poorly chosen indexes decrease your performance by having to restructure all your B-tree\nAnalyzing your application is essential when choosing an index, which queries are being hit mostly? Does this one need to be faster? Will you give up inserting/updating speed to save time on readings?\nSelecting Indexes that will be used in many queries will help your index be more accurate and performant.\nIndexes should be used where you need to do a lot of reading operations on larger collections/tables or in searches that need to be fast.\nWhen your database has a lot of writes and read operations in indexed fields might be a lot expensive since your database will have to rewrite all your indexes.\nFor each writing operation, you are writing 2 times in your database, once the data and another for the index, taking up disk space and consuming more hardware to maintain the same, in large amounts slowing down your database.\nModeling your database by thinking about the number of writes operations that it will have, whether INSERT, DELETE, or UPDATE will save you a lot of headaches if you need fast READ operations.\nAnalyzing when you need fast insertions also will help you optimize your perfomance.\nChoosing an index is not as easy as it seems, knowing how to analyze your indexes is an essential step to doing something performant, but when well chosen this will certainly optimize your queries.\nFeedbacks on Twitter",
          "link": "https://dev.to/emanuelferreira/should-i-use-database-index-or-not-2m7e",
          "publishedOn": "2022-09-27T10:25:09.000Z",
          "wordCount": 1370,
          "title": "Should I use database index or not?",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Qk66D9Pg--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/9ztn0hfbt3c8hrrkwrk3.jpeg"
        },
        {
          "id": "https://dev.to/apisix/building-event-driven-api-services-using-cqrs-api-gateway-and-serverless-af4",
          "author": "Bobur Umurzokov",
          "description": "Developing API services using CQRS, API Gateway and Serverless combine three patterns, using the command query responsibility separation (CQRS) pattern, the event sourcing pattern, and the API Gateway pattern. The CQRS pattern separates the responsibilities of the command and query models. The event sourcing pattern takes advantage of asynchronous event-driven communication to improve the overall user experience. Furthermore, an API gateway should also be implemented as a resource router, thus preventing API consumers from having to deal with different URLs depending on the action being performed.\nAlthough the three concepts are independent, they complement each other well. This blog post explores how to build event-driven API Services using these 3 well-known patterns to build a highly sc…",
          "link": "https://dev.to/apisix/building-event-driven-api-services-using-cqrs-api-gateway-and-serverless-af4",
          "publishedOn": "2022-09-27T10:16:05.000Z",
          "wordCount": 2457,
          "title": "Building event-driven API services using CQRS, API Gateway and Serverless",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--uIlnAR9Y--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/uv79ftbt7lzgf6sf548x.jpg"
        },
        {
          "id": "https://dev.to/kshitij9896/understanding-micro-front-ends--8h7",
          "author": "Kshitij Bansod",
          "description": "🔷 The idea behind Micro Front-ends is to think \n🔷 A team is cross functional and develops its features end-to-end, from database to user interface.\n🔷 A team is cross functional and develops its features end-to-end, from database to user interface.\nFor More Such Amazing Posts\n@kshitij9896\nSave for Future...",
          "link": "https://dev.to/kshitij9896/understanding-micro-front-ends--8h7",
          "publishedOn": "2022-09-27T09:31:26.000Z",
          "wordCount": 1184,
          "title": "Understanding Micro Front-ends !!",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---Ru47lyK--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/7u59xkc49tcst5z91auz.png"
        },
        {
          "id": "https://dev.to/aws/nlpaws-newsletter-september-2022-4a7g",
          "author": "Ioan Catana",
          "description": "Hello world. This is the September 2022 edition of the AWS Natural Language Processing(NLP) newsletter covering everything related to NLP at AWS. Feel free to leave comments & share it on your social network.\nOnly one week to the first ever AWS NLP Summit 2022 in London! We are so excited about this and the team has put in a huge amount of effort to make sure that the agenda is packed with interesting speakers, sessions, and workshops.\n\nThe AWS NLP Summit 2022 at London, UK, features inspiring keynotes by:\nCraig Saunders Director of Machine Learning at Alexa AI\nVasi Philomin Vice President of AWS AI\nSatish Lakshmanan Director of AWS AI/ML Worldwide Specialists\nNot only do you get to interact with and hear from the most innovative minds in the industry, you can also try it in action with ha…",
          "link": "https://dev.to/aws/nlpaws-newsletter-september-2022-4a7g",
          "publishedOn": "2022-09-27T09:18:03.000Z",
          "wordCount": 2886,
          "title": "NLP@AWS Newsletter September 2022",
          "imageUrl": "https://dev.to/social_previews/article/1203485.png"
        },
        {
          "id": "https://dev.to/elenalape/introducing-holopin-the-digital-badge-platform-for-developers-2hlk",
          "author": "Elena Lape",
          "description": "Holopin — the cool way to do digital badges\n\n\nWe are so excited to introduce you to Holopin — the platform for creating and collecting digital badges! Holopin has been in the works for a while, and we are thrilled to finally share it with you.\n📣 PSA: Register for Hacktoberfest today and claim your first Holopin today.\nAs developers, we love collecting things. We have stickers on our laptops, pins on our backpacks, and stats on our GitHub profiles. We love to show off our achievements and share them with others. I couldn't tell you how many times I've been asked, \"What's that sticker on your laptop?\" or \"Wow, that's a cool T-shirt! Where did you get that?!\".\n\nBut we also know that collecting things can be a lot of work! They take up space, and it's hard to organize them. And don't get me s…",
          "link": "https://dev.to/elenalape/introducing-holopin-the-digital-badge-platform-for-developers-2hlk",
          "publishedOn": "2022-09-27T09:15:05.000Z",
          "wordCount": 1906,
          "title": "Introducing Holopin: the digital badge platform for developers!",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--wkGcRoJL--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/mh8s08h4pei1vkqgehkk.png"
        },
        {
          "id": "https://dev.to/gioboa/vite-module-federation-yes-we-can-i0o",
          "author": "Giorgio Boa",
          "description": "Microservices nowadays is a well-known concept and maybe you are using it in your current company.\nWith Module Federation you can load separately compiled and deployed code into a unique application. This particular task allows you to create a Microfrontend architecture.  \nUntil recently, this task was only a Webpack feature, but now there is a plugin to support Module Federation inside Vite.\nVite is a build tool that aims to provide a faster and leaner development experience for modern web projects. It's the de facto standard for new projects and framework starters.\nTo understand better the paradigm and the configurations I created a working example of a host that loads a remote application at runtime. \n\nThis is a simple Microfrontend architecture with Svelte, you can find the code here\nI hope this plugin can helps the Microfrontend adoption, thanks for your attention, bye 👋\nSpecial thanks to Manfred Steyer for his contribution in this plugin.",
          "link": "https://dev.to/gioboa/vite-module-federation-yes-we-can-i0o",
          "publishedOn": "2022-09-27T08:31:01.000Z",
          "wordCount": 1245,
          "title": "Vite + Module Federation: yes, we can",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--bmNAdiUM--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/3qtp0ag5d2m2691477j6.png"
        },
        {
          "id": "https://dev.to/jdxlabs/lets-try-cdktf-with-python-48a9",
          "author": "Jérôme Dx",
          "description": "Why CDKTF ?\n\n\nIt's been a few years that I heard about AWS CDK, an abstraction layer on top of CloudFormation, allowing you to build infrastructure with common programming languages, already known by developers, like TypeScript, JavaScript, Python, Java or C#.\nCDKTF is the Hashicorp's answer, offering the same concept, but with some pretty differences : \nIt runs with Terraform !\nLanguages are not exactly the same : TypeScript, Python, Java, C# and Go\nUltimately, you can use every Terraform provider and module available on the Terraform Registry, as the documentation says !\nThe most appropriate language seems to be TypeScript, it offers more possibilities and needs less installations.\nFor this example, you have to setup this tools : \nAn AWS account, with Aws-cli configured\nTerraform, with a…",
          "link": "https://dev.to/jdxlabs/lets-try-cdktf-with-python-48a9",
          "publishedOn": "2022-09-27T08:25:47.000Z",
          "wordCount": 1604,
          "title": "Let's try CDKTF (with Python)",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--xa7eRhPk--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/i8u33n7fmflapp6wz50l.png"
        },
        {
          "id": "https://dev.to/quokkalabs/difficulties-when-web-developers-dive-into-mobile-app-development-31ld",
          "author": "Dhruv Joshi",
          "description": "It is a typical moment when web developers start mobile app development and face many errors that are difficult to solve because of their lack of familiarity. Well, some developers learn quickly, and some learn slowly. Some developers who started mobile app development a few months ago are still struggling to resolve some bugs/errors. When they solve one, another one is ready to cause headaches.\nWell, it's all about learning, improving, and getting familiar with app development. \nSo, let's see the most significant difficulties new mobile app developers face and the easiest tricks to solve them.\nIt's common to face difficulties choosing a framework for mobile app development. Still, it's interesting to learn and find the perfect one. The confusing part is selecting an ideal framework from a…",
          "link": "https://dev.to/quokkalabs/difficulties-when-web-developers-dive-into-mobile-app-development-31ld",
          "publishedOn": "2022-09-27T08:18:12.000Z",
          "wordCount": 1836,
          "title": "Difficulties When Web Developers Dive into Mobile App Development",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--wLUd5YLq--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/3d4ojw1sc2om4vzqapuk.jpg"
        },
        {
          "id": "https://dev.to/shubhamtiwari909/meme-meme-meme-4dik",
          "author": "Mysterio",
          "description": "Here are few memes to cheer you up 😎\n\n\n\n\n\nPOST MORE MEMES IN THE COMMENT SECTION AND CHEER UP OTHERS😁😁\nTHANK YOU FOR CHECKING THIS POST\nYou can contact me on -\nhttps://www.instagram.com/supremacism__shubh/\nhttps://www.linkedin.com/in/shubham-tiwari-b7544b193/\nshubhmtiwri00@gmail.com\n^^You can help me by some donation at the link below Thank you👇👇 ^^\nhttps://www.buymeacoffee.com/waaduheck <--\nAlso check these posts as well\nhttps://dev.to/shubhamtiwari909/js-push-and-pop-with-arrays-33a2/edit\nhttps://dev.to/shubhamtiwari909/tostring-in-js-27b\nhttps://dev.to/shubhamtiwari909/join-in-javascript-4050\nhttps://dev.to/shubhamtiwari909/going-deep-in-array-sort-js-2n90",
          "link": "https://dev.to/shubhamtiwari909/meme-meme-meme-4dik",
          "publishedOn": "2022-09-27T08:12:27.000Z",
          "wordCount": 1099,
          "title": "Meme meme meme",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--i8HRifHc--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/dvzxw7ym85gp26gbbbrx.jpg"
        },
        {
          "id": "https://dev.to/appwrite/appwrite-oss-fund-sponsors-bottles-1phe",
          "author": "haimantika mitra",
          "description": "Hi readers 👋, welcoming you back to the \"Appwrite OSS Fund\" series, where we celebrate open-source maintainers. 🎉\nOn the 4th of May, the Appwrite team launched the OSS Fund, an initiative to support open-source project maintainers. Being an open-source company, we wanted to give back to the community and help as many people as we can. \nThe OSS Fund is an initiative that is very close to our heart. \nAfter careful considerations from the committee we are thrilled to announce the sixth project:\nIt's a pleasure to support projects like @usebottles that makes the life of a developer easier!\n🔗 OSS Fund is still accepting applications and is here to support open source maintainers - appwrite.io/oss-fund \n    \nBottles is an application that allows Windows software to run on Linux. The project u…",
          "link": "https://dev.to/appwrite/appwrite-oss-fund-sponsors-bottles-1phe",
          "publishedOn": "2022-09-27T08:11:30.000Z",
          "wordCount": 1942,
          "title": "Appwrite OSS Fund Sponsors Bottles",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Dwypltc2--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/zu2b0ji1l7odhdryayga.png"
        },
        {
          "id": "https://dev.to/bytehide/net-7-is-already-a-reality-microsoft-releases-the-first-release-candidate-of-net-7-4kc4",
          "author": "ByteHide",
          "description": "Yes, you are reading correctly. The first Release Candidate of the two that are going to be released has just been released.\nFor those who wonder what Release Candidate (RC) means, it is the version that has official support from Microsoft for those applications that are in production.\nAs Microsoft has told us, this is RC1 and RC2 is yet to be released, which is expected to be announced before the .NET Conf 2022 (to be held on November 8, 9 and 10). Let’s analyze what new features .NET 7 RC1 brings.\nThe first of the features brought with this first RC of .NET 7 is .NET MAUI. For those unfamiliar, this stands for .NET Multi-platform App UI, the platform with which you can develop applications, as the name suggests, cross-platform. Microsoft has designed .NET MAUI by unifying all the APIs of…",
          "link": "https://dev.to/bytehide/net-7-is-already-a-reality-microsoft-releases-the-first-release-candidate-of-net-7-4kc4",
          "publishedOn": "2022-09-27T08:03:56.000Z",
          "wordCount": 1878,
          "title": ".NET 7 is already a reality! Microsoft releases the first Release Candidate of .NET 7",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--vyS_A0CF--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/q9g4ryddmqtlxc13w0mw.png"
        }
      ]
    },
    {
      "title": "小众软件",
      "feedUrl": "https://feeds.appinn.com/appinns",
      "siteUrl": "https://www.appinn.com",
      "articles": [
        {
          "id": "https://www.appinn.com/?p=43468",
          "author": "青小蛙",
          "description": "即刻转‪换是一款功能全面的视频格式、音频格式转换工具，能够非常简单的在几乎所有主流多媒体格式之间转换，支持音轨、字幕，内置多种设备模板，点几下就行了，完全不需要去研究播放格式、视频参数。@Appinn",
          "link": "https://www.appinn.com/video-converter-x2/",
          "publishedOn": "2022-09-26T12:35:17.000Z",
          "wordCount": 2315,
          "title": "即刻转‪换 – 功能全面的视频、音频格式转换软件[macOS]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-26T170141.915.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43457",
          "author": "青小蛙",
          "description": "想必不少朋友都遇到过下面这些问题：拍照的快递单号、电脑窗口里的文字、某些不让复制的网站，怎么才能复制里面的文字？ 其实只需一个 OCR 文字识别工具就可以搞定！ 今天来安利一下白描，一款多平台通用的图",
          "link": "https://www.appinn.com/baimiao-for-windows/",
          "publishedOn": "2022-09-26T06:55:29.000Z",
          "wordCount": 2377,
          "title": "白描终于出 Win 版了！超火的图片转文字工具九月特惠价 18 元起，终生免费更新",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-26T144630.347.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43453",
          "author": "青小蛙",
          "description": "来自问题频道：在 Edge 浏览器里保存图片需要经过三步操作：右键-图像另存为-存储，在需要保存多张图片的时候，操作就会变得很繁琐，有没有一款插件能像 Safari 浏览器一样直接一键保存图片到下载文",
          "link": "https://www.appinn.com/download-image-like-safari/",
          "publishedOn": "2022-09-26T04:33:24.000Z",
          "wordCount": 2320,
          "title": "求右键直接保存图片到下载文件夹的插件，像 Safari 一样保存图片",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/download-image-like-safari.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43449",
          "author": "青小蛙",
          "description": "闪卡 · WinkNotes 是笔记、知识整理、记忆学习的完美组合，iPhone / iPad / Mac 三端支持。作为考研备考、外语学习、专业研究、工作提升或是终生学习者，都可以用闪卡在分秒必争的",
          "link": "https://www.appinn.com/winknotes/",
          "publishedOn": "2022-09-25T10:07:34.000Z",
          "wordCount": 2420,
          "title": "闪卡 · WinkNotes – 独特分栏笔记、知识整理、记忆学习[macOS/iOS]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-25T180220.094.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43445",
          "author": "青小蛙",
          "description": "前几天有同学在寻找「长按【右箭头键 → 】三倍速播放，松开后恢复（类似B站网页端）」的视频播放器（ https://meta.appinn.net/t/topic/36323 ）。 然后大佬们纷纷献计",
          "link": "https://www.appinn.com/potplayer-fast-forward-ahk/",
          "publishedOn": "2022-09-23T10:34:50.000Z",
          "wordCount": 2472,
          "title": "PotPlayer：长按右箭头键实现三倍速播放[AHK]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/PotPlayer-Fast-forward.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43433",
          "author": "青小蛙",
          "description": "Parallels Desktop 18 是一款高性能的 macOS 虚拟机，可以用来在 Mac 电脑上以运行普通程序的方式，运行 Windows、Linux，甚至再运行一个 macOS 系统，方便随",
          "link": "https://www.appinn.com/parallels-desktop-18-coupon-code/",
          "publishedOn": "2022-09-23T05:23:08.000Z",
          "wordCount": 2462,
          "title": "Parallels Desktop 18 最新优惠码，国庆 75 折",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-23T124329.854.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43417",
          "author": "开发者推荐账号",
          "description": "万彩信息开发过很多款与制作动画相关的软件，如果是我的老粉，应该用过不少他们家的软件，比如万彩动画大师、Focusky动画演示大师、万彩微影，等等。这些软件，都有一个非常明显的特点，就是：简单高效，0基",
          "link": "https://www.appinn.com/animiz09/",
          "publishedOn": "2022-09-22T09:10:32.000Z",
          "wordCount": 2314,
          "title": "万彩特效大师(限时送会员) – 0基础轻松剪辑合成特效动画视频，不用AE也能制作特效大片",
          "enclosure": {
            "url": "https://files.animiz.cn/videoclipmaster/home/demo/award-ceremony.mp4",
            "length": "27968081",
            "type": "video/mp4"
          },
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-22T131005.929.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43416",
          "author": "青小蛙",
          "description": "EPUB Manga Creator 是一款可以把一堆漫画图片打包成 EPUB 格式的在线工具。虽然是在线版本，但内容在浏览器本地处理，无上传，所以可以速度很快，开源。@Appinn 故事是这样的，青",
          "link": "https://www.appinn.com/epub-manga-creator/",
          "publishedOn": "2022-09-22T08:35:57.000Z",
          "wordCount": 2366,
          "title": "EPUB Manga Creator – 把漫画图片打包成 EPUB 格式",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-22T160027.839.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43409",
          "author": "青小蛙",
          "description": "Tab Wrangler 是一款专为不愿关闭浏览器标签页用户准备，帮你自动、定时关闭不常用的标签页，以让你的浏览器看起来正常一些，当然还可以节约内存、节省 CPU 资源。另外被关闭的标签页可以轻松找回",
          "link": "https://www.appinn.com/tab-wrangler/",
          "publishedOn": "2022-09-21T09:02:05.000Z",
          "wordCount": 2331,
          "title": "Tab Wrangler – 倒计时，自动关闭不常用的标签页[Chrome/Firefox]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-21T162457.534.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43404",
          "author": "青小蛙",
          "description": "iOS Ref 是一个为 iOS 开发者提供一站式的硬件数据参考网站，比如历代 iPhone、iPad 屏幕分辨率、支持的最低系统、Swift 版本、内存与 CPU 等信息。@Appinn 事情是这样",
          "link": "https://www.appinn.com/ios-ref/",
          "publishedOn": "2022-09-21T03:38:46.000Z",
          "wordCount": 2345,
          "title": "iOS Ref – iOS 开发者一站式系统、硬件数据指南",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-21T113605.261.jpg"
        }
      ]
    },
    {
      "title": "Linux 中国◆开源社区",
      "feedUrl": "https://linux.cn/rss.xml",
      "siteUrl": "https://linux.cn/",
      "articles": [
        {
          "id": "https://linux.cn/article-15077-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "20 年历史的芯片组补丁影响现代 AMD Linux 系统\n\r\nAMD 工程师发现内核中一个有 20 年历史的芯片组补丁仍然被应用于现代 AMD 系统，在特定工作负荷下会影响 Zen 架构处理器的性能。旧代码与 ACPI 处理器空闲代码有关，旨在修复使用 VIA 芯片组的 AMD Athlon 处理器的问题。它不影响英特尔处理器。修复此问题的补丁将在 Linux 6.0 中合并。\n\r\n\r\n消息来源：Phoronix\n\r\n\r\n\r\n老王点评：看来 Linux 内核中的这种遗留问题也不少啊，毕竟作为一个 30 年的项目，已经庞大到很难全面了解的程度了。\n\r\n\r\n\n\r\nOpenAI 开源多语言语音识别系统\n\r\nOpenAI 开源了 Whisper，这是一个自动语音识别系统，该公司声称可以实现多种语言的 “鲁棒” 转录，以及从这些语言翻译成英语。OpenAI 称，Whisper 的与其它的语音识别系统的同之处在于，它是在 68 万小时的多语言和 “多任务” 数据基础上训练出来的，这些数据从网络上收集而来，从而提高了对独特口音、背景噪音和技术术语的识别。\n\r\n\r\n消息来源：Tech Crunch\n\r\n\r\n\r\n老王点评：可能会有更智能的语音助手出现，毕竟这是开源了的。\n\r\n\r\n\n\r\n勒索软件开始摧毁数据而不是加密数据\n\r\n研究人员发现，至少有一个勒索软件团伙正在试验一种新的攻击方式，这种方式不是加密数据，而是直接摧毁数据。其目的是使受害者在不支付赎金的情况下无法获取到他们的数据。摧毁数据比加密数据更简单，也可以避免加密数据被解密，因而致使受害者更容易支付赎金。\n\r\n\r\n消息来源：ZDNet\n\r\n\r\n\r\n老王点评：这要比以前的勒索软件更危险，所以，作为底线，无论如何，勤备份。",
          "link": "https://linux.cn/article-15077-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-27T09:43:31.000Z",
          "wordCount": 480,
          "title": "硬核观察 #772 20 年历史的芯片组补丁影响现代 AMD Linux 系统",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15076-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "UbuntuDDE 22.04 LTS 发布，带有 Linux 内核 5.15、深度应用商店及一些升级。\n\r\n\r\n\n\r\nUbuntuDDE Remix 是一个在 Ubuntu 之上集成深度桌面环境（DDE）的发行版。不想尝试深度发行版但喜欢其用户界面的用户可以尝试一下。\n\r\n它以 Ubuntu 22.04 LTS 为基础，这是一次主要版本升级。\n\r\n让我们看看他们能提供什么。\n\r\nUbuntuDDE Remix 22.04 的新内容\n\r\n他们通过这个发行版为 Ubuntu 添加了许多新东西，例如 “全局搜索栏”、基于 GTK 的应用程序的升级版本、新壁纸、深度应用程序商店等等。\n\r\n让我们看看 UbuntuDDE Remix 22.04 带来的一些关键变化。\n\r\nDDE 全局搜索\n\r\n\n\r\n他们称之为 “DDE 全局搜索”，这是一个快速应用启动器。\n\r\n这使用户能够快速搜索任何内容，无论是应用程序、文件、文件夹，甚至是简单的网络搜索。它由键盘快捷键（Shift + Space）激活。\n\r\nLinux 内核 5.15\n\r\n该发行版还具有 Linux 内核 5.15，它为各种功能打开了大门，例如对英特尔 Alder Lake CPU 的增强支持、对 NTFS3 驱动程序的改进、改进的苹果 M1 支持等等。\n\r\n我们之前介绍了此 Linux 内核版本的亮点，你可以 查看它 以获取更多信息：\n\r\n重新设计的新安装程序\n\r\n\n\r\nUbuntuDDE Remix 上的安装程序似乎从 Qt 安装程序框架 的书中吸取了一些经验，在 Calamares 安装程序中提供了基于 Qt 的样式，并有一个非常熟悉的布局，可以毫不费力地安装发行版的所有常规选项。\n\r\n新壁纸\n\r\n\n\r\n该版本还包括许多新壁纸供你使用。\n\r\n🛠️ 其他变化\n\r\n你可以期待它附带的明显的深度应用程序和好东西。一些值得一提的包括：\n\r\n\r\n预装深度应用商店\n\r\nLibreOffice 7.3.6.2\n\r\n通过 OTA 更新定期进行软件更新\n\r\n包含升级的基于 DTK 的应用程序，如深度音乐、深度终端、Boot Maker、系统监视器等\n\r\n\r\n下载 UbuntuDDE 混音 22.04\n\r\n你可以前往官方 下载页面下载 UbuntuDDE Remix 22.04 的 ISO 文件。\n\r\n\r\nUbuntuDDE Remix 22.04\n\r\n\r\n如果你正在寻找一个现场 USB 创建工具来安装 UbuntuDDE Remix，请阅读本指南以轻松创建一个：\n\r\n\r\n在 Linux 上使用 Rufus？这是一些最好的现场 USB 创建工具\n\r\n\r\n请注意，它不是 Ubuntu 的官方版本（因此是 “Remix”），但可以马上尝试深度桌面看起来很令人兴奋。\n\r\n💬 你怎么看？你想在 Ubuntu 上体验深度桌面吗？\n\r\n\r\nvia: https://news.itsfoss.com/ubuntudde-remix-22-04-released/\n\r\n作者：Sourav Rudra 选题：lkxed 译者：littlebirdnest 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15076-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-27T07:45:08.000Z",
          "wordCount": 563,
          "title": "UbuntuDDE Remix 22.04 LTS 发布！",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15075-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "如今，Mac 应用商店正在售卖 LibreOffice。难道它不是免费的吗？我们来了解一下个中缘由。\n\r\n\r\n\n\r\nLibreOffice 是一个自由、开源、跨平台的办公套件。\n\r\n所以它一直是 微软 Office 的最佳免费替代品。\n\r\n如果事实的确如此, 我现在怎么会在这里讨论 LibreOffice 的购买呢？\n\r\n文档基金会计划向市场推出这个项目以筹集资金，\n\r\n如今文档基金会正在努力改进营销策略，鼓励人们支持 LibreOffice 的发展。\n\r\n当然，发布企业版是他们能做到的最好方式之一。\n\r\n但是，能否通过提供相似的服务，把这种机会扩展到终端用户呢？\n\r\n最方便的办法 是像 Mac 应用商店那样，通过专有渠道销售 LibreOffice。\n\r\n最近，文档基金会 宣布 在 Mac 应用商店销售 LibreOffice；他们是这么说的：\n\r\n\r\n跟以前的情况相比，文档基金会在 Mac 应用商店发布软件的举措是一次变革，这是一种新的市场策略：文档基金会专注于社区版的发布，而属于相关生态系统的公司专注于针对企业用户的、长期提供支持服务以及能够带来价值增值的版本。\n\r\n\r\n很多用户信赖并依靠的是自己平台的官方应用商店。因此，在他们的官方应用商店销售 LibreOffice 能起到方便用户的作用。你可以自动将 LibreOffice 更新为最新版本，而无需每次更新时下载相应的版本。\n\r\n\n\r\n为了享受从 Mac 应用商店下载 LibreOffice 的便利，你需要一次性付费购买。\n\r\n它在 Mac 应用商店的卖价是 8.99 美元。\n\r\n\r\n你仍然可以在 LibreOffice 网站 上免费下载 Mac 版 LibreOffice。\n\r\n\r\nMac 应用商店不是已经可以下载了吗？\n\r\n\n\r\n嗯，是，也不是。\n\r\nCollabora Office（基于 LibreOffice 的企业版）在 Mac 应用商店售价是 8.99 美元。\n\r\n它基于 LibreOffice，并不完全是 LibreOffice 的社区版本。所以现在，文档基金会在 Mac 应用商店推出了社区版。\n\r\n他们也在告示中提到：\n\r\n\r\n“我们感谢 Collabora 公司长期以来在 Mac 应用商店对 LibreOffice 的支持”\n\r\n- Italo Vignoli，LibreOffice 市场营销团队\n\r\n\r\n（LCTT 校注：也就是说，文档基金会在 Mac 应用商店推出的 LibreOffice 是无商业支持的社区版，和具有商业支持的、基于企业版定制的 Collabora Office 的售价一样。因此，这种行为可看作是文档基金会的某种自愿募捐方式 —— 如果不愿意捐助，你可以继续下载免费版本。）\n\r\n这笔费用对 LibreOffice 有何帮助？\n\r\n截至目前，LibreOffice 已成为一个大型开源项目。很多 Linux 发行版中默认自带 LibreOffice，这并不奇怪，一些教育机构也决定使用 LibreOffice，从而取代微软 Office。\n\r\n当然，它可能在某种意义上并不完美。但是它正在不断取得进步，能满足用户关于文档、表格或演示文稿方面的基本功能。\n\r\n所以，收取的费用将用于项目的支持工作，可以覆盖项目的维护成本和远期用于支付贡献者和文档基金会工作人员的相关费用。\n\r\n微软应用商店也会推出 LibreOffice 吗？\n\r\n\n\r\n微软应用商店现在并不直接提供 LibreOffice。\n\r\n在微软应用商店，你可以以 14.99 美元的价格购买 Collabora Office。但是，文档基金会还没有发布官方的社区版。\n\r\n还有 Allo Office，以前被称为 LibreOffice Vanilla。\n\r\n也许在它登陆 Mac 应用商店之后，他们可能会把它引入微软商店。\n\r\n💬 对于在 Mac 应用商店购买 LibreOffice，你怎么看？\n\r\n\r\nvia: https://news.itsfoss.com/libreoffice-mac-os-store/\n\r\n作者：Ankush Das 选题：lkxed 译者：cool-summer-021 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15075-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-27T07:15:00.000Z",
          "wordCount": 576,
          "title": "为什么 LibreOffice 在 Mac 应用商店卖 8.99 美元？",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15074-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "谷歌老板对员工说，不要把乐趣和金钱等同起来\n\r\n谷歌员工在一次内部会议上问，为什么这家巨型公司在去年创纪录的利润之后，通过削减旅行预算和福利来“压榨员工”。谷歌 CEO 皮查伊回应称，“我记得谷歌很小的时候，也很潦倒。……我们不应该总是将乐趣等同于金钱。我认为，在一家努力工作的创业公司，人们可能正在享受乐趣……”。员工们还询问了高管薪酬问题，据说皮查伊没有回答。他的身价估计超过 10 亿美元，去年获得了 630 万美元的报酬。\n\r\n\r\n消息来源：CNBC\n\r\n\r\n\r\n老王点评：虽然说确实如此，但是亿万富翁的这种回答总是让人觉得不太满意。\n\r\n\r\n\n\r\nMozilla 重申会继续支持 WebRequst API\n\r\n目前的 Chromium 扩展大多使用 MV2，谷歌将从明年开始采用新的扩展规范 MV3，限制现在使用的 MV2 的 WebRequest API 的功能。采用旧的 API 的扩展将从明年 1 月开始不被列出，之后，将被禁用。uBlock Origin 等广告屏蔽扩展使用 WebRequest API 在广告下载前屏蔽其请求，在禁用该 API 后，用户体验将受到影响，比如出现闪烁。Mozilla 上周重申，它将支持 MV3，但同时也会继续支持 V2 的 WebRequst API。\n\r\n\r\n消息来源：ghacks\n\r\n\r\n\r\n老王点评：这就是浏览器垄断的行为，无论你愿意不愿意。这次我觉得 Mozilla 做的挺好，至少给用户以选择权。\n\r\n\r\n\n\r\n几乎一半的工业机器人都在中国\n\r\n根据国际机器人联合会（IFR）的一份新报告，中国现在几乎拥有世界上所有机器人装置的一半，而且它的领先优势正在迅速增加。2021 年的安装量达到了 243,300 台的新纪录，与前一年相比，增长了 44%。中国从 10 年前每万名员工拥有 10 个工业机器人，到 2020 年每万名员工拥有 246 个，在世界排名中名列第九。\n\r\n\r\n消息来源：IFR\n\r\n\r\n\r\n老王点评：虽然至少人均排名第九，但是这么大的总量，依然非常可观。",
          "link": "https://linux.cn/article-15074-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-26T08:56:30.000Z",
          "wordCount": 484,
          "title": "硬核观察 #771 谷歌老板对员工说，不要把乐趣和金钱等同起来",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15073-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "将 Linux Mint 与 Windows 11（或 Windows 10）同时安装并制作双引导系统的完整指南。\n\r\n\r\n如果你是新 Linux 用户，想在不删除 OEM 安装的 Windows 的情况下安装 Linux Mint，请遵循本指南。完成下面描述的步骤后，你应该拥有一个双引导系统，你可以在其中学习和在 Linux 系统中完成工作，而无需引导 Windows。\n\r\n1、开始之前你需要什么？\n\r\n启动到你的 Windows 系统并从官方网站下载 Linux Mint ISO 文件。 ISO 文件是 Linux Mint 的安装镜像，我们将在本指南中使用它。\n\r\n在官网（图1），下载 Cinnamon 桌面版的 ISO（适合所有人）。\n\r\n\r\n下载链接\n\r\n\r\n\n\r\n下载后，将 U 盘插入你的系统。然后使用 Rufus 或 Etcher 将上面下载的 .ISO 文件写入该 USB 驱动器。\n\r\n2、准备一个分区来安装 Linux Mint\n\r\n正常情况下，Windows 笔记本电脑通常配备 C 盘和 D 盘。C 盘是安装 Windows 的地方。对于新的笔记本电脑，D 驱动器通常是空的（任何后续驱动器，如 E 等）。现在，你有两个选项可供选择：一是 缩小 C 盘 为额外的 Linux 安装腾出空间。第二个是使用其他驱动器/分区，例如 D 盘或 E盘。\n\r\n选择你希望的方法。\n\r\n如果你选择使用 D 盘或 E 盘用于 Linux 系统，请确保先禁用 BitLocker，然后再禁用现代 OEM 安装的 Windows 笔记本电脑附带的所有其他功能。\n\r\n\r\n从开始菜单打开 Windows PowerShell 并键入以下命令（图 2）以禁用 BitLocker。根据你的目标驱动程序更改驱动器号（这里，我使用了驱动器 E）。\n\r\n\r\nmanage-bde -off E\r\n…",
          "link": "https://linux.cn/article-15073-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-26T03:52:24.000Z",
          "wordCount": 744,
          "title": "使用 Windows 11 双引导安装 Linux Mint",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15072-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "美国的《保护开源软件法案》将责成管理和预算办公室提供有关如何安全使用开源软件的说明。\n\r\n\r\n美国立法者周四提出了一项要求，美国网络安全和基础设施安全局（CISA）需创建风险框架以提高开源软件安全性的措施。为了降低依赖开源代码的系统风险，各机构将利用该框架，CISA 将决定关键基础设施所有者和运营商是否也可以自愿使用它。\n\r\n大多数系统依赖于免费提供的并由社区维护的开源软件来构建网站和应用程序；最大的用户之一是美国联邦政府。该立法由美国国土安全委员会主席兼高级成员、俄亥俄州共和党参议员 Sens. Rob Portman、R-Ohio 和 Gary Peters D-Mich 在一次听证会后提出，以回应在开源代码中发现的影响美国联邦系统和全球数百万其他系统的严重、广泛的 Log4j 漏洞。\n\r\n“这一事件对联邦系统和关键基础设施公司——包括银行、医院和公用事业公司——构成了严重威胁，美国人每天都依赖这些公司提供基本服务，”彼得斯在公告中说。“这项明智的两党立法将有助于保护开源软件，并进一步加强我们的网络安全防御，防止网络犯罪分子和外国对手对全国网络发起的不断的攻击。”\n\r\n这项《保护开源软件法》还要求美国管理和预算办公室为各机构发布关于保护开源软件的指南，在 CISA 网络安全咨询委员会中设立一个软件安全小组委员会，并要求 CISA 聘请开源软件专家协助处理网络事件。\n\r\n在此之前，Peters 和 Portman 的提议已获得美国参议院一致通过并签署成为法律，以加强州和地方政府的网络防御，并迫使关键基础设施的所有者和运营商向 CISA 报告重大网络攻击和勒索软件付款。\n\r\n\r\nvia: https://www.opensourceforu.com/2022/09/lawmakers-proposes-a-new-bill-to-protect-open-source-software/\n\r\n作者：Laveesh Kocher 选题：lkxed 译者：littlebirdnest 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15072-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-26T02:41:27.000Z",
          "wordCount": 460,
          "title": "美国立法者提出一项保护开源软件的新法案",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15071-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "对 GNOME 43 桌面环境的各种功能的介绍，以及它给你的日常需求和工作流程带来的变化和影响。\n\r\n\r\n\n\r\n这篇文章总结了所有关于 GNOME 43 的必要信息，包括功能、发布时间表等等。GNOME 43 版本可能是自 GNOME 40 以来在功能和对你的工作流程影响最大的一个版本。\n\r\n主要的变化包括更新的 Shell 和更快的性能，内含了 GTK4 和 libadwaita 的转换，翻新的文件应用和 Web 应用的奇妙变化。\n\r\n所有这些必要的变化都是早该进行的，并将改变你在 GNOME 桌面上的传统工作流程，使你的工作效率更高。\n\r\n时间表\n\r\nGNOME 43 于 2022 年 9 月 21 日 正式发布。\n\r\n\r\nGNOME 43 测试版：2022 年 8 月 31 日\n\r\nGNOME 43 候选版：2022 年 9 月 4 日\n\r\nGNOME 43 最终版：2022 年 9 月 21 日\n\r\n\r\nGNOME 43 的功能\n\r\n1、核心 Shell 的变化\n\r\n\r\n终于，得益于 Wayland 最近的工作，GNOME 有了对高分辨率的滚轮支持。所以，如果你有一个高分辨率的显示器，用一个高级的鼠标（比如罗技 MX Master 3）来滚动应该成为了一种享受。\n\r\n除了上述情况，GNOME 43 中的直接扫描输出direct scanout 支持将有助于多显示器环境。\n\r\n服务器端的窗口装饰得到了基本的颜色支持。\n\r\nShell 还实现了一个功能，当焦点改变时，通知会消失，并不等待超时。\n\r\n和每个版本一样，你在整个桌面上会体验到更好的动画性能，改进了网格和概览导航以及关键的更新，这给你带来了顺滑的体验。\n\r\n\r\n这些就是核心变化的关键总结。现在，让我们来谈谈快速设置。\n\r\n2、新的快速设置菜单\n\r\n系统托盘中的快速设置完全改变了。快速设置项目和菜单现在采用药丸状…",
          "link": "https://linux.cn/article-15071-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-25T15:00:42.000Z",
          "wordCount": 695,
          "title": "GNOME 43 发布，标志性的版本",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15070-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "AI 生成的漫画获得版权注册\n\r\nMidjourney 是一个商业的图片合成服务。一位艺术家使用 Midjourney 创造了一本名为《黎明的扎丽亚》的漫画书，已经获得了美国版权注册。该作品是 AI 辅助的，而不是完全由 AI 创造的。艺术家编写了漫画故事，创造了版面，并做出了艺术选择，将图像拼接在一起。这本漫画书可以免费下载。\n\r\n\r\n消息来源：ARS Technica\n\r\n\r\n\r\n老王点评：即便 AI 还不能独立完成创作，也不能以 AI 身份取得版权和专利，但是 AI 辅助创作必然会越来越用在各种艺术创作中，而且可能会毫不逊色。很可能，以后你创作时，只是提供一些素材、提示词，然后去喝杯咖啡，等着从 AI 生成的结果中挑选一二。\n\r\n\r\n\n\r\n黑客利用 BGP 劫持 IP 段窃取了约 23 万美元加密货币\n\r\n8 月 17 日，英国一家不知名的网络运营商 Quickhost.uk 突然通过 BGP 广播宣布，隶属于亚马逊 AS16509 的一个 IP 段需要路由经过它的网络 AS20943。该 IP 段中的一个地址被用于托管加密货币交易所 Celer Bridge 的一个子域名。并且，攻击者还从某不知名的 CA 获得了一个 TLS 证书，然后托管了伪造的子域名网站，随后从访问该域名的 32 个账号中窃取了约 23 万美元的加密货币。这一 BGP 劫持持续了 3 个多小时后，亚马逊恢复了对该地址段的控制。\n\r\n\r\n消息来源：ARS Technica\n\r\n\r\n\r\n老王点评：无论是错误配置还是恶意欺诈，BGP 的脆弱性显露无疑。虽然也有一些补救措施，但是并没有根本上解决 BGP 安全问题，这是一个全行业的问题。\n\r\n\r\n\n\r\nGNOME 43 发布\n\r\n前两天，GNOME 43 发布了正式版本。它引入了一个重新设计的快速系统设置区域，一个新的 “设备安全” 管理区域，GNOME 文件管理器的各种改进，增强了 Mutter 合成器以更好地支持 Wayland，更多的应用程序已经从 GTK3 移植到 GTK4，以及整个桌面栈的许多其他变化。\n\r\n\r\n消息来源：GNOME\n\r\n\r\n\r\n老王点评：GNOME 和 KDE 作为 Linux 上最主要的两大桌面环境，虽然给人的感觉不是惊艳，但是却稳健的不断在改进。",
          "link": "https://linux.cn/article-15070-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-25T07:10:28.000Z",
          "wordCount": 511,
          "title": "硬核观察 #770 AI 生成的漫画获得版权注册",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15069-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Redox OS 刚刚获得了大量匿名捐款。它将用于什么？令人兴奋的事情！\n\r\n\r\n\n\r\nRedox OS 是一个用 Rust 编写的类 Unix 操作系统。\n\r\n该项目由 Jeremy Soller 于 2015 年发起，他被公认为 System76 的首席工程师及Pop!_OS 的维护者。\n\r\n我们还介绍了它今年早些时候的最后一个版本：基于 Rust 的 Redox OS 0.7.0 推出增强硬件支持。\n\r\n虽然这些更新包括的改进可以让它在更多硬件上启动，但它可能不是大多数用户的日常驱动程序的替代品。\n\r\n然而，这是一个令人兴奋的项目，值得关注。\n\r\n而在收到匿名捐款后，事情变得更加精彩。\n\r\n🤯 刚刚有人向 Redox OS 的捐赠地址发送了 299 个以太坊，相当于近 39 万美元（加密货币市场涨跌不定）。\n\r\n嗯，那是一大笔钱！\n\r\n根据 Jeremy 的最新推文，他还没有立即决定如何处理它。\n\r\n\r\n一位匿名捐赠者刚刚向 @redox_os 捐赠地址发送了 299 以太（相当于 393,000 美元） 。这个地址和交易都是公开的。我不知道如何处理这种规模的捐赠，但在进行一些研究后很快就会有更多细节。https://t.co/f3yBDghWSh\n\r\n\r\n但是，对推文的回复给了我们一些很好的建议。\n\r\n一些人建议将其捐赠给负责 Rust 语言的人，还有一些人建议用这笔钱来赞助学习 Rust 和 OS 开发。\n\r\n他肯定可以使用它来扩展 Redox OS 或其他任何需要该资源的东西。\n\r\n归根结底，对于想要更多基于 Rust 的东西的人来说，无论 Jeremy 选择做什么，这都可能间接成为一件好事。\n\r\n或者，也许买一辆带有 Redox OS 标志的布加迪？好吧，一些推特用户对这一事件有过搞笑的回复！😂\n\r\n\r\n这不是开源项目第一次收到大量的加密货币捐赠。Apache 软件基金会在 2018 年收到了价值 100 万美元的比特币。\n\r\n\r\n当 Jeremy 决定分享有关捐赠的更多细节以及他打算如何处理时，我将更新这篇文章。\n\r\n💬 你如何看待匿名捐赠给 Redox OS？如果你得到那笔捐款，你会怎么做？在下面的评论框中让我们知道你的想法。\n\r\n\r\nvia: https://news.itsfoss.com/redox-os-anonymous-donation/\n\r\n作者：Ankush Das 选题：lkxed 译者：littlebirdnest 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15069-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-25T03:04:00.000Z",
          "wordCount": 532,
          "title": "哇！基于 Rust 的 Redox OS 获得 390,000 美元的加密货币匿名捐赠",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15068-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "微软的 WSL 现已支持 systemd，为用户提供了更好的体验。你可阅读此文了解更多。\n\r\n\r\n\n\r\nWSL（Windows 的 Linux 子系统Windows Subsystem for Linux）终于拥有了对 systemd 的支持，这是在 systemd 的创建者加入微软的几个月后实现的。\n\r\n\r\n更多 Linux 开发者们加入微软，systemd 的创建者也加入这一行列\n\r\n\r\n而这已通过微软和 Cannonical 的合作成为可能。\n\r\n\r\n如果你好奇 systemd 是什么：\n\r\nsystemd 是一套 Linux 系统的基本组成模块。它提供了一个系统和服务管理器，作为 PID 1 运行，并启动系统的其他部分。\n\r\n来自：systemd.io\n\r\n\r\n它作为一个初始化系统，启动并维持用户空间其他服务的正常运行。\n\r\n让我们看看它是如何被引入 WSL 的。\n\r\nsystemd 增强 WSL 的体验\n\r\n\r\n\n\r\n在 WSL 中引入 systemd，主要是为改善 Windows 机器上的 Linux 工作流程。\n\r\n像 Debian、Ubuntu、Fedora 等，都是默认运行 systemd 的。因此，这项整合将使这些发行版的用户更方便地在 WSL 上做更多工作。\n\r\n很多关键的 Linux 程序也是靠 systemd 实现的。例如 snap、microk8s 和 LXD 都依赖它。\n\r\n即使我们有 不含 systemd 的发行版 可用，它们也并不适合所有人。因此，在 WSL 上添加对 systemd 的支持是很有意义的。\n\r\nsystemd 的存在也使得在 Windows 中使用更多工具来测试和运行成为可能，从而带来更好的 WSL 体验。\n\r\n它是如何实现的\n\r\nWSL 背后的团队必须修改其架构，它们让 WSL 的初始化进程在 Linux 发行版中以 systemd 的一个子进程启动。\n\r\n正如其 官方公告 所述，这样做使得 WSL 初始化程序能够为 Windows 和 Linux 子系统之间的通讯提供必要的基础。\n\r\n它们还做了额外的修改，通过防止 systemd 保持 WSL 实例的活动以确保系统的干净关机。\n\r\n你亦可访问他们的 官方文档 以了解更多。\n\r\n在 WSL 上使用 systemd\n\r\n\r\n现有的 WSL 用户必须在他们的系统上手动启用 systemd，以防止由于 systemd 的引入而导致的启动问题。\n\r\n\r\n首先，你必须确保你的系统运行的是 0.67.6 或更高版本的 WSL。\n\r\n你可以通过以下命令检查你的 WSL 版本。\n\r\nwsl --version\r\n\n\r\n如果你正在运行旧版本，你可以通过 微软应用商店Microsoft Store 或者以下命令更新它。\n\r\nwsl --update\r\n\n\r\n此外，如果你不是 Windows 预览体验成员Windows Insider，你可以到 WSL 发行页面 下载它来体验。\n\r\n为了让 systemd 在你的系统上运行，你需要修改 wsl.conf 这个文件以确保 systemd 在启动时运行。\n\r\n在 wsl.conf 添加以下几行以使 WSL 在启动时运行 systemd\n\r\n[boot]\r\nsystemd=true\r\n\n\r\n最后，重启你的 WSL 实例以见证更改。\n\r\n随着对 systemd 的支持，微软在 WSL 的发展又前进了一大步，这将使得 WSL 吸引更多用户。\n\r\n💬 是否对 WSL 支持 systemd 感到兴奋？或是你更喜欢无 systemd 的发行版？\n\r\n\r\nvia: https://news.itsfoss.com/systemd-wsl/\n\r\n作者：Sourav Rudra 选题：lkxed 译者：vvvbbbcz 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15068-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-25T02:30:49.000Z",
          "wordCount": 609,
          "title": "systemd 已可用于 WSL",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15067-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "本快速指南介绍了在 Arch Linux 和其他发行版中使用终端设置和连接 WiFi 所需的步骤。\n\r\n\r\n本指南非常适合没有 GUI 只有终端且没有其他有线互联网连接可用的情况。这些步骤可帮助你手动检测无线网卡和设备，并通过终端密码验证连接到 WiFi 热点。\n\r\n本指南使用 iwd（Net Wireless Daemon）通过终端连接到 WiFi。\n\r\n在 Arch Linux 和其他发行版中使用终端连接到 WiFi\n\r\n1、设置 iwd\n\r\niwd 包有三个主要模块：\n\r\n\r\niwctl：无线客户端\n\r\niwd：守护进程\n\r\niwmon：监控工具\n\r\n\r\n在终端中输入：\n\r\niwctl\r\n\n\r\n\n\r\n如果找不到该命令，那么需要从 此处 下载安装包。\n\r\n从任何其他具有互联网连接的系统/笔记本电脑获取帮助，以通过安装 USB 下载和安装软件包。\n\r\n或者，如果你有一个可连接互联网的 USB 网卡，那么将其插入你的系统。并通过以下命令安装。\n\r\nUSB 网卡应该可以在 Arch 和当今大多数 Linux 系统中开箱即用，连接到互联网。\n\r\nArch：\n\r\npacman -S iwd\r\n\n\r\nDebian、Ubuntu 和其他类似发行版：\n\r\nsudo apt-get install iwd\r\n\n\r\nFedora：\n\r\nsudo dnf install iwd\r\n\n\r\n如果你看到了 iwctl 提示符（如下所示），那么继续下一步。\n\r\n2、配置\n\r\n运行以下命令以获取系统的无线设备名称。\n\r\ndevice list\r\n\n\r\n\n\r\n要获取 WiFi 网络列表，请运行以下命令。在以下命令和所有其他命令中将 wlan0 替换为你的设备名称。\n\r\nstation wlan0 get-networks\r\n\n\r\n\n\r\n该命令为你提供具有安全类型和信号强度的可用 WiFi 网络列表。\n\r\n3、连接\n\r\n要连接到 WiFi 网络，请使用上述 get-networks 命令中的 WiFi 接入点名称运行以下命令。\n\r\nstation wlan0 connect\r\n\n\r\n出现提示时输入你的 WiFi 密码。\n\r\n\n\r\n如果一切顺利，你现在可以连接到互联网。\n\r\n使用指南\n\r\n如下所示，你可以使用简单的 ping 命令检查连接。ping 回复成功的数据包传输表示连接稳定。\n\r\nping -c 3 google.com\r\n\n\r\n你还可以使用以下命令检查连接状态。\n\r\nstation wlan0 show\r\n\n\r\niwd 在 /var/lib/iwd 中保存 .psk 后缀的配置文件，其中带有你的接入点名称。此文件包含使用你的 WiFi 网络的密码和 SSID 生成的哈希文件。\n\r\n按 CTRL+D 退出 iwctl 提示符。\n\r\n总结\n\r\n我希望本指南可以帮助你通过终端连接到互联网。当你没有其他方式连接到 WiFi 时，这会有所帮助。例如，如果你在独立系统（不是 VM）中安装 Arch Linux，那么需要连接到互联网以通过终端使用 pacman 下载软件包。\n\r\n如果你遇到任何问题，请在下面的评论栏中指出错误消息。\n\r\n\r\nvia: https://www.debugpoint.com/connect-wifi-terminal-linux/\n\r\n作者：Arindam 选题：lkxed 译者：geekpi 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15067-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-24T10:51:48.000Z",
          "wordCount": 571,
          "title": "在 Arch Linux 和其他发行版中使用终端连接到 WiFi",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "先知安全技术社区",
      "feedUrl": "https://xz.aliyun.com/feed",
      "siteUrl": "https://xz.aliyun.com/forum/",
      "articles": [
        {
          "id": "https://xz.aliyun.com/t/11727",
          "author": null,
          "description": "某json 1.2.80 漏洞分析",
          "link": "https://xz.aliyun.com/t/11727",
          "publishedOn": "2022-09-27T08:40:47.000Z",
          "wordCount": 471,
          "title": "某json 1.2.80 漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11728",
          "author": null,
          "description": "关于HTTP Request Smuggling（HTTP请求夹带）的二三事",
          "link": "https://xz.aliyun.com/t/11728",
          "publishedOn": "2022-09-27T06:39:49.000Z",
          "wordCount": 1369,
          "title": "关于HTTP Request Smuggling（HTTP请求夹带）的二三事",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11721",
          "author": null,
          "description": "某开源堡垒机历史漏洞分析",
          "link": "https://xz.aliyun.com/t/11721",
          "publishedOn": "2022-09-22T15:55:37.000Z",
          "wordCount": null,
          "title": "某开源堡垒机历史漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11723",
          "author": null,
          "description": "CVE-2022-33980命令执行漏洞分析",
          "link": "https://xz.aliyun.com/t/11723",
          "publishedOn": "2022-09-21T15:54:31.000Z",
          "wordCount": null,
          "title": "CVE-2022-33980命令执行漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11729",
          "author": null,
          "description": "从前端代码审计挖掘未授权进入后台到文件上传拿下某色情网站",
          "link": "https://xz.aliyun.com/t/11729",
          "publishedOn": "2022-09-21T15:52:28.000Z",
          "wordCount": null,
          "title": "从前端代码审计挖掘未授权进入后台到文件上传拿下某色情网站",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11711",
          "author": null,
          "description": "Dll劫持注入从原理到白加黑漏洞利用",
          "link": "https://xz.aliyun.com/t/11711",
          "publishedOn": "2022-09-21T15:51:59.000Z",
          "wordCount": null,
          "title": "Dll劫持注入从原理到白加黑漏洞利用",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11720",
          "author": null,
          "description": "对writeObject流程动点手脚",
          "link": "https://xz.aliyun.com/t/11720",
          "publishedOn": "2022-09-20T15:59:24.000Z",
          "wordCount": null,
          "title": "对writeObject流程动点手脚",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11716",
          "author": null,
          "description": "关于\"linux capability\"的两个特殊案例",
          "link": "https://xz.aliyun.com/t/11716",
          "publishedOn": "2022-09-20T15:57:55.000Z",
          "wordCount": null,
          "title": "关于\"linux capability\"的两个特殊案例",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11722",
          "author": null,
          "description": "GenieACS CVE-2021-46704认证前RCE漏洞分析",
          "link": "https://xz.aliyun.com/t/11722",
          "publishedOn": "2022-09-20T15:54:08.000Z",
          "wordCount": null,
          "title": "GenieACS CVE-2021-46704认证前RCE漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11701",
          "author": null,
          "description": "goby指纹提取与yara逆向.md",
          "link": "https://xz.aliyun.com/t/11701",
          "publishedOn": "2022-09-19T15:55:27.000Z",
          "wordCount": null,
          "title": "goby指纹提取与yara逆向.md",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11714",
          "author": null,
          "description": "记一次较为详细的某CMS代码审计",
          "link": "https://xz.aliyun.com/t/11714",
          "publishedOn": "2022-09-19T15:53:01.000Z",
          "wordCount": null,
          "title": "记一次较为详细的某CMS代码审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11705",
          "author": null,
          "description": "一些BAT的XSS实例（四）高级篇",
          "link": "https://xz.aliyun.com/t/11705",
          "publishedOn": "2022-09-16T02:40:54.000Z",
          "wordCount": null,
          "title": "一些BAT的XSS实例（四）高级篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11697",
          "author": null,
          "description": "利用ASP.NET Web API Help Page文件上传",
          "link": "https://xz.aliyun.com/t/11697",
          "publishedOn": "2022-09-16T02:35:20.000Z",
          "wordCount": 546,
          "title": "利用ASP.NET Web API Help Page文件上传",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11673",
          "author": null,
          "description": "基于netfilter的rootkit",
          "link": "https://xz.aliyun.com/t/11673",
          "publishedOn": "2022-09-16T02:33:43.000Z",
          "wordCount": 645,
          "title": "基于netfilter的rootkit",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11699",
          "author": null,
          "description": "不常见的内存与流量取证 -- WMCTF 2022 1!5!",
          "link": "https://xz.aliyun.com/t/11699",
          "publishedOn": "2022-09-15T15:45:49.000Z",
          "wordCount": null,
          "title": "不常见的内存与流量取证 -- WMCTF 2022 1!5!",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11674",
          "author": null,
          "description": "CVE-2020-8558-跨主机访问127.0.0.1",
          "link": "https://xz.aliyun.com/t/11674",
          "publishedOn": "2022-09-15T15:41:29.000Z",
          "wordCount": null,
          "title": "CVE-2020-8558-跨主机访问127.0.0.1",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11676",
          "author": null,
          "description": "红日安全团队ATT&CK(二)实战系列靶场",
          "link": "https://xz.aliyun.com/t/11676",
          "publishedOn": "2022-09-15T15:40:07.000Z",
          "wordCount": null,
          "title": "红日安全团队ATT&CK(二)实战系列靶场",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11656",
          "author": null,
          "description": "“黑猫”又伸出恶魔之手？揭秘BlackCat病毒的三重勒索",
          "link": "https://xz.aliyun.com/t/11656",
          "publishedOn": "2022-09-15T15:39:00.000Z",
          "wordCount": null,
          "title": "“黑猫”又伸出恶魔之手？揭秘BlackCat病毒的三重勒索",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11703",
          "author": null,
          "description": "CVE-2022-1292的分析",
          "link": "https://xz.aliyun.com/t/11703",
          "publishedOn": "2022-09-14T13:40:35.000Z",
          "wordCount": null,
          "title": "CVE-2022-1292的分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11690",
          "author": null,
          "description": "Gitlab常见漏洞复现及后利用",
          "link": "https://xz.aliyun.com/t/11690",
          "publishedOn": "2022-09-14T13:39:16.000Z",
          "wordCount": null,
          "title": "Gitlab常见漏洞复现及后利用",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11695",
          "author": null,
          "description": "从mcms历史漏洞中捡漏",
          "link": "https://xz.aliyun.com/t/11695",
          "publishedOn": "2022-09-13T11:53:55.000Z",
          "wordCount": null,
          "title": "从mcms历史漏洞中捡漏",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11688",
          "author": null,
          "description": "2022 网鼎杯玄武组-you can find it 题解—Spring通用MemShell改造",
          "link": "https://xz.aliyun.com/t/11688",
          "publishedOn": "2022-09-13T11:52:20.000Z",
          "wordCount": null,
          "title": "2022 网鼎杯玄武组-you can find it 题解—Spring通用MemShell改造",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11669",
          "author": null,
          "description": "某后台管理系统的审计",
          "link": "https://xz.aliyun.com/t/11669",
          "publishedOn": "2022-09-09T15:56:45.000Z",
          "wordCount": null,
          "title": "某后台管理系统的审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11684",
          "author": null,
          "description": "关于那WebSocket劫持的二三事",
          "link": "https://xz.aliyun.com/t/11684",
          "publishedOn": "2022-09-08T15:55:34.000Z",
          "wordCount": null,
          "title": "关于那WebSocket劫持的二三事",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11682",
          "author": null,
          "description": "一些BAT的XSS实例（三）中级篇",
          "link": "https://xz.aliyun.com/t/11682",
          "publishedOn": "2022-09-07T15:54:00.000Z",
          "wordCount": null,
          "title": "一些BAT的XSS实例（三）中级篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11659",
          "author": null,
          "description": "红队开发基础-基础免杀(四)",
          "link": "https://xz.aliyun.com/t/11659",
          "publishedOn": "2022-09-06T15:55:00.000Z",
          "wordCount": null,
          "title": "红队开发基础-基础免杀(四)",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11653",
          "author": null,
          "description": "揭开新型窃密软件的面纱：伪装成CDR画图应用安装包",
          "link": "https://xz.aliyun.com/t/11653",
          "publishedOn": "2022-09-06T15:54:00.000Z",
          "wordCount": null,
          "title": "揭开新型窃密软件的面纱：伪装成CDR画图应用安装包",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11664",
          "author": null,
          "description": "Linux提权基础分享和讨论",
          "link": "https://xz.aliyun.com/t/11664",
          "publishedOn": "2022-09-06T15:53:35.000Z",
          "wordCount": null,
          "title": "Linux提权基础分享和讨论",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11671",
          "author": null,
          "description": "CVE-2020-28413 MantisBT SQL注入漏洞分析",
          "link": "https://xz.aliyun.com/t/11671",
          "publishedOn": "2022-09-05T15:55:21.000Z",
          "wordCount": null,
          "title": "CVE-2020-28413 MantisBT SQL注入漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11681",
          "author": null,
          "description": "一些BAT的XSS实例（二）进阶篇",
          "link": "https://xz.aliyun.com/t/11681",
          "publishedOn": "2022-09-05T15:54:50.000Z",
          "wordCount": null,
          "title": "一些BAT的XSS实例（二）进阶篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11672",
          "author": null,
          "description": "JAVA常用框架SQL注入审计",
          "link": "https://xz.aliyun.com/t/11672",
          "publishedOn": "2022-09-05T15:54:25.000Z",
          "wordCount": null,
          "title": "JAVA常用框架SQL注入审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11677",
          "author": null,
          "description": "一些BAT的XSS实例（一）基础篇",
          "link": "https://xz.aliyun.com/t/11677",
          "publishedOn": "2022-09-01T09:00:03.000Z",
          "wordCount": null,
          "title": "一些BAT的XSS实例（一）基础篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11662",
          "author": null,
          "description": "利用Nginx、Tyk Gateway API和CloudFlare防火墙隐藏C2设施",
          "link": "https://xz.aliyun.com/t/11662",
          "publishedOn": "2022-08-31T14:55:35.000Z",
          "wordCount": null,
          "title": "利用Nginx、Tyk Gateway API和CloudFlare防火墙隐藏C2设施",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11667",
          "author": null,
          "description": "域内批量获取敏感文件",
          "link": "https://xz.aliyun.com/t/11667",
          "publishedOn": "2022-08-31T14:54:03.000Z",
          "wordCount": null,
          "title": "域内批量获取敏感文件",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11660",
          "author": null,
          "description": "CVE-2022-31197 PostgreSQL JDBC SQL注入分析",
          "link": "https://xz.aliyun.com/t/11660",
          "publishedOn": "2022-08-30T15:40:39.000Z",
          "wordCount": null,
          "title": "CVE-2022-31197 PostgreSQL JDBC SQL注入分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11627",
          "author": null,
          "description": "ADCS攻击笔记",
          "link": "https://xz.aliyun.com/t/11627",
          "publishedOn": "2022-08-29T14:15:00.000Z",
          "wordCount": null,
          "title": "ADCS攻击笔记",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11658",
          "author": null,
          "description": "ThinkPHP 5.0.X代码审计",
          "link": "https://xz.aliyun.com/t/11658",
          "publishedOn": "2022-08-29T13:51:41.000Z",
          "wordCount": null,
          "title": "ThinkPHP 5.0.X代码审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11652",
          "author": null,
          "description": "【云攻防系列】从攻击者视角聊聊K8S集群安全（上）",
          "link": "https://xz.aliyun.com/t/11652",
          "publishedOn": "2022-08-29T13:49:00.000Z",
          "wordCount": null,
          "title": "【云攻防系列】从攻击者视角聊聊K8S集群安全（上）",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11655",
          "author": null,
          "description": "给木马带双眼睛",
          "link": "https://xz.aliyun.com/t/11655",
          "publishedOn": "2022-08-29T13:48:52.000Z",
          "wordCount": null,
          "title": "给木马带双眼睛",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11651",
          "author": null,
          "description": "利用 PHP-FPM 做内存马的方法",
          "link": "https://xz.aliyun.com/t/11651",
          "publishedOn": "2022-08-29T13:45:00.000Z",
          "wordCount": null,
          "title": "利用 PHP-FPM 做内存马的方法",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "dev.to top (month)",
      "feedUrl": "https://rsshub.app/dev.to/top/month",
      "siteUrl": "https://dev.to/top/month",
      "articles": [
        {
          "id": "https://dev.to/wiseai/continue-using-env-files-as-usual-2am5",
          "author": "Mahmoud Harmouch",
          "description": "#javascript #webdev #node",
          "link": "https://dev.to/wiseai/continue-using-env-files-as-usual-2am5",
          "publishedOn": "2022-09-24T13:46:35.000Z",
          "wordCount": 15980,
          "title": "Continue Using .env Files As Usual.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--xUCEWzk_--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/3ivon50sdm1h96tluxpr.jpg"
        },
        {
          "id": "https://dev.to/surajondev/free-awesome-notion-templates-for-developers-43mh",
          "author": "Suraj Vishwakarma",
          "description": "#javascript #webdev #beginners #react",
          "link": "https://dev.to/surajondev/free-awesome-notion-templates-for-developers-43mh",
          "publishedOn": "2022-09-22T11:34:35.000Z",
          "wordCount": 3016,
          "title": "Free Awesome Notion Templates for Developers",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--AOu5DsZ6--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/g92u94fwpd1rqighuwvm.png"
        },
        {
          "id": "https://dev.to/jamieswift90/boost-your-productivity-best-software-for-dev-teams-476g",
          "author": "Jamie Swift",
          "description": "#webdev #programming #productivity #devops",
          "link": "https://dev.to/jamieswift90/boost-your-productivity-best-software-for-dev-teams-476g",
          "publishedOn": "2022-09-22T08:24:47.000Z",
          "wordCount": 2714,
          "title": "Boost Your Productivity: Best Software For Dev Teams",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--_08PegJt--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vixsld9i4yrqr05l27nh.png"
        },
        {
          "id": "https://dev.to/karanpratapsingh/system-design-netflix-3d9g",
          "author": "Karan Pratap Singh",
          "description": "#distributedsystems #architecture #tutorial",
          "link": "https://dev.to/karanpratapsingh/system-design-netflix-3d9g",
          "publishedOn": "2022-09-22T02:51:27.000Z",
          "wordCount": 4841,
          "title": "System Design: Netflix",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--EFXEDOeJ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://raw.githubusercontent.com/karanpratapsingh/portfolio/master/public/static/courses/system-design/chapter-V/netflix/banner.png"
        },
        {
          "id": "https://dev.to/karanpratapsingh/system-design-whatsapp-fld",
          "author": "Karan Pratap Singh",
          "description": "#distributedsystems #architecture #tutorial",
          "link": "https://dev.to/karanpratapsingh/system-design-whatsapp-fld",
          "publishedOn": "2022-09-21T05:44:12.000Z",
          "wordCount": 5522,
          "title": "System Design: WhatsApp",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--nFT8wguM--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://raw.githubusercontent.com/karanpratapsingh/portfolio/master/public/static/courses/system-design/chapter-V/whatsapp/banner.png"
        },
        {
          "id": "https://dev.to/hr21don/every-blogger-should-save-these-10-insanely-useful-websites-44ad",
          "author": "Helitha Rupasinghe",
          "description": "#productivity #programming #webdev #beginners",
          "link": "https://dev.to/hr21don/every-blogger-should-save-these-10-insanely-useful-websites-44ad",
          "publishedOn": "2022-09-20T09:02:11.000Z",
          "wordCount": 1748,
          "title": "Every Blogger Should Save These 10 Insanely Useful Websites 👇",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--oFECoplV--/c_imagga_scale,f_auto,fl_progressive,h_500,q_66,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/7591d0exk4j5y0vdjg94.gif"
        },
        {
          "id": "https://dev.to/gregorygaines/stop-using-env-files-now-kp0",
          "author": "Gregory Gaines",
          "description": "#javascript #webdev #node #productivity",
          "link": "https://dev.to/gregorygaines/stop-using-env-files-now-kp0",
          "publishedOn": "2022-09-19T21:04:49.000Z",
          "wordCount": 26462,
          "title": "Stop Using .env Files Now!",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--aVrIfj2y--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/e9c0wazzsnbjuewf4vvl.png"
        },
        {
          "id": "https://dev.to/enterspeed/making-a-fast-website-is-super-easy-9lb",
          "author": "Kasper Andreassen, Enterspeed",
          "description": "#webdev #performance #programming #tutorial",
          "link": "https://dev.to/enterspeed/making-a-fast-website-is-super-easy-9lb",
          "publishedOn": "2022-09-19T07:26:18.000Z",
          "wordCount": 9154,
          "title": "Making a fast website is SUPER EASY 😏",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--eHs2p1NQ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rkzv3rk0qwdgoer7ipg9.jpg"
        },
        {
          "id": "https://dev.to/wiseai/9-figma-alternatives-for-a-blazingly-fast-increase-in-your-productivity-3g40",
          "author": "Mahmoud Harmouch",
          "description": "#design #uiweekly #productivity #ux",
          "link": "https://dev.to/wiseai/9-figma-alternatives-for-a-blazingly-fast-increase-in-your-productivity-3g40",
          "publishedOn": "2022-09-18T07:35:48.000Z",
          "wordCount": 3413,
          "title": "9 Figma Alternatives For A Blazingly Fast Increase In Your Productivity.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--1LshbYpi--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://cdn.pixabay.com/photo/2018/07/30/23/20/editor-3573850_960_720.jpg"
        },
        {
          "id": "https://dev.to/aviyel/top-9-best-ui-component-librariesframeworks-in-2022-for-frontend-developers-b48",
          "author": "Pramit Marattha, Aviyel Inc",
          "description": "#webdev #css #tailwindcss #opensource",
          "link": "https://dev.to/aviyel/top-9-best-ui-component-librariesframeworks-in-2022-for-frontend-developers-b48",
          "publishedOn": "2022-09-18T07:02:36.000Z",
          "wordCount": 4870,
          "title": "9 Best UI Component Libraries/Frameworks in 2022 for Frontend Developers🔥",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--RH2DIWnx--/c_imagga_scale,f_auto,fl_progressive,h_500,q_66,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/p9jbpewbrgkcp3lkjv6d.gif"
        },
        {
          "id": "https://dev.to/saeedmosavat/stop-writing-api-functions-3693",
          "author": "Saeed Mosavat",
          "description": "#javascript #webdev #codequality #productivity",
          "link": "https://dev.to/saeedmosavat/stop-writing-api-functions-3693",
          "publishedOn": "2022-09-17T23:22:15.000Z",
          "wordCount": 4801,
          "title": "Stop writing API functions",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---uE2Eyti--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/3yt73lpk3jwfok2vea0u.jpg"
        },
        {
          "id": "https://dev.to/marodevv/built-a-devto-replica-with-the-mern-stack-and-more-fbd",
          "author": "Marwan mostafa",
          "description": "#showdev #javascript #react #node",
          "link": "https://dev.to/marodevv/built-a-devto-replica-with-the-mern-stack-and-more-fbd",
          "publishedOn": "2022-09-17T12:43:50.000Z",
          "wordCount": 3316,
          "title": "💁‍♂️ Built a Dev.to replica with The MERN stack and more",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--dBsq-zrn--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/hjqt4ea0poro5tmprvmz.png"
        },
        {
          "id": "https://dev.to/wadecodez/the-git-commands-i-use-every-day-5g17",
          "author": "Wade Zimmerman",
          "description": "#git #beginners #programming #javascript",
          "link": "https://dev.to/wadecodez/the-git-commands-i-use-every-day-5g17",
          "publishedOn": "2022-09-17T12:34:13.000Z",
          "wordCount": 3650,
          "title": "The Git Commands I Use Every Day",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--maqcEdLv--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qpmt6qdjaxbxw9h0labn.png"
        },
        {
          "id": "https://dev.to/shreyvijayvargiya/why-our-websites-are-slow-importance-of-bundle-size-1le4",
          "author": "shrey vijayvargiya",
          "description": "#programming #react #javascript #webdev",
          "link": "https://dev.to/shreyvijayvargiya/why-our-websites-are-slow-importance-of-bundle-size-1le4",
          "publishedOn": "2022-09-17T11:31:19.000Z",
          "wordCount": 4364,
          "title": "Why our websites are slow — Importance of bundle size",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--xSJS3Y_w--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/y53ptgcsw8i30dipa0t8.png"
        },
        {
          "id": "https://dev.to/profydev/how-to-debug-react-apps-with-vs-code-boost-your-debugging-productivity-1k05",
          "author": "Johannes Kettmann, Profy.dev",
          "description": "#react #javascript #webdev #vscode",
          "link": "https://dev.to/profydev/how-to-debug-react-apps-with-vs-code-boost-your-debugging-productivity-1k05",
          "publishedOn": "2022-09-16T12:09:50.000Z",
          "wordCount": 3356,
          "title": "How To Debug React Apps With VS Code - Boost Your Debugging Productivity",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--ivQHK2GP--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/b4bjg33oiq261p11ask1.png"
        },
        {
          "id": "https://dev.to/madza/19-practical-es6-snippets-to-solve-common-js-problems-31o9",
          "author": "Madza",
          "description": "#webdev #javascript #frontend #productivity",
          "link": "https://dev.to/madza/19-practical-es6-snippets-to-solve-common-js-problems-31o9",
          "publishedOn": "2022-09-15T15:47:21.000Z",
          "wordCount": 3038,
          "title": "19 Practical ES6 Snippets to Solve Common JS Problems 🚀💯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--3165AlXi--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/tzncjvbqvq8jkw7l1v9w.png"
        },
        {
          "id": "https://dev.to/dcodeyt/7-must-know-javascript-tips-tricks-2m8f",
          "author": "Dom (dcode)",
          "description": "#javascript #webdev #beginners #tutorial",
          "link": "https://dev.to/dcodeyt/7-must-know-javascript-tips-tricks-2m8f",
          "publishedOn": "2022-09-15T12:49:53.000Z",
          "wordCount": 3048,
          "title": "7 Must Know JavaScript Tips & Tricks 🎈",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Ejpaz6KH--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vgad7ph4dihcbqw45kl3.jpg"
        },
        {
          "id": "https://dev.to/stripe/designing-apis-for-humans-error-messages-94p",
          "author": "Paul Asjes, Stripe",
          "description": "#api #webdev #programming #stripe",
          "link": "https://dev.to/stripe/designing-apis-for-humans-error-messages-94p",
          "publishedOn": "2022-09-14T11:36:49.000Z",
          "wordCount": 5647,
          "title": "Designing APIs for humans: Error messages",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--8NfiYBul--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/pfxrwzebqa64bcyj3bow.png"
        },
        {
          "id": "https://dev.to/jainilprajapati/7-fantastic-heroku-alternatives-4jf8",
          "author": "Jainil Prajapati",
          "description": "#heroku #javascript #webdev #programming",
          "link": "https://dev.to/jainilprajapati/7-fantastic-heroku-alternatives-4jf8",
          "publishedOn": "2022-09-12T18:26:06.000Z",
          "wordCount": 3276,
          "title": "7 Fantastic Heroku Alternatives",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---aKLwteS--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qnauthgy32x1bsrnd1d4.png"
        },
        {
          "id": "https://dev.to/novu/building-an-interactive-screen-sharing-app-with-puppeteer-and-react-12h7",
          "author": "Nevo David, novu",
          "description": "#react #webdev #javascript #opensource",
          "link": "https://dev.to/novu/building-an-interactive-screen-sharing-app-with-puppeteer-and-react-12h7",
          "publishedOn": "2022-09-12T15:05:19.000Z",
          "wordCount": 5224,
          "title": "Building an interactive screen-sharing app with Puppeteer and React 🤯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7WhDhNPC--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/z19zh12b5yiuggqevbgr.jpg"
        },
        {
          "id": "https://dev.to/wiseai/the-best-github-repositories-for-django-developers-451l",
          "author": "Mahmoud Harmouch",
          "description": "#django",
          "link": "https://dev.to/wiseai/the-best-github-repositories-for-django-developers-451l",
          "publishedOn": "2022-09-12T12:32:16.000Z",
          "wordCount": 16464,
          "title": "The Best GitHub Repositories For Django Developers.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--YUdYoxl3--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/gnwkox5cxrc7md24xmgx.png"
        },
        {
          "id": "https://dev.to/adiatiayu/mini-portfolio-bring-your-github-profile-to-the-next-level-5c8n",
          "author": "Ayu Adiati",
          "description": "#github #tutorial #beginners #webdev",
          "link": "https://dev.to/adiatiayu/mini-portfolio-bring-your-github-profile-to-the-next-level-5c8n",
          "publishedOn": "2022-09-12T10:42:30.000Z",
          "wordCount": 4565,
          "title": "Mini Portfolio: Bring Your GitHub Profile To The Next Level",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--3_YgJFdy--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ntl8av7jl2ybtwdnd56x.png"
        },
        {
          "id": "https://dev.to/k_ivanow/finding-remote-work-in-2022-26j",
          "author": "Kristian Ivanov",
          "description": "#remote #interview #career #jobs",
          "link": "https://dev.to/k_ivanow/finding-remote-work-in-2022-26j",
          "publishedOn": "2022-09-11T15:07:11.000Z",
          "wordCount": 2932,
          "title": "Finding remote work in 2022",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--A-BCBZYT--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/djubpwkd8c3oycq5qpu2.jpeg"
        },
        {
          "id": "https://dev.to/aviavinav/the-making-of-a-react-component-librabry-cep",
          "author": "Avi Avinav",
          "description": "#javascript #react #webdev #beginners",
          "link": "https://dev.to/aviavinav/the-making-of-a-react-component-librabry-cep",
          "publishedOn": "2022-09-11T12:09:24.000Z",
          "wordCount": 4297,
          "title": "The Making of A React Component Library",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--980rloZD--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/iglufrc1hyb2akr4wdhq.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/mastering-these-7-basics-css-skills-will-make-you-a-frontend-wizard-2khn",
          "author": "Tapajyoti Bose",
          "description": "#webdev #programming #css #beginners",
          "link": "https://dev.to/ruppysuppy/mastering-these-7-basics-css-skills-will-make-you-a-frontend-wizard-2khn",
          "publishedOn": "2022-09-11T06:25:06.000Z",
          "wordCount": 2614,
          "title": "Mastering these 7 Basics CSS Skills will make you a Frontend Wizard 🧙✨",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--o3Bv5OAd--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/heca1jzzdzqchb4k2sdl.png"
        },
        {
          "id": "https://dev.to/dabit3/building-full-stack-applications-with-arweave-and-nextjs-28hg",
          "author": "Nader Dabit",
          "description": "#webdev #javascript #nextjs #web3",
          "link": "https://dev.to/dabit3/building-full-stack-applications-with-arweave-and-nextjs-28hg",
          "publishedOn": "2022-09-10T19:12:27.000Z",
          "wordCount": 3995,
          "title": "Building Full Stack Permanent Applications with Arweave, Smartweave, and Next.js",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--yef00i4h--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/r2o66tc2bwbgr07i97o4.png"
        },
        {
          "id": "https://dev.to/github/why-are-people-developing-inside-containers-38o6",
          "author": "Rizèl Scarlett, GitHub",
          "description": "#github #beginners #cloud #docker",
          "link": "https://dev.to/github/why-are-people-developing-inside-containers-38o6",
          "publishedOn": "2022-09-09T20:49:53.000Z",
          "wordCount": 4279,
          "title": "Why are people developing inside containers?",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7lFVUHWD--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/58pr74ygicsvwc84lzko.png"
        },
        {
          "id": "https://dev.to/wiseai/30-pytricks-ive-learned-by-joining-the-real-python-mailing-list-227i",
          "author": "Mahmoud Harmouch",
          "description": "#python #beginners",
          "link": "https://dev.to/wiseai/30-pytricks-ive-learned-by-joining-the-real-python-mailing-list-227i",
          "publishedOn": "2022-09-08T20:16:08.000Z",
          "wordCount": 3887,
          "title": "30 PyTricks I've Learned By Joining the Real Python Mailing List.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---uxRo6-R--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://cdn.pixabay.com/photo/2016/07/13/08/48/mobile-phone-1513945_960_720.jpg"
        },
        {
          "id": "https://dev.to/madza/12-modern-ui-components-to-inspire-your-future-designs-4ni4",
          "author": "Madza",
          "description": "#webdev #design #ui #inspiration",
          "link": "https://dev.to/madza/12-modern-ui-components-to-inspire-your-future-designs-4ni4",
          "publishedOn": "2022-09-08T16:08:58.000Z",
          "wordCount": 2570,
          "title": "12 Modern UI Components to Inspire Your Future Designs 😍✨",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--hbquREjm--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/scnrm2bxol261sqbs5nk.png"
        },
        {
          "id": "https://dev.to/surajondev/50-awesome-tools-for-web-developers-5gan",
          "author": "Suraj Vishwakarma",
          "description": "#javascript #webdev #beginners #react",
          "link": "https://dev.to/surajondev/50-awesome-tools-for-web-developers-5gan",
          "publishedOn": "2022-09-08T11:31:33.000Z",
          "wordCount": 3560,
          "title": "50+ Awesome tools for Web Developers",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--8iFoZSNU--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/584lu1fv3nsoulybolcx.png"
        },
        {
          "id": "https://dev.to/devsyedmohsin/javascript-tips-and-tricks-you-need-to-know-1g2k",
          "author": "Syed Mohsin Raza",
          "description": "#webdev #javascript #programming #beginners",
          "link": "https://dev.to/devsyedmohsin/javascript-tips-and-tricks-you-need-to-know-1g2k",
          "publishedOn": "2022-09-08T11:16:33.000Z",
          "wordCount": 2053,
          "title": "JavaScript Tips And Tricks Every Developer Should know 💯 🚀️",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--ihSk23fE--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/hl22lqwcsrc92kvcap9y.png"
        },
        {
          "id": "https://dev.to/valeriavg/me-react-5-years-in-15-minutes-58od",
          "author": "Valeria",
          "description": "#react #beginners #javascript #webdev",
          "link": "https://dev.to/valeriavg/me-react-5-years-in-15-minutes-58od",
          "publishedOn": "2022-09-08T07:10:08.000Z",
          "wordCount": 6043,
          "title": "Me & React: 5 years in 15 minutes",
          "imageUrl": "https://dev.to/social_previews/article/1182435.png"
        },
        {
          "id": "https://dev.to/anshika_gautam_/build-a-web-paint-application-5f55",
          "author": "Anshika",
          "description": "#javascript #html #css #webdev",
          "link": "https://dev.to/anshika_gautam_/build-a-web-paint-application-5f55",
          "publishedOn": "2022-09-07T14:49:34.000Z",
          "wordCount": 3847,
          "title": "Build a Web Paint Application",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--N0wfHpeN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/61e7ifwm7v7o3ze8cgyx.png"
        },
        {
          "id": "https://dev.to/j471n/detect-when-users-switch-tabs-using-javascript-3mi3",
          "author": "Jatin Sharma",
          "description": "#javascript #webdev #tutorial #beginners",
          "link": "https://dev.to/j471n/detect-when-users-switch-tabs-using-javascript-3mi3",
          "publishedOn": "2022-09-07T04:00:01.000Z",
          "wordCount": 3187,
          "title": "Detect When Users Switch Tabs using JavaScript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--sh7elrYU--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qudvzomd2qg2su4d9a5n.png"
        },
        {
          "id": "https://dev.to/zevir/the-complete-list-of-heroku-alternatives-to-consider-1l8o",
          "author": "Zevi Reinitz",
          "description": "#heroku #webdev #programming #devops",
          "link": "https://dev.to/zevir/the-complete-list-of-heroku-alternatives-to-consider-1l8o",
          "publishedOn": "2022-09-06T15:21:05.000Z",
          "wordCount": 4969,
          "title": "The Complete List of Heroku Alternatives to Consider",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--vhb83Cu9--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ym56sdt5nhkglna6tse8.jpg"
        },
        {
          "id": "https://dev.to/novu/building-a-live-event-alert-system-with-react-socketio-and-push-notifications-2jg5",
          "author": "Nevo David, novu",
          "description": "#javascript #react #programming #webdev",
          "link": "https://dev.to/novu/building-a-live-event-alert-system-with-react-socketio-and-push-notifications-2jg5",
          "publishedOn": "2022-09-05T14:36:26.000Z",
          "wordCount": 5078,
          "title": "Building a live-event alert system with React, Socket.io, and Push Notifications 🚀",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--EHHuJVoh--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/nbmmt0sax2e28wluvsyl.png"
        },
        {
          "id": "https://dev.to/enterspeed/we-measured-the-ssr-performance-of-6-js-frameworks-heres-what-we-found-1ck0",
          "author": "Kasper Andreassen, Enterspeed",
          "description": "#javascript #react #performance #webdev",
          "link": "https://dev.to/enterspeed/we-measured-the-ssr-performance-of-6-js-frameworks-heres-what-we-found-1ck0",
          "publishedOn": "2022-09-05T06:35:44.000Z",
          "wordCount": 4283,
          "title": "We measured the SSR performance of 6 JS frameworks - here's what we found",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--am_cPbMF--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/c1vlghlhjps2toxu0m25.jpg"
        },
        {
          "id": "https://dev.to/codewithtee/15-array-methods-in-javascript-1p1m",
          "author": "Tabassum Khanum",
          "description": "#javascript #webdev #beginners #programming",
          "link": "https://dev.to/codewithtee/15-array-methods-in-javascript-1p1m",
          "publishedOn": "2022-09-04T18:05:05.000Z",
          "wordCount": 4073,
          "title": "15+ Array Methods in Javascript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--E2de0xXe--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vtkz5a0fnln38z578ikg.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/6-must-have-chrome-extensions-for-web-developers-1ma2",
          "author": "Tapajyoti Bose",
          "description": "#webdev #javascript #productivity #programming",
          "link": "https://dev.to/ruppysuppy/6-must-have-chrome-extensions-for-web-developers-1ma2",
          "publishedOn": "2022-09-04T06:15:00.000Z",
          "wordCount": 2381,
          "title": "6 must-have Chrome Extensions for Web Developers 🚀🌐",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--2XIBrsLR--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ba1979d6k9jju5e6ia6p.png"
        },
        {
          "id": "https://dev.to/sarath_pm/git-cheatsheet-414e",
          "author": "Sarath P M",
          "description": "#git #programming #github #codenewbie",
          "link": "https://dev.to/sarath_pm/git-cheatsheet-414e",
          "publishedOn": "2022-09-03T13:35:05.000Z",
          "wordCount": 3476,
          "title": "Git Cheatsheet",
          "imageUrl": "https://dev.to/social_previews/article/1178295.png"
        },
        {
          "id": "https://dev.to/heyjtk/big-o-notation-basics-made-dead-simple-1c9m",
          "author": "JTK",
          "description": "#softwareengineering #algorithms #coding",
          "link": "https://dev.to/heyjtk/big-o-notation-basics-made-dead-simple-1c9m",
          "publishedOn": "2022-09-02T19:06:38.000Z",
          "wordCount": 5198,
          "title": "Big O notation basics made dead simple",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--3OHOMm_M--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ia3qpqezyrd0lyr5j6dg.jpg"
        },
        {
          "id": "https://dev.to/surajondev/awesome-github-repositories-for-web-developer-part-2-1h8b",
          "author": "Suraj Vishwakarma",
          "description": "#github #webdev #javascript #beginners",
          "link": "https://dev.to/surajondev/awesome-github-repositories-for-web-developer-part-2-1h8b",
          "publishedOn": "2022-09-01T11:36:22.000Z",
          "wordCount": 3104,
          "title": "Awesome GitHub Repositories for Web Developer - Part 2",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--HfSsorGN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/n562actscws9k9rfsvpq.png"
        },
        {
          "id": "https://dev.to/whitep4nth3r/whats-the-difference-between-and-in-css-23p4",
          "author": "Salma Alam-Naylor",
          "description": "#css #webdev #beginners",
          "link": "https://dev.to/whitep4nth3r/whats-the-difference-between-and-in-css-23p4",
          "publishedOn": "2022-09-01T09:41:50.000Z",
          "wordCount": 2851,
          "title": "What's the difference between : and :: in CSS?",
          "imageUrl": "https://dev.to/social_previews/article/1181288.png"
        },
        {
          "id": "https://dev.to/francescoxx/how-to-learn-web3-september-2022-3h9h",
          "author": "Francesco Ciulla",
          "description": "#web3 #blockchain #beginners #programming",
          "link": "https://dev.to/francescoxx/how-to-learn-web3-september-2022-3h9h",
          "publishedOn": "2022-09-01T06:03:23.000Z",
          "wordCount": 6264,
          "title": "How to Learn Web3 (September 2022)",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--L7sp3K03--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ir3ojvhv20khaipk7x9l.jpg"
        },
        {
          "id": "https://dev.to/meshvpatel18/top-heroku-alternatives-for-free-46g1",
          "author": "Meshv Patel",
          "description": "#heroku #webdev #programming",
          "link": "https://dev.to/meshvpatel18/top-heroku-alternatives-for-free-46g1",
          "publishedOn": "2022-08-31T13:49:56.000Z",
          "wordCount": 4817,
          "title": "Top Heroku Alternatives for free",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--r_6FrH43--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/6p9g6fa8h6n8w0wfx453.png"
        },
        {
          "id": "https://dev.to/devdevcharlie/building-an-aircraft-radar-system-in-javascript-4ml8",
          "author": "Charlie Gerard",
          "description": "#javascript #webusb #rtlsdr",
          "link": "https://dev.to/devdevcharlie/building-an-aircraft-radar-system-in-javascript-4ml8",
          "publishedOn": "2022-08-29T16:00:41.000Z",
          "wordCount": 3968,
          "title": "Building an aircraft radar system in JavaScript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--bbckrCHJ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://res.cloudinary.com/devdevcharlie/image/upload/v1661734283/Group_36_i7nacq.png"
        },
        {
          "id": "https://dev.to/ijsucceed/7-useful-articles-every-new-developer-should-bookmark-bpg",
          "author": "Jeremy Ikwuje",
          "description": "#codenewbie #webdev #beginners #javascript",
          "link": "https://dev.to/ijsucceed/7-useful-articles-every-new-developer-should-bookmark-bpg",
          "publishedOn": "2022-08-29T13:56:00.000Z",
          "wordCount": 2220,
          "title": "7 Useful Articles Every New Developer Should Bookmark 👍💯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Hp-eZub_--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/g3jvno0v82x6r247c1qo.png"
        },
        {
          "id": "https://dev.to/refine/5-most-common-usestate-mistakes-react-developers-often-make-3aig",
          "author": "Necati Özmen, refine",
          "description": "#react #webdev #programming #opensource",
          "link": "https://dev.to/refine/5-most-common-usestate-mistakes-react-developers-often-make-3aig",
          "publishedOn": "2022-08-29T09:26:00.000Z",
          "wordCount": 5717,
          "title": "5 Most Common useState Mistakes React Developers Often Make",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--icsJRQJA--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/8hwypzqq79uayyyj6ff9.png"
        }
      ]
    },
    {
      "title": "少数派 -- Matrix",
      "feedUrl": "https://rsshub.app/sspai/matrix",
      "siteUrl": "https://sspai.com/matrix",
      "articles": [
        {
          "id": "https://sspai.com/post/75736",
          "author": "kinh_l",
          "description": "Matrix 首页推荐 \nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。\n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\n随着播客的形式和内容日益丰富，其中不乏一些信息价值和密度可以与文章、视频媲美的节目。对于文字和图像，我们会通过剪藏、截图来收集；然而对于声音为媒介的播客，是否你也曾产生过「要是能把这段单独截出来就好了」的想法？\n作为半个播客爱好者，我一直在使用 Spotify 收听播客，无论是设备进度同步，还是 UI 交互，播客的基础功能都算基本满足；唯一遗憾是当听到精彩的片段时，没有裁剪和收藏片段的功能。\n因此，我开始在市面上寻找这样的播客应用，需求主要包括：\n\n必须要有片段截取功能；\n需要能创建公开链接，以便分享给朋友和自己收集；\n本身的播放功能需要能过得去；\n如果能跨平台，也是加分项。\n\n在市面上找了一轮，大体能满足要求的有 6 款，分别是 Snipd、Airr 、QlipCast、Overcast、喜马拉雅和 Castro。但其中，喜马拉雅存在广告泛滥和节目内容受限不全的问题，虽然具有功能齐全、多端同步、网络稳定的优势，但个人不纳入考虑，不介意前述问题的朋友可以尝试。至于 Castro，它的片段截取只能生成本地文件片段，要分享还得自己找地方上传，此外播放稳定性似乎不佳，节目声音会不停重复（暂不清楚是否我的个例），因此也先排除。\n因此在后文中，我将具体比较 Snipd、Airr 、QlipCast、Overcast 这四个播客应用与片段截取和分享需求相关的功能，给有类似需求的读者做参考。\n    \n具体比较\n整体设计风格\nSnipd 的整体风格和 Spotify 相近，主要特征是大线条的图标以及深蓝渐变和绿色的色彩。\nAirr 界面简洁干…",
          "link": "https://sspai.com/post/75736",
          "publishedOn": "2022-09-26T15:00:33.000Z",
          "wordCount": 654,
          "title": "听播客也要收集精彩片段，哪个应用更适合？",
          "imageUrl": "https://cdn.sspai.com/2022/09/15/fce71d2176ad98449f0b5675143ce87f.png"
        },
        {
          "id": "https://sspai.com/post/75934",
          "author": "Spike112",
          "description": "在以前的文章中，我对笔记软件和写作软件按照类别进行了梳理，参见《盘点那些具有特色的笔记软件》、《盘点那些具有特色的写作软件》。今天承接这一系列，介绍《盘点那些具有特色的电子白板软件》。\n在思维导图、概念图之外，白板作为一种强大的思维辅助工具，正在日益流行。为什么很多人喜欢白板呢？\n为什么需要白板？\n\n自由。白板没有过多的束缚。就像在一张白纸一样。你可以在空白页面随心所欲地表达你的思想。\n可视化。只需要使用画笔、文本框等模块以及模版，快速地将你地思维过程和想法以图文组合地方式加以表达。\n\n事实上，白板也并非什么新鲜事务。很多公司一直在使用实体白板进行开会等活动。如今，随着工作方式的改变，人们在远程工作、远程教育等场景中迫切需要电子白板工具。\n那么，如何选择适合自己的电子白板软件呢？我根据对于白板软件的使用需求，依次介绍本地离线的白板软件、免费/好用的在线白板软件、在线协作的白板软件，以满足对白板软件从轻量级到重量级等不同程度的需求。此外，还介绍两种与白板相关、特殊类型的工具：介于白板和笔记之间的可视化知识管理工具、内置白板模块的笔记软件。\n本地离线的白板软件\nMicrosoft Whiteboard 微软出品的免费白板软件\n官网：Microsoft Whiteboard 官网\n\n介绍：协作式数字画布，可实现有效会议和互动学习。\n优点：微软出品，免费、强大。并且，可以与微软 Office 软件生态进行整合。\nApple Freeform 苹果正在开发的白板应用\nFreeform 提供了一个“灵活的画布”，参与者可以在其中将文本、照片、绘图、PDF 和其他内容添加到单个空间中。该应用程序与 Messages 和 FaceTime 密切相关。Freeform 可以在 FaceTime 通话期间启动，并且通过 Messages 反映协作内容。具体发布时间未知，预计首先登录 iPadO…",
          "link": "https://sspai.com/post/75934",
          "publishedOn": "2022-09-26T11:29:45.000Z",
          "wordCount": 601,
          "title": "盘点那些具有特色的电子白板软件",
          "imageUrl": "https://cdn.sspai.com/2022/09/26/37df15efea0cfe02249c8e291a76bd58.png"
        },
        {
          "id": "https://sspai.com/post/75935",
          "author": "1A君",
          "description": "2020年的时候，我开始对「知识管理」产生兴趣，一路寻找适合自己的工具和方法。经过近两年的探索，我终于找到了答案——通过 wolai 平台来实践L先生的「INK-P 管理法」，借此搭建属于自己的知识体系。（注：L先生，即公众号「L先生说」的作者 Lachel李睿秋，也是我的老师。下文统一称呼「L先生」）\n先给大家展示我去年的一个成果——《御赐小仵作》资料整理。大家可以看看下面这几张动图：\n\n页面详情可点击此链接查看：《御赐小仵作》资料整理\n《御赐小仵作》是去年的一部古装悬疑连续剧，算得上是暑期档的最大黑马了。该剧的情节、设定和诸多细节都很讲究，所以我觉得有必要整理一番。一来是出于自己对这部作品的喜爱，二来是想让制作团队的用心能让更多人看到。\n去年6月的时候我开始整理，本以为只需要一两个星期，实则大大低估了它的工作量。我那会每天大概抽出半个小时，磨了整整5个月才完成。不过虽然是挺累的，但整理完还是倍有成就感。这次的整理大致分为5个模块：\n\n每集的剧情脉络\n剧中重要人物的介绍\n相关的历史背景和知识\n唐代的官职制度\n剧中所涉及的知识点\n\n这几部分主要是通过 wolai 的「双向链接」和「嵌入引用」来实现联动。\n比如第一集的剧情这里，红色的部分是双向链接，引用的有人物也有知识点。跳转到人物界面之后，可以看到 ta 的简介，以及相关的经历。人物经历下面通过「嵌入引用」，把剧情里的信息链接过来。因为这部剧的主旋律是验尸和破案，所以几个主角的经历还会分出「工作成果」这一部分。\n\n00 wolai功能简介\nwolai 是国内开发的一个云端协作平台，用来搭建知识体系也很适合。\n2018年的时候我就开始搭建自己的数据库，从最初的印象笔记，到后来的 Onenote 和 Notion，一步步探索，最后在2020年选择了 wolai。\n我之所以会选择它，一是因为它的界面清新简洁，颜值高，二是它采取了…",
          "link": "https://sspai.com/post/75935",
          "publishedOn": "2022-09-26T10:49:36.000Z",
          "wordCount": 684,
          "title": "知识该怎么管理呢？我终于找到答案了",
          "imageUrl": "https://cdn.sspai.com/2022/09/26/7c8f839ab3774a713efd4fe6a4f410fe.jpg"
        },
        {
          "id": "https://sspai.com/post/75869",
          "author": "kokdemo",
          "description": "关于备播集\n掐指一算，试播集 已经暂别我们两个多月了，在没有南哥发车的这些日子里，我攒了不少读书笔记，决定自发的搞一期 “备播集”，大约等同于电视台里没节目可播的时候强行凑数的节目。\n本期车长：@kokdemo\n本期车员：@James_Tu\n如果大家对这样的形式喜闻乐见，也欢迎在各种渠道找到我，大家一起攒读书笔记并发出来，希望能坚持到试播集回来的那一天。最后也感谢南哥对本文头图的大力支持。\n\n@kokdemo 创业者们的自述\n最近看到了巴塔哥尼亚创始人决定把公司“捐给地球1”的新闻，让我感到颇为震撼，在看完新闻之后，我立马去阅读了巴塔哥尼亚创始人伊冯·乔伊纳德所著的《冲浪板上的公司》这本书。\n巴塔哥尼亚官网的公告-地球是我们唯一的股东\n在读完这本书之后，我对这家公司的文化和理念十分敬佩，于是打算将这一段时间读过的一些公司创始人所写的书放在一起，和大家聊一聊。\n\n《Salesforce传奇》：作者是 Salesforce 创始人马克·贝尼奥夫。Salesforce 是软件即服务行业（SaaS）的先驱和佼佼者，创办于1999年，主要产品是客户管理系统（CRM）；Salesforce 在纽约证券交易所上市，目前市值 1470.10 亿美元。\n《发明》：作者是 dyson 创始人詹姆斯戴森。戴森是一家专注家用电器的公司，创办于1991年，其推出的吸尘器、风扇、吹风机等广受好评。戴森仍然是一家私人家族公司，没有上市。\n《小米创业思考》：作者是小米集团创始人雷军。小米集团是一家以手机为核心的消费电子公司，创办于2010年。小米集团于港交所上市，目前市值 2366 亿港币。\n《冲浪板上的公司》：作者是巴塔哥尼亚创始人伊冯·乔伊纳德。巴塔哥尼亚是一家主营户外服装、户外装备的公司，创办于1972年。巴塔哥尼亚仍然是一家私人家族公司，没有上市。\n本文聊到的四家公司\n（哦对了，在之前的试播集中，…",
          "link": "https://sspai.com/post/75869",
          "publishedOn": "2022-09-26T09:46:13.000Z",
          "wordCount": 533,
          "title": "备播集 01 ｜少数派作者最近读了什么",
          "imageUrl": "https://cdn.sspai.com/2022/09/26/2d7e4c7e96a0e9a8cce629781d777f5c.png"
        },
        {
          "id": "https://sspai.com/post/75902",
          "author": "猴猴说话",
          "description": "你有没有想过一个问题：为什么心理学家都喜欢拿老鼠做实验？\n一般来说会找一只涉世未深的小白鼠，然后把它放到一个箱子里，还会给它准备一些食物，但是食物会连上老鼠可操控的开关，并且加上电击、喂食等各种条件变量，然后通过设计不同的机制，来看老鼠最后的反应，最后老鼠会因此习得一些惯性的行为模式。\n实验完成后，心理学家会把老鼠的这些行为反应总结成规律，然后应用和解释人类的行为和心理机制。\n这些实验结论都有一个隐含的前提，那就是老鼠的心智模式在某种情况下，等同于人类的心智模式：都是通过先做一些行为，然后从现实世界获取「反馈」，然后建立对世界的「预测」机制，直到最后形成了一个「稳定」的行为模式。\n为什么我们一定要经过反馈、预测、稳定的路径？因为不管是人类，还是老鼠，我们都会遵循一种固定的模式——心智模式。\n\n心智模式是我们简化世界后的知识结构和认知表征，我们常用它来与世界进行互动。\n——百度百科\n\n人类如果要在现实世界中生存，就需要认识并且适应所处的不断变化的环境。我们能够通过五官觉察身边的环境，通过短时的记忆去存储一段时间已经发生的变化，然后通过思维去归纳和预测还未发生的变化，最后形成一套自己的心智模式。\n可以说，我们只要想在这个世界上好好地活，就离不开我们的心智模式。\n我们可以将现实世界投射在心智之中，但是尽管穷尽一生，我们的心智世界也只能涵盖真实世界的很小一部分。\n很多时候，我们以为的真实世界其实并不真实。\n心智以外的“真实”世界\n楚门望着看起来一望无际的大海，不知道海的对面是一堵天蓝色的墙，墙上的楼梯能够通往现实世界。原来自己不过是一个被设定好的角色，眼前的一切都是人造的虚幻。如果周边的环境都是假的，那“我”还是真的吗？\n\n作为观察楚门的看客，我们知道他身处的世界是假的，但我们怎么知道没有人在观察我们？也许是我们的灵魂？或者有某种更广泛的神秘的存在在操控我们的命运。\n但我这里不想继…",
          "link": "https://sspai.com/post/75902",
          "publishedOn": "2022-09-26T09:44:23.000Z",
          "wordCount": 486,
          "title": "如何“打开心智”，应对“真实”世界？",
          "imageUrl": "https://cdn.sspai.com/2022/09/24/367b95ad339f450cf443ac5067310f5e.png"
        },
        {
          "id": "https://sspai.com/post/75931",
          "author": "GorgeousEdge",
          "description": "在正式开始教程之前首先说明一下目前国行系统的状态：最新版三星云（5.2.00.5）屏蔽了OneDrive备份的入口，直接删除了相关备份软件的服务。因此要在国行系统机器上继续使用OneDrive备份需要降级三星云。如果对Samsung Pay没有需求而对同步有比较大的需求，最简单的方法是刷港版系统。本教程基于One UI 4.1，国行S20。所有需要的安装包均可在教程链接或者apkmirror网站上找到。\n在开始之前需要的准备：一个非大陆地区的三星账号，一个微软账号（需要是个人账号），一个非国行系统的三星手机（也可以是你的国行设备刷港版系统），以及一部国行系统的三星手机（操作对象）。\n第一步，绑定三星账号和微软账户。\n在非国行系统的手机上登录三星账号，然后在相册的设置里，找到云同步，点击按照提示登录微软账户。其中某些步骤容易因为网络原因卡住，不过由于我从来没遇到过，所以有需求的建议在酷安上搜索相关资料，或者全程科学网络。这一步很简单，因此不做过多阐述。\n第二步，降级三星云。\n一般来说，国行系统的三星云会被强制自动更新，因此要想使用备份需要先降级三星云。\n目前在apkmirror上找到能安装也能备份的最新版是5.1.00.13，由于版本号相比国行最新版三星云5.1.05.9更低，需要重新安装。可以现在系统里卸载三星云，再安装此版本的三星云。如果不想重新同步之前的云数据，可以使用ADB直接降级安装。代码我放在下面（为了方便输入，包名我改成了123.apk）\nadb install -r -d D:\\123.apk\n第三步，在国行设备上进行后续操作。\n登录账号之后，下载一个OneDrive，登录之前和三星账户绑定的那个微软账户。登录成功之后就可以暂时忽略这个软件。然后按照链接里的方法在手机上安装lycan，这一步是关键，否则之后的操作都无法进行。\nhttps://www.coolapk.com/feed/32708070?shareKey=YWUwNDI3ZTU5Y2FmNjMzMTVlN2M~&shareUid=964712&shareFrom=com.coolapk.app_5.0.2\n下载「创建快捷方式」这个软件\n【创建快捷方式】 ，打开之后右上角三个点勾选「也显示系统应用」，搜索三星云。点击进入三星云的活动列表，搜索「dashboard」，找到图中这个活动，然后创建一个快捷方式放在桌面。\n\n如果此时打开这个快捷方式，会进入OneDrive同步的那个页面，但是会提示三星云需要更新才能同步，如果不更新就会强制退出。所以我们需要用到lycan屏蔽这个更新提示。\n打开lycan，搜索三星云，在「服务」中将uploadtodrive两项设置成enable\n\n在「接收器」中将下图三项禁用，三项名字均带有update\n\n在「服务」中打开下图两项\n\n此时重新打开刚刚那个快捷方式，就能够正常同步了。\n成功效果如图\n\n如果之后打开三星云又提示更新，可以按照之前的方法降级三星云。不排除之后的系统更新会屏蔽这个接口的可能，只能说且用且珍惜。",
          "link": "https://sspai.com/post/75931",
          "publishedOn": "2022-09-26T08:22:15.000Z",
          "wordCount": 478,
          "title": "国行系统三星手机同步 OneDrive 教程",
          "imageUrl": ""
        },
        {
          "id": "https://sspai.com/post/75909",
          "author": "JuniperPhoton",
          "description": "时间切片 Time Slice 是延时摄影的静态表现形式：你通过固定机位并在特定的时间间隔内拍摄一系列照片，得到一组静态照片，然后在后期的时候按照时间顺序，取每一张照片的局部，然后拼接起来，便得到一个名为时间切片的照片。\n2022 年 7 月份在梧桐山顶拍摄了一组日落时分的延时照片，并在后期导入电脑并使用 DaVinci Resolve 合成延时视频的时候，我突然想起一个朋友在 2013 年输出的一个时间切片照片。于是也想给我这组照片制作一个时间切片。\n后期制作时间切片是一道很复杂的工程（比如，可以参考这里），随着照片数目的增多，操作步骤会越多。在正式使用 Photoshop 尝试制作时间切片之前，我就直接有个想法，要不自己实现一把？\n事实上，使用程序来实现一点都不难：给一组照片排好序后，在一个大的画布上，依次取该照片特定的区域，然后绘制到该画布的同样的区域就能实现这种效果。最开始我是在 Android 上进行这块的测试，后来很快就完成并验证了效果的可用性。后来想了下，MyerTidy 虽然目前的功能只有「整理文件」，但它实际上是可以定位为一个「批量处理」的 app。\n最后便有了 MyerTidy v1.1.1 的更新（暂时只有 macOS 版本）。\n此版本带来以下的变化：\n\n重新设计的带响应式布局的首页，为未来支持更多批量操作进行前置的支持\n新增各个模式的功能介绍以及效果图\n支持「延时切片」功能，正如上文所说的，可以为你制作时间切片照片。在下文会做更详细的介绍\n进行了小部分重构和性能优化\n\n在首页选择了「延时切片」后，你便可以选择一个文件夹或者一组照片了，之后会自动进行预览渲染：\n\n \n默认的效果是，根据你的文件名升序排序，从左到右，不对图片进行采样来进行绘制。\n比如你有文件名为 TIMELAPSE_001.jpg 到 TIMELAPSE_100.jpg 的 100 张图片，会使用以下顺序从左到右来绘制：\n\n绘制 TIMELAPSE_001.jpg\n绘制 TIMELAPSE_002.jpg\n…\n绘制 TIMELAPSE_100.jpg\n\n效果如上。\n \n你可以点击「倒序处理」，来使用倒序的方式来从左到右绘制：\n\n绘制 TIMELAPSE_100.jpg\n绘制 TIMELAPSE_099.jpg\n…\n绘制 TIMELAPSE_001.jpg\n\n效果如下：\n\n \n如果你觉得你的图片太多了，想以固定的间隔来取一部分来绘制，那么可以在「跳过合成的数目」来输入你要跳过的数目 X。也就是，每隔 X 张，只会取一张来绘制。\n\n跳过的数目为 5 的情况下，每 5 张会选择第一张来绘制。\n对于上述图片，跳过数目设定为 50 的时候（原图片总数目为 654 张）效果如下：\n\n \n最后，上述的布局方式都是「水平布局」：图片以水平方向来进行绘制。\n你可以点击「垂直布局」，来开启从上到下的绘制模式，效果如下：\n\n此外特别注意的一点是，MyerTidy 目前不支持图片自动对齐。因此如果你的图片组因为前期拍摄的原因有部分图片对不齐，那么需要你先使用 Photoshop 等工具来前期做对齐（当然，相比做时间切片来说，应该不算太困难）。如果需求强烈，那么可能会调研并加入这块的支持。\n以上便是 MyerTidy v1.1.1 的更新。未来会专注 macOS 下对文件和图片的「批处理」的实现，目前期望会做的下一个大功能便是对文件按照特定的规则批量重命名（比如整理番剧之类的，会很有用），也在思考是否可以加入类似「星轨合成」这样的功能。\n你可以通过 App Store 搜索 MyerTidy 来进行下载。如果你有什么想法和反馈，欢迎留言。",
          "link": "https://sspai.com/post/75909",
          "publishedOn": "2022-09-25T08:13:58.000Z",
          "wordCount": 530,
          "title": "MyerTidy 新版本上新：支持合成「延时切片」功能",
          "imageUrl": "https://cdn.sspai.com/2022/09/25/6e4b56b8da216b716126800b3746ada0.jpg"
        },
        {
          "id": "https://sspai.com/post/75897",
          "author": "善宝橘",
          "description": "1. 两个让我困惑的迷思\n在双链笔记兴起后，PKM 领域一直热衷于谈论知识与知识间的联系构建。于是我们经常听到一种流行的讲法：我们的思维方式是网状的，笔记也应如此，传统的文件夹与目录分类已是旧时代的产物。\n这种讲法忽视了两个前提：\n并不是所有人都有能力在知识间构建联系，尤其对于一个领域的初学者来说；\n大脑神经元虽然以网状的形式呈现，但人类的思考方式本质上仍然是结构化的；\n20 世纪 50 年代，芝加哥大学教授布鲁姆提出教育目标分类理论，该理论将人类对于知识的认知分为了六个层次：\n\n记忆：对具体事实、概念、术语的回忆；\n理解：能够对知识进行转换、解释和推断；\n应用：在实际情景中运用知识；\n分析：将所学材料分解，明白各部分间的联系；\n评价：基于对知识的理解，对知识的价值进行有效判断；\n创造：将组成知识的各部分要素重新加工，产生新的模式或结构；\n\n按照布鲁姆的分类理论，知识间如果要产生关联，对于知识的认知必须要达到分析的层次。在实际应用中，我们也许可以跳过记忆和应用，将认知过程的前四步简化为理解->分析，然而这仍然要求我们对知识有充分的吸收和了解。\n以语法为例，若我们想要厘清中、英文之间的差异，则必先以其中一种语言作为理解的锚点。对一方的语法有所了解后，才可借此反思与另一方语言的相同、区别。\n如此，作为一个初学者，若对两种语言皆不通晓，自然很难有相互关联的能力。再者，一个领域本身有其自身的框架，初学者面对新知尚且招架不住，更遑论还要再负担额外的功夫去思考相关性。\n更令人困惑的迷思在于，当我们谈论联系时，我们总是通过网的比喻来形容知识的关联性。\n\n                                    you never know what is the meaning of this picture\n发轫于 Roam Research 的页面图谱，如今成了一部分人…",
          "link": "https://sspai.com/post/75897",
          "publishedOn": "2022-09-24T07:11:00.000Z",
          "wordCount": 605,
          "title": "PKM 又一年，我的困惑与心得",
          "imageUrl": "https://cdn.sspai.com/2022/09/24/41621528b4cca6ad0d73e2acca45918f.png"
        },
        {
          "id": "https://sspai.com/post/75858",
          "author": "Theia在路上",
          "description": "在这个大众觉醒的时代，我们常常听到「我们需要探索自我，了解自己」。但是，假设我们很粗暴地把人分为三种：认为不需要寻找自我的人（或不知道「寻找自我」重要性的人）、正在寻找自我的人、以及找到了自我的人，第一类人是绝大多数，第二类是少数，第三类是少数中的少数。\n这其实也对应了我们认识自我的三个阶段。\n第一阶段是我们需要觉醒，意识到探索自我的重要性。\n为什么探索自我对每个人都很重要？\n人是需要意义驱动的动物，我们天生有实现自身价值的冲动。但每个人的价值、优势是不同的。我的性格是怎样的？我想做的事情是什么？对我来说，什么最重要？我未来的方向是什么？我想过上怎么样的生活？我的价值实现在哪？这些问题如果得不到解答，短短一生很容易忙忙碌碌、随着大流就这样过去了，实在可惜。\n项飙在《把自己作为方法》中说：\n\n（瓶颈的问题）是回到自己作为一个边缘者、回到我是谁的问题。想清楚究竟我能做什么，我跟世界的关系是什么。我认为世界上所有的人都有这个问题，都得搞清楚自己是谁，否则都会有这种危机，除非完全盲目地被主流裹挟进去。\n\n当我们意识到探索自我的需求之后，我们还需要方法，这就来到了第二阶段——开始寻找自我。但我感觉，很多人对于探索自我的方法却没有什么头绪。\n困难之处，在于「自我」是非常复杂的，我们之所以是今天这样，受到了童年经历、社交媒体、朋友亲人、国家文化等等各种因素的影响，这些影响之中大部分更是在日常不知不觉之中就成为了我们的一部分，所以无论是从横向（各种因素的复杂性）和纵向（性格和价值观形成过程的复杂性）看，自我都是极其复杂的。\n但好在，这几年通过各种各样的渠道和自证，我积累了一些有用的、可执行的方法，想在这里分享给你。\n再多读几本书\n阅读有什么用呢？学习知识肯定是好处之一，可是看完可能就忘了；拓展眼界也是的，可是没去亲身经历还是差了一点。\n那最大的用处是什么呢？我认为， 是读自己。\n在《活下去…",
          "link": "https://sspai.com/post/75858",
          "publishedOn": "2022-09-23T02:15:33.000Z",
          "wordCount": 528,
          "title": "探索自我是一条漫长的路",
          "imageUrl": "https://cdn.sspai.com/2022/09/21/eb77593e76fd2723f1289768ee243036.png"
        },
        {
          "id": "https://sspai.com/post/75709",
          "author": "hkoch24",
          "description": "个人日程管理的需求\n在选择日程管理的形式或者app的时候，我的要求很简单：即先确定需求，再按照需求探索日程管理方式。我对日程管理的需求有几点：\n\n任务与日程要在同一个页面；\n尽可能随手拿起就能使用；\n有较大的自由度，即可以根据个人需求添加备注等；\n要能够自上而下地「俯视」整个日程管理过程；\n随时可以逃离。\n\n根据这几点需求，我开始了自己的日程管理尝试1。\n日程管理尝试\n1. 纸质日程本\n本科时期，还在用着黑莓9790、z10等一些「非主流」手机，他们没办法与电脑形成一个良好的生态系统，所以没有习惯用他们来做日程管理，而是使用传统的纸质日程本。\n当时，已经在用Moleskine的单行笔记本做日记本，对M家的本子很有好感，尤其是口袋本，非常便携。出于一种仪式感的传承，我开始尝试M家的周记本：本子摊开，左边是一周的日程记录，可以记录有确定时间的日程，也可以记录只固定日期的日程；右边是一整面的横线页面，可以写下一些备忘事项，例如可能需要本周或者下周要做的事情等，也可以记录本周的一些打卡事项。\n\n后来尝试了M家特有的400页超厚日程本，一天一页，每一页都是当天从8点到22点的日程记录。本子非常厚，携带有点不方便；记录是方便许多，能写的位置也多了很多，但因为不是每天都有排满的日程，一些琐事写进去也没意思，最终本子留了许多空，总感觉有点浪费，尤其是年终总结的时候觉得似乎是虚度了时光一样。\n\n后来也尝试过MUJI的月记本，但是总感觉没有周记本好用，我便回归Moleskine的周记本，直到我后来舍弃它。\n2. 手机自带日程管理工具\n舍弃纸质日程本的原因有两个：\n\n设备和系统升级了，从「非主流」机升级到了带有安卓系统的Blackberry Keyone，自带的日历强大了很多；\n当时正在读研究生，我们的课比谁都多，每天都被课程排满，而这些课程都写进纸质笔记本里不太可能，只把课程外的待办事项写进本…",
          "link": "https://sspai.com/post/75709",
          "publishedOn": "2022-09-22T05:26:19.000Z",
          "wordCount": 532,
          "title": "日程管理 with Firstseed Calendar",
          "imageUrl": "https://cdn.sspai.com/2022/09/21/e34a123795319a6d562d3dcad16b2a1a.jpg"
        },
        {
          "id": "https://sspai.com/post/75841",
          "author": "CLU",
          "description": "上一篇《exping：一个地图创作工具是怎么诞生的？》 和大家分享了 exping 的诞生故事后。感谢大家的支持与建议，也感谢少数派的推荐，让更多的人认识了 exping ，其中也有投资人、媒体关注到了我们。这是意料之外的收获。时隔3个月，我们有了许多的变化与提升。在这段时间里，也有更多的机会去接触用户，进行深入的交流，从中也更清晰我们的产品定位，以及我们的使命。\n「地图」就像一张画布，是另类的创作载体\n从地图诞生以来，大家对地图的认识，更多是作为「导航指引」用途。其中涉及了不少的学科，如「地图学」、「地理学」、「测绘学」、「遥感技术」等等。根据地图的应用场景，结合这些学科专业，绘制不同的专用地图。\n因此，地图创作对大家来说似乎需要有一定的专业要求。而 exping 的诞生始于让每个人可以轻松、容易地呈现自己的品味地图。地图就像一幅画的画布，一个另类的创作载体。（欢迎看看小编写的文章《emoji + 地图 = exping》）在此之上以标记「点」，绘制「路线」，表达基于地理位置上的故事。「地图」作为重要的画布，重点在于可塑性，如何帮助创作者对地点进行多样性的表达。那或许一般的地图不足以满足这些需求，借此，这次我们和设计师聊聊，exping 专属地图的一些设计心路历程。\n \n\n作为 exping 的设计师，你怎么理解 exping？\n当大家还在以图文的方式分享一个好地方的时候，exping 开始将地图作为主视角。 Explorer 可以方便快捷地添加去过、计划要去的地方以及设计路线，简单或隆重地补充对该地点的评价，上传相关照片。\n通过这种更直接的方式，将你的数据传递给你的观众，大幅度减少了“这是哪里？”，“我也想去”，“环境怎么样？”等问答游戏。\n在这之前，exping 的地图风格是怎样的？\n在 exping v0.1~0.3 的地图风格从 Light （简约）到 Stree…",
          "link": "https://sspai.com/post/75841",
          "publishedOn": "2022-09-21T04:36:13.000Z",
          "wordCount": 582,
          "title": "和设计师聊聊，exping 专属地图是如何设计？",
          "imageUrl": "https://cdn.sspai.com/2022/09/21/614d44f49dd37dfe145e8ff4c2999411.jpg"
        },
        {
          "id": "https://sspai.com/post/75833",
          "author": "一克",
          "description": "阅读初衷\n平时一无聊下来，偶尔会通过消费购物，来提起自己的生活兴致，买东西从挑选，到想象自身使用场景，再到下单盼望着快递，最后拆封这个过程，能在很长一段日子里给自己提供着生活的兴致。而有些时候，反省下觉得单纯是无聊想买买买，而不是使用需求强烈促使我去购物。自觉这种动机是不健康的，同时也很好奇为什么有这种心理，于是便在网络推荐下接触到了这本书——《超市里的原始人》，想借此机会，弄清楚什么是消费主义，对我这种自以为不健康的消费行为如何解剖。\n从看到书名中的「原始人」开始，我就期待着书中内容将追根到底消费的欲望最原始的动机是什么。首先需要引用一下在生物学中对人作为社会性灵长类动物特点的描述：\n\n人类在进化过程中形成了许多小范围的社会集体，身在其中，你的形象和地位就是至关重要的，这已经不仅仅是为了满足生存的需求，还是为了吸引伴侣、娱乐朋友和抚育后代。\n\n消费这件事情之所以扯到这么遥远和深层的角度呢，是因为作者主张需要从进化心理学的角度才能透彻地了解消费主义的根源，消费者虽然会半自觉地设法炫耀出财富、地位和品味，但真正想要展现的是更深层次的心理特质（比如善良、智慧和创意）和生理特质（比如生育能力、强壮、美貌）。\n《超市里的原始人》中的三个关键论点：\n\n人试图展示自身特质的本能与消费主义关系紧密。\n我们用于识别关键人类特质和情感的社交感知系统经过漫长的进化历程变得准确高效，能将所有能收集到的不同暗示聚集起来，察觉出一个人的身体、脸部、语言和行为。\n消费主义在很大程度上就是一种画蛇添足的行为。我们得到了有惊人适应力的人类自我展示的能力，即语言、智慧、善良、创造力和美丽，然后却忘记了如何用它们来结交朋友、吸引配偶和获取声望。相反，我们却依赖通过教育、工作、消费获得的商品 和服务来向他人展示自己的个人特质。这些高成本信号大都是多余的或是误导性的， 所以别人通常都会对其视而不见。\n\n消费主义中…",
          "link": "https://sspai.com/post/75833",
          "publishedOn": "2022-09-20T06:03:03.000Z",
          "wordCount": 519,
          "title": "当隐约感觉我的消费行为不对劲时——《超市里的原始人》札记",
          "imageUrl": "https://cdn.sspai.com/2022/09/20/bb8cfd48fe8d7ca5fdde06fc80fb3edb.jpg"
        },
        {
          "id": "https://sspai.com/post/75803",
          "author": "猴猴说话",
          "description": "你用过人工智能写作工具吗？前两个月，我看到了一些AI写作工具推出了文章续写功能。\n\n只要你写上一篇文章的开头和结尾，智能系统就能自动生成一篇完整的文章。虽然现在技术还不成熟，积累的样本数据还不够完善，写出的内容还是会被挑剔，但是我总感觉排布好内容逻辑是迟早的事情。\n在那个时候，AI就能代替我们写作吗？\n作为内容创作者，我们还有活路吗？现在能帮人进行AI写作的工具有很多，从媒体报道、工作汇报这些角度看，人工智能会逐步替代人工写作。它只追求客观报道和逻辑推导，但无法完成偏主观价值判断的内容生产，因为AI不能代替的是我们对内容的「审美」。\n人工智能与审美\n前段时间AI绘画掀起了一阵火热，只要输入一些文字和句子，表达画的风格和内容，AI就能自动生产出一副艺术作品。有的画真的能与大神媲美，吊打国内外大部分艺术工作者。但是，这里的问题是，这个作品从「点子」到「作品」之间，完全忽略了过程。\n怎么判断一个作品已经做到最好了？还能不能更好？这一笔触能不能再调一调？那一个色块能不能再深一些？如果单独抠几个细节，那是调整，如果从头开始就抠细节，那就是「创作」。\nAI写作能根据你前面写的一个词、一段话，自动生成出后面的句子和篇章，但是它对于一个真正想表达的人来说，生产出的段落总会让人差强人意，甚至因为一个字的误用就导致表达结果与表达目的南辕北辙。\n说到底，AI写作只能成为我们的工具，是基于创作者的审美的工具。倘若作者的审美和沉淀不够，反而会出现被工具主导，甚至被代替的困境。如同普通人去使用AI绘画一样，对绘画细节失控，除了标题能自己把控，后面的笔触、构图、用色等细节都和自己无关。如果我们本身就懂绘画，那么还可以去微调，但当我们什么都不懂的时候，剩下的只有无尽的赞叹。通过AI生产出了一个远超自己能力范畴的作品，或者说，它远远超出了我们对作品的审美极限。所以，无法对它进行细节的判定。\n就如同我们在写作…",
          "link": "https://sspai.com/post/75803",
          "publishedOn": "2022-09-20T03:09:38.000Z",
          "wordCount": 496,
          "title": "当 AI 能代替我们写作，我们还有什么？",
          "imageUrl": ""
        },
        {
          "id": "https://sspai.com/post/75822",
          "author": "人形睿",
          "description": "与其说双链是笔记软件，不如说他们是知识管理软件或思维工具。而这个认知上的错位便是导致目前双链饱受争议的原因之一。\n\n双链是个伪概念？\n双链笔记软件目前的争议不少，大家对其的批判也非常实际，可谓是针针见血：\n\n双链的底层逻辑尚未普及，用户无所适从。链接有什么用？哪些应该链接？\nnotion、语雀、印象笔记都能一定程度上双向链接各种文章。虽然稍微简化了一些，但好像也能用啊。\n界面太“硬核”了，不优雅，不美观，基本没有办法给别人看。\n没有办法共享和协作。\n导出十分麻烦，有时候还要靠插件。\n各种命令、快捷键、插件，学习成本高。\n代码程度较高，没有代码基础的人被劝退。\n知识图谱功能基本只是用来装逼，东西一多基本没法看。\n\n可以发现，当我们以“笔记软件”的角度来看待双链，它和目前各种成熟的笔记软件相比差太多了。看着甚至像尚未完成就拿出来给人用的Alpha版本软件，非常粗糙，体验极差。\n但是，如果我们换一个视角，以“知识管理软件”和“思维工具”的角度来看待双链，结果可能会完全不同。而我认为这才是双链的核心优势。\n双链的核心优势——知识管理和思维辅助工具\n1、信息颗粒度更细，便于细化和延展\n个人认为，信息粒度是双链笔记最核心的优势。比起印象笔记以\"篇\"为单位、notion以“块”为单位，双链笔记是以“点”为单位。这就以为着，我们可以将大块的知识细化为一个个相对独立的知识点。同时，在细化的过程中，我们逐渐把各个知识点从原有的语境中解放（抽象）出来，进而形成能够在长时间的考验下保留下来的知识。这样，当日后遇到新的情景的时候，我们也能迅速知识结构，以支持新的目标。\n\n具体而言，以roam research为例，在使用过程中，你任何时候都可以用 [[]] 来关联另一个概念或者页面，或用 (()) 来关联一个句子或一个块。\n2、记录成本低\n大部分双链笔记都是基于大纲笔记的，即整体的框架类似于bull…",
          "link": "https://sspai.com/post/75822",
          "publishedOn": "2022-09-20T03:03:18.000Z",
          "wordCount": 490,
          "title": "双链笔记是伪概念？聊聊双链的核心优势——知识管理",
          "imageUrl": "https://cdn.sspai.com/2022/09/19/94f4c9326acaa41dccd8faa88b7bbaa4.png"
        },
        {
          "id": "https://sspai.com/post/75828",
          "author": "John",
          "description": "在正式开始说体验前，先谈谈索尼在 9 月初正式发布的全新真·小屏旗舰——Xperia 5 IV，在设计上融合了 Xperia 1 系列的特点，总算是更换了硬朗的边框以及磨砂质感的后盖玻璃，可以说完全契合个人的审美爱好，更不用说破天荒加入了无线充电，我对 Xperia 5 III 最不满意的两点都解决了，还有什么理由不买呢？加上最近在各种视频网站看到关于 Xperia 1 IV、5 III 等机器的吐槽，于是就想在 5 IV 到手前，和大家分享一下我的使用体验。\n为何购买 Xperia 5 III\n说起来在今年入手 5 III 之前，我在用的是三星 Galaxy S22 Ultra，S22U 真的什么都好，拍照、系统啥的我都挺满意，而且外观更是延续了曾经最爱的 Xperia XZ Premium 的神韵，当时一发售就冲了。只是在实际使用时，总会觉得这机器实在是太大了，单手用太累，可我又不像当年用黑莓 Passport 那样充满喜爱，对其体积无下限容忍，于是乎就又考虑换台趁手的小屏旗舰机器。\n然后说起现在的小屏机器，基本上没得选，iPhone 就只有 SE 和 12、13 mini，Android 这边能看上眼的就是魅族 18、Galaxy S22 和 Xperia 5 III。综合来看，12、13 mini 因为刘海直接 pass，SE 电量实在担忧，魅族 18 不防水也 pass，只能让 5 III PK S22。作为一个曾经的 Xperia 5 用户，对于 5 III 可以说是完全不担心，唯一的问题就是臭名昭著的火龙 888，但 S22 用的是 8 Gen1，这对卧龙凤雏就随便吧，毕竟我都能接受 S22U 的 8 Gen1 了。最后特意跑去三星官方店实际上手体验 S22 的感觉，由于 S22 70.6mm 的宽度握持时有点撑手不舒服，于是乎 68mm 宽度的 Xperia…",
          "link": "https://sspai.com/post/75828",
          "publishedOn": "2022-09-19T16:31:19.000Z",
          "wordCount": 750,
          "title": "写在 Xperia 5 IV 到手前，我的 Xperia 5 III 体验",
          "imageUrl": "https://cdn.sspai.com/2022/09/20/1528338ded5332b25ded04ff431aa921.jpg"
        },
        {
          "id": "https://sspai.com/post/75799",
          "author": "Journey",
          "description": "Matrix 首页推荐 \nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。\n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\n我是一个拥有七年工龄的年过三十的打工人，base 在北京。\n工作的前五年，我任职于一家外企。凭借着年轻和朝九晚六，工作的大多数时候我都能轻松应付，并没有把运动当回事儿。工作五年后我跳槽到了互联网行业，工作强度和工作时长陡增，对体力和精力都有了新的考验，因此运动也不得不提上了日程。\n但是运动这件事只有想法是没办法做成的，我花了一年多的时间断断续续走了很多弯路。三天打鱼两天晒网经常发生，一下子荒废半个月的情况也并不少见。而最终让我养成运动习惯的是我狠下心氪金，配齐了各种运动辅助工具，并在各种工具的综合作用下，让运动成为了我生活习惯。\n此文写作时间为 2022 年 9 月 19 日，我刚刚收到了 Apple Watch 发送给我的「最坚持奖 - 22 天」的奖章。一个习惯的养成需要 21 天，这个奖章也让我动了念头，想把这个过程分享出来，于是就有了这篇文章。\n2022 年 9 月 19 日 收到最坚持奖 22 天\n我的典型一天：工作日运动\n时间选择\n工作日大家都疲于奔命，很难抽出大块时间来专门运动。所以选择适合自己的运动时间很重要。\n我首先尝试的是下班后跟着 Keep App 来做一些运动。但是遇到了两个阻碍：一个是下班时间不固定，有时候到家已经九点多了，不方便再做剧烈运动，会直接影响睡眠质量；另一个是有时候晚饭吃了比较多的主食，所以整个人头昏脑胀的，大多数时候只想躺着刷剧，并没有意志力再爬起来。\n然后我尝试了在中午的时间运动。我会早十五分钟锁定电脑屏幕赶去健身房，并点好一个定时派送的外卖（运动完后食堂已经关门）。这样实行了快半年时间…",
          "link": "https://sspai.com/post/75799",
          "publishedOn": "2022-09-19T06:47:21.000Z",
          "wordCount": 670,
          "title": "我是如何用工具组合养成运动习惯的",
          "imageUrl": "https://cdn.sspai.com/2022/09/19/d0362c2ee19bc83bee8387af52e98e2e.jpeg"
        },
        {
          "id": "https://sspai.com/post/75783",
          "author": "玉树芝兰",
          "description": "前些日子，我给你介绍了本地使用 Stable Diffusion 人工智能绘画工具的方法（如何在你的 M1/M2 Mac 本地运行 Stable Diffusion？）。不少小伙伴们反馈说玩儿得很开心。\n\n不过也有不开心的，因为手头儿没有 M1/M2 的 Mac 电脑。\n\n是不是因为设备限制，就只能眼巴巴看着别人体验新科技成果呢？\n当然不是。人工智能技术的普及化，已经是科技发展的潮流趋势了。我今天给你介绍一个不需要安装任何应用的体验方式。而且，更好的消息是，你都不用把自己的想法翻译成英文了，直接输入中文就行。\n这是个微信小程序，叫做「盗梦师」。开发者是西湖大学蓝振忠老师团队。\n我这里给你做个演示。\n今早我看到有人分享了一段视频，是喷气式背包的实验场景。很有意思。\n\n于是我就在朋友圈发了一番感慨：\n\n有了这玩意儿，上班堵车不是事儿了。\n\n感慨之后，觉得光用文字表达不够形象，刚好就可以用「盗梦师」画出来。\n于是我打开小程序，输入了这样一段话：\n\n一个背着喷气式背包的中年人在交通拥堵的马路上轻松自在飞行\n\n这里注意你可以选择绘画的类型。我选择的是「赛博朋克」，我觉得和主题很搭。\n\n然后是选择画家风格。我对赛博朋克艺术家不了解，于是设置成为「不限定」。\n\n下面还有一个选项，是画面的长宽比例。我觉得对于展示的画作来说， 16:9 感觉上比较好。\n好了，做了这些设定后，就可以直接画了。\n\n这里需要等上几秒钟即可，比本地 M1 Mac 运行起 Stable Diffusion 来快多了。画做好了，你感觉怎么样呢？\n\n有了这样的形象画面，朋友圈里的评论一下子就丰富了起来，例如：\n\n假发套得粘的紧一点\n\n以及：\n\n当姑娘们画好了妆，做好了头发，美美的在街上走着，然后突然被人用喷气背包的风吹乱的时候，你猜她们会不会捡石头把它打下来\n\n我觉得，这些担心，都不无道理，值得背包开发商们认真记录和讨论。\n如果你感兴趣的话，直接打开微信，搜索这个小程序试试看吧。上文图中也包含了二维码可以直达。目前阶段，每天有 5 次免费创作机会。然后每分享给一位好友，双方可以获得 20 次创作额度。\n当然，我也尝试了一些其他的图画，例如中国风的「雪中山寺古钟」。\n\n雪、山都齐全了，只是寺庙在哪里？找了半天没看到，哈哈。如果你玩儿过 Stable Diffusion ，应该知道很多时候你需要多画几张，从中选择更合适的图画。所以我准备等明天有了新的额度，再用同样的文本，多画几张对比看看。\n欢迎把你的尝试结果和经验心得分享到留言区，咱们一起交流讨论。\n祝人工智能绘画愉快！\n如果你觉得本文有用，请充电。\n如果本文可能对你的朋友有帮助，请转发给他们。\n欢迎关注我的专栏「科研利器」，以便及时收到后续的更新内容。\n  \n \n延伸阅读\n\n【知识星球精选】刻意练习区的辅助线\n“没有灵魂” 的 AI 文本生成，有啥用？\n可视化卡片笔记写作？我试了最近才开放的 Heptabase\n大块的写作时间？这个时代，它是奢侈品\n互联网上的时光机器",
          "link": "https://sspai.com/post/75783",
          "publishedOn": "2022-09-18T03:44:08.000Z",
          "wordCount": 521,
          "title": "如何免费用微信小程序中文 AI 绘画？",
          "imageUrl": "https://cdn.sspai.com/2022/09/18/0dcfda33859af6cf3caed4de8194ca20.jpeg"
        },
        {
          "id": "https://sspai.com/post/75781",
          "author": "闲者时间_王掌柜",
          "description": "打算开一个新的系列「Obsidian 综述」，不同于「玩转 Obsidian」系列，「综述」更关注 Obsidian 的功能和插件的使用，而「玩转」系列更成体系，它们的区别：\n\n综述系列重点在「介绍」，针对 Obsidian 近期的新功能、新插件、新主题进行体验。并在使用过一段时间之后，进行简单的介绍和归纳。\n玩转系列重点在「方法论」，是在吃透了「综述」内容之后，结合自己的体验进行总结和提炼。\n\nv0.16 重磅更新\n最近 Obsidian 重磅发布了 v0.16 ，当然目前还属于「内部预览」版，只有付费支持的用户才能体验，不过大家也不用着急，通常「公开版」也不会等太久。\n最大的升级是「重新设计了 Obsidian 的界面」带来了「标签组」等重磅功能，官方内部对这次新 UI 称为 Dragonglass（龙晶），从体验上看完全颠覆了从前我对 Obsidian 界面和易用性上的感知，贴几张个人使用的图大家感受一下：\n\n这次 UI 升级是重头戏，本篇不会事无巨细的介绍所有升级点，我会挑选几条个人最满意的地方跟大家展开介绍，如果您想了解本次所有升级功能可以参考官方文档：\n\n中文介绍\n英文介绍\n\n工作区支持「标签组」\n本次升级引入了「标签组」概念，「标签组」简单理解，就像我们在「浏览器」上使用「标签组」一样，在 Obsidian 中通过多个「标签组」每个组多个「标签页」，可以较大限度的实现「平铺散列」的阅读方式，如图：\n \n\n「标签组」的优势在于一方面我们可以通过快速切换「标签组」内的不同「标签页」，提高「信息摄入速度」；另一方面「标签组」也极大拓展了我们打开「笔记」的数量。这两点优势在「整理知识」和「创意输出」的时候非常有用。\n在升级前我们只能采用「下图」中的方式打开多篇「笔记」，这种方式最大的问题是「最多同时可以看到 2篇笔记全貌」，如果想要看到更多需要将笔记拖拽到「中间区域」…",
          "link": "https://sspai.com/post/75781",
          "publishedOn": "2022-09-17T17:39:57.000Z",
          "wordCount": 682,
          "title": "Obsidian 综述 - 新 UI 新征程（v0.16 发布之际）",
          "imageUrl": "https://cdn.sspai.com/2022/09/18/9dc96a22ac7544635050e9bcb38541a5.jpeg"
        },
        {
          "id": "https://sspai.com/post/75769",
          "author": "雪伊莲梦璃",
          "description": "小众消息的冯大辉前两天推送了一篇很有意思的文章，大概是探讨一个B站视频对微信存储机制可能存在的误解。文中提出了一个实验方法，看到做了试验可能会有奖品，我眼睛一下放光，不如就趁此机会做几个试验，好好探讨一下微信在iOS上的文件存储机制，包括：\n\n转发文件是否会占用额外的存储空间？\n从同一人处多次接收同一份文件是否会占用额外的空间？\n从不同人处多次接收同一份文件是否会占用额外的空间？\n微信和WeChat在以上这些问题上是否存在差异？\n同一台手机上的不同微信账号接收的同一文件是否占用额外存储空间？\n\n试验的环境是iOS 14.8.1、iPhone 11、微信8.0.28。首先我们删除手机上的微信重新安装。登录一个WeChat小号（小号A）。此时微信占用的空间是少的可怜的752.2MB，其中数据占244.5MB。我提前准备好了一个Ubuntu的iso镜像（880MB）。将它发送给这个小号。下载后重启手机，可以看到，微信占用的空间变成了1.77GB，其中数据占1.26GB。多出来大约1GB的空间，可能是除了文件以外的缓存、其他需要的程序和资源文件。\n接收文件前后的微信\n接下来我们正式开始实验。我们讲接收到的文件转发给三个不同的小号。重启手机，可以看到，如冯大辉所料，微信所占用的存储空间并没有增加。依然是1.77GB（数据1.26GB)。微信显然做了最基本的文件存储去重。\n所占空间没有变化\n接下来，我从另一个微信号将刚刚发送的文件再次转发给小号三遍。当我点进新发送的文件时，看到需要接受文件，我有一种不详的预感。难道微信真会重新接收一遍文件？所幸，当我点击接收文件后，文件在一瞬间就接收完成了。显然，微信也伴有服务器端的去重，在服务器上的同一份文件，在本地并不会接收多次。重启手机也可以看到，微信占用的空间并无增加。\n看似要重新接收，实际所占空间没有明显变化\n按照这个逻辑，即使是不同的人转发给我的同一份文件，应该也不会需要重复下载，或是占用额外的空间。我试着用另外两个小号（小号B、小号C）将同一份文件转发给小号A。虽然也显示需要接收文件，但同刚才一样，一瞬间就完成了接收。再次重启手机，微信所占用的空间依旧没有变化。\n不过，刚才验证的情况中，虽然是多个账号转发给一个小号，但是微信很容易在服务器端追溯到，这些文件的源头是同一个。那假如各个账号是各自上传的同一份文件，微信在服务器端是否也有去重能力呢？为此，我在另一台小米手机上登录小号B与小号C，各自发送同一份文件给小号Ａ。发送文件的时间较长。这似乎足以让人判断出，微信大概没有类似百度网盘的文件去重判断。\n然而出人意料的是，小号A还是一瞬间就完成了文件的接收。重启手机后也可以看到，微信所占用的空间并没有明显增加（总计1.83GB，数据1.32GB）。这说明至少在服务器端，微信确实能够判断出一份文件是否曾经上传过。而缺少类似网盘的秒传功能，可能是微信本身没有相关功能，也可能是Android端微信需要优化。\n实际所占空间依然只有一份文件大小\n出于好奇，我又尝试从小号B发送一份内容相同，只有文件名不同的文件，看看微信的查重是否基于文件名，或是基于文件本身。经过等待漫长的发送，如我所料，接收只在一瞬间就完成了。由此可知，微信的文件去重基于内容，并不依赖名字。\n不同文件名也不会多占用空间\n上面测试的都是同一账号下的情况。那么，同一台手机上的不同账号间又是怎样呢？我尝试在刚刚登录小号A的手机上切换了一个微信账号B。可以看到，这次转发收到的相同文件，需要重新接收下载。重启手机也能看到微信的占用空间变为3.8G（数据3.29G）。不过在这一微信账号下，同一文件仍然只需要下载保存一份，再次收到就能秒存。同时利用这个微信账号简单试了一下，我发现以上WeChat的文件存储机制对微信也同样成立。\n实打实地需要下载，所占空间也倍增了\n到这里，我们可以基本得出结论，iOS的微信文件存储去重做得还是比较令人满意的。同一账号下的同一个文件，只要内容相同，就只会在本地留存一份。未来微信团队可以努力的方向是不同账号间的文件存储去重。\n另外值得一提的是，微信大概是真的有在代码层面实现去重，而非依赖APFS的CoW特性。因为即使只占一份空间，iPhone在统计容量时也会重复计算一个文件的多次拷贝。通过多次复制粘贴同一份文件，你能很容易地复现苹果的这个Bug：\n苹果什么时候出4T iPhone？\n在我原本的设想中，我写出这篇文章后，与其拿到那500元钱，我更想获得一个与Fenng交流的机会，说服他微信是一个糟糕的产品。但转念一下，即使我做到了，也并不能改变得了微信这个产品本身，以及我们必须使用它的环境。更何况再一看那篇文章，是要证明微信没有去重才能拿到那笔钱。是我审题不细了😀\n\n如果你觉得我的这篇文章不错，也欢迎你阅读我之前有关微信的两篇文章：虎头蛇尾的《微信戒断实验》与尝试减少微信占用空间的《微微微信怎么办》。",
          "link": "https://sspai.com/post/75769",
          "publishedOn": "2022-09-17T15:03:28.000Z",
          "wordCount": 490,
          "title": "试探索iOS微信文件存储机制",
          "imageUrl": ""
        },
        {
          "id": "https://sspai.com/post/75751",
          "author": "Krrrrrik",
          "description": "Spotify 可以说是少数派中无所不知的一款音乐软件，简洁克制的界面设计和无干扰的听歌体验吸引了不少听众。但是一直以来，Spotify 在 Android 上算不上有特别好的体验。尤其是一直没有修复的手势条沉浸问题，一条黑色的底边让人感到非常膈应。Spotify 似乎也没有做Light Mode 的打算，如果能有个亮色主题也会非常好看。\n来源：@酱紫表\n⚠️使用该 App 需要有 Spotify Premium\nIntroducing to New redesign Spotify: Jetispot\n\n打开应用的第一个界面，我就已经被吸引到了。这些控件按钮都有十足的“原生”的味道\nWelcome to Jetispot!\n开始体验一下全新风格的 Spotify\n登录后，可以看到主界面和Spotify的基本排布类似。Navigation Bar 上分为主页、搜索和资料库，右上角的三个小图标排布也相同。不过可以看到，作者还添加了两个分类标签：Music 和 Podcasts & Shows。我认为这是一个很实用的功能，毕竟谁也不想在公共场合打开后看到播客里显示一些很奇怪的东西 可惜这个App本身还未完成，这部分还不能正常使用。\n\n随意探索一下\n可以看到在搜索页面依然是大差不差。最明显的就是 Browse all 所有的卡片都用上了圆角。不过也能看到搜索栏功能还尚未实现。\n\n现在，我们来选择一个专辑看看\n可以看到在专辑页面中，背景色不再是原来的偏向于黑暗的页面。背景的渐变颜色是根据专辑封面来选取的，与 Spotify 相比感觉没有那么的压抑，整体显得很轻快明亮。\n\n选择一首歌来听听\n感觉加载速度和 Spotify 比起来没有很大的延迟，就是一个用起来不会因为加载不动而感到不舒适。不过这个音乐界面相对来说有一些简陋，上半部分很空旷。同时进度条也没有用上长得像蛇一样的波浪条👀\n\n还可以做的更好\n\n整体而言，我对 Android 上能有一个外观不错的 Spotify 第三方还是很满意了。\n毕竟 Spotify 连个手势条沉浸都不管\nJetispot 可以说是很好看，但绝对算不上稳定优秀。\n在我使用的过程中经常会偶尔遇到闪退和 Bug。而且这个软件很多功能尚未完成：搜索栏尚未支持，消息通知点无法使用，主页的筛选也无法使用，点赞的功能尚未实现，通知栏中的小图标也尚未适配。\n小图标的位置只有空虚⚪\n该 App 目前仍然在继续开发中。作者在 Telegram Channel 中还发布了正在制作歌词部分的预览。\n以下是作者在 Github 上的规划\n\nWhat's working:\n\nsign in (login/pass only, no FB/Meta/whatsoever support, no Smart Lock either)\n\"browse\", \"home\", album, premium plan, artist and genre screens (some of the blocks might be unsupported)\nlibrary: \"liked songs\" w/ tag&sort support, rootlist (liked playlists) + pins + artist/album support w/ nice animations, delta updates + pub/sub processing support\nbasic playback w/ Spotify Connect support (connect support is very WIP)\nfairly optimized R8 rules, providing approx. 5-6 megabytes release APK size (with the playback and protobuf parts!)\n\nWhat's in progress:\n\n\"Now Playing\" improvements\nbetter service (notification improvements)\n\n希望可以能够长久的发展下去，RIP for Xpo Music🙏\n你可以在 Github 或 Telegram Channel 免费下载使用 Jetispot。",
          "link": "https://sspai.com/post/75751",
          "publishedOn": "2022-09-16T07:28:05.000Z",
          "wordCount": 631,
          "title": "App+1 | Android 上更加好看的 Spotify ：Jetispot",
          "imageUrl": "https://cdn.sspai.com/2022/09/16/fe65a64116a42932c7cbf62aeb9c2356.jpg"
        }
      ]
    },
    {
      "title": "Opensource.com",
      "feedUrl": "https://opensource.com/feed",
      "siteUrl": "https://opensource.com/",
      "articles": [
        {
          "id": "70209 at https://opensource.com",
          "author": "Sachin Samal",
          "description": "165+ JavaScript terms you need to know\nSachin Samal\nTue, 09/27/2022 - 03:00\n\n            \nJavaScript is a rich language, with sometimes a seemingly overwhelming number of libraries and frameworks. With so many options available, it's sometimes useful to just look at the language itself and keep in mind its core components. This glossary covers the core JavaScript language, syntax, and functions.\nJavaScript variables\nvar: The most used variable. Can be reassigned but only accessed within a function, meaning function scope. Variables defined with var move to the top when code is executed.\nconst: Cannot be reassigned and not accessible before they appear within the code, meaning block scope.\nlet: Similar to const with block scope, however, the let variable can be reassigned but not re-declare…",
          "link": "https://opensource.com/article/22/9/javascript-glossary",
          "publishedOn": "2022-09-27T07:00:00.000Z",
          "wordCount": 2875,
          "title": "165+ JavaScript terms you need to know",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/code_javascript.jpg"
        },
        {
          "id": "70203 at https://opensource.com",
          "author": "Leigh Morresi",
          "description": "Get change alerts from any website with this open source tool\nLeigh Morresi\nTue, 09/27/2022 - 03:00\n\n            \nThe year was 2020, and news about COVID-19 came flooding in so quickly that everyone felt completely overwhelmed with similar news articles providing updates with varying degrees of accuracy.\nBut all I needed to know was when my official government guidelines changed. In the end, that's all that mattered to me.\nWhether the concern is a pandemic or just the latest tech news, keeping ahead of changes in website content can be critical.\nThe changedetection.io project provides a simple yet highly capable, open source solution for website change detection and notification. It's easy to set up, and it can notify over 70 (and counting) different notification systems, such as Matrix, M…",
          "link": "https://opensource.com/article/22/9/changedetection-io-open-source-website-changes",
          "publishedOn": "2022-09-27T07:00:00.000Z",
          "wordCount": 1716,
          "title": "Get change alerts from any website with this open source tool",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/browser_desktop_website_checklist_metrics.png"
        },
        {
          "id": "70212 at https://opensource.com",
          "author": "Gaurav Kamathe",
          "description": "OpenSSF: on a mission to improve security of open source software\nGaurav Kamathe\nMon, 09/26/2022 - 03:00\n\n            \nOpen source software (OSS), once a niche segment of the development landscape, is now ubiquitous. This growth is fantastic for the open source community. However, as the usage of OSS increases, so do concerns about security. Especially in mission-critical applications— think medical devices, automobiles, space flight, and nuclear facilities—securing open source technology is of the utmost priority. No individual entity, whether developers, organizations, or governments, can single-handedly solve this problem. The best outcome is possible when all of them come together to collaborate.\nThe Open Source Security Foundation (OpenSSF) formed to facilitate this collaboration. Ope…",
          "link": "https://opensource.com/article/22/9/openssf-open-source-software-security",
          "publishedOn": "2022-09-26T07:00:00.000Z",
          "wordCount": 1678,
          "title": "OpenSSF: on a mission to improve security of open source software",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/security-lock-cloud-safe.png"
        },
        {
          "id": "70208 at https://opensource.com",
          "author": "Richard Chambers",
          "description": "The story behind Joplin, the open source note-taking app\nRichard Chambers\nMon, 09/26/2022 - 03:00\n\n            \nIn this interview, I met up with Laurent Cozic, creator of the note-taking app, Joplin. Joplin was a winner of the 20i rewards, so I wanted to find out what makes it such a success, and how he achieved it.\nCould you summarize what Joplin does?\nJoplin is an open source note-taking app. It allows you to capture your thoughts and securely access them from any device.\nObviously, there are other note-taking apps out there—but apart from it being free to use, what makes it different?\nThe fact that it is open source is an important aspect for many of our users, because it means there is no vendor locking on the data, and that data can be easily exported and accessed in various ways.\nWe …",
          "link": "https://opensource.com/article/22/9/joplin-interview",
          "publishedOn": "2022-09-26T07:00:00.000Z",
          "wordCount": 2237,
          "title": "The story behind Joplin, the open source note-taking app",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/wfh_work_home_laptop_work.png"
        },
        {
          "id": "70199 at https://opensource.com",
          "author": "Seth Kenlon",
          "description": "Drop your database for PostgreSQL\nSeth Kenlon\nSat, 09/24/2022 - 03:00\n\n            \nDatabases are tools to store information in an organized but flexible way. A spreadsheet is essentially a database, but the constraints of a graphical application render most spreadsheet applications useless to programmers. With Edge and IoT devices becoming significant target platforms, developers need powerful but lightweight solutions for storing, processing, and querying large amounts of data. One of my favourite combinations is the PostgreSQL database and Lua bindings, but the possibilities are endless. Whatever language you use, Postgres is a great choice for a database, but you need to know some basics before adopting it.\nInstall Postgres\nTo install PostgreSQL on Linux, use your software repository. …",
          "link": "https://opensource.com/article/22/9/drop-your-database-for-postgresql",
          "publishedOn": "2022-09-24T07:00:00.000Z",
          "wordCount": 2681,
          "title": "Drop your database for PostgreSQL",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/lenovo-thinkpad-laptop-concentration-focus-windows-office.png"
        },
        {
          "id": "70205 at https://opensource.com",
          "author": "Raigor Jiang",
          "description": "How to build a dynamic distributed database with DistSQL\nRaigor Jiang\nFri, 09/23/2022 - 03:00\n\n            \nDistributed databases are common for many reasons. They increase reliability, redundancy, and performance. Apache ShardingSphere is an open source framework that enables you to transform any database into a distributed database. Since the release of ShardingSphere 5.0.0, DistSQL (Distributed SQL) has provided dynamic management for the ShardingSphere ecosystem.\nIn this article, I demonstrate a data sharding scenario in which DistSQL's flexibility allows you to create a distributed database. At the same time, I show some syntax sugar to simplify operating procedures, allowing your potential users to choose their preferred syntax.\nA series of DistSQL statements are run through practica…",
          "link": "https://opensource.com/article/22/9/dynamic-distributed-database-distsql",
          "publishedOn": "2022-09-23T07:00:00.000Z",
          "wordCount": 3731,
          "title": "How to build a dynamic distributed database with DistSQL",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/BIZ_darwincloud_520x292_0311LL.png"
        },
        {
          "id": "70200 at https://opensource.com",
          "author": "Seth Kenlon",
          "description": "Install JDBC on Linux in 3 steps\nSeth Kenlon\nFri, 09/23/2022 - 03:00\n\n            \nWhen you write an application, it's common to require data storage. Sometimes you're storing assets your application needs to function, and other times you're storing user data, including preferences and save data. One way to store data is in a database, and in order to communicate between your code and a database, you need a database binding or connector for your language. For Java, a common database connector is JDBC (Java database connectivity.)\n1. Install Java\nOf course, to develop with Java you must also have Java installed. I recommend SDKman for Linux, macOS, and WSL or Cygwin. For Windows, you can download OpenJDK from developers.redhat.com.\n\nMore on Java\nWhat is enterprise Java programming?\nRed Hat …",
          "link": "https://opensource.com/article/22/9/install-jdbc-linux",
          "publishedOn": "2022-09-23T07:00:00.000Z",
          "wordCount": 1391,
          "title": "Install JDBC on Linux in 3 steps",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/java-coffee-mug.jpg"
        },
        {
          "id": "70204 at https://opensource.com",
          "author": "Alan Formy-Duval",
          "description": "5 Git configurations I make on Linux\nAlan Formy-Duval\nThu, 09/22/2022 - 03:00\n\n            \nSetting up Git on Linux is simple, but here are the five things I do to get the perfect configuration:\nCreate global configuration\nSet default name\nSet default email address\nSet default branch name\nSet default editor\nI manage my code, shell scripts, and documentation versioning using Git. This means that for each new project I start, the first step is to create a directory for its content and make it into a Git repository:\n$ mkdir newproject\ncd newproject\ngit init\n\n\n\n            \nMore on Git\nWhat is Git?\nGit cheat sheet\nMarkdown cheat sheet\nNew Git articles\nThere are certain general settings that I always want. Not many, but enough that I don't want to have to repeat the configuration each time. I l…",
          "link": "https://opensource.com/article/22/9/git-configuration-linux",
          "publishedOn": "2022-09-22T07:00:00.000Z",
          "wordCount": 2051,
          "title": "5 Git configurations I make on Linux",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/linux_keyboard_desktop.png"
        },
        {
          "id": "70202 at https://opensource.com",
          "author": "Stephan Avenwedde",
          "description": "6 Python interpreters to try in 2022\nStephan Avenwedde\nWed, 09/21/2022 - 03:00\n\n            \nPython, one of the most popular programming languages, requires an interpreter to execute the instructions defined by the Python code. In contrast to other languages, which compile directly into machine code, it’s up to the interpreter to read Python code and translate its instructions for the CPU performing the related actions. There are several interpreters out there, and in this article, I’ll take a look at a few of them.\nPrimer to interpreters\nWhen talking about the Python interpreter, it’s usually the /usr/bin/python binary being referred to. That lets you execute a .py file.\nLexing - The human-made source code is converted into a sequence of logical entities, the so called lexical tokens.\nPar…",
          "link": "https://opensource.com/article/22/9/python-interpreters-2022",
          "publishedOn": "2022-09-21T07:00:00.000Z",
          "wordCount": 2115,
          "title": "6 Python interpreters to try in 2022",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/python-programming-code-keyboard.png"
        },
        {
          "id": "70201 at https://opensource.com",
          "author": "Amar Gandhi",
          "description": "My favorite open source alternatives to Notion\nAmar Gandhi\nWed, 09/21/2022 - 03:00\n\n            \nIf you have notes to yourself scattered throughout your hard drive, you might need a notes application to collect and organize your personal reminders. A notes system can help you track ideas, important tasks, and works in progress. A popular application that isn't open source is Notion, but here are two options that respect your privacy and data.\nStandard Notes\nStandard Notes is an open source (AGPL 3.0 license) notes application featuring a password manager, a to-do list, and, of course, a great system for writing and storing notes.\nOne of the most important things about taking notes is finding them again, so organization is critical. Standard Notes uses an intuitive and natural tagging syste…",
          "link": "https://opensource.com/article/22/9/open-source-alternatives-notion",
          "publishedOn": "2022-09-21T07:00:00.000Z",
          "wordCount": 1704,
          "title": "My favorite open source alternatives to Notion",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/notebook_pen_cc_anniversary_desk.png"
        }
      ]
    },
    {
      "title": "The Verge -  All Posts",
      "feedUrl": "https://www.theverge.com/rss/index.xml",
      "siteUrl": "https://www.theverge.com/",
      "articles": [
        {
          "id": "https://www.theverge.com/2022/9/27/23374369/walmart-land-roblox-experience-metaverse",
          "author": null,
          "description": "Walmart has launched a pair of “immersive experiences” in online gaming platform Roblox. The retailer is presenting the launch as an ambitious move into the metaverse, but the “experiences” — two online worlds dubbed Walmart Land and Walmart’s Universe of Play — are really just ways to advertise toys to children. Roblox may seem trivial, but it has more than 50 million daily active users, two-thirds of which are under the age of 16. That means it’s probably Walmart experimenting with virtual worlds to try and hook this market. \nWalmart Land and Universe of Play are virtual lobbies. Inside are a variety of minigames and experiences, including a Ferris wheel, “interactive piano walkway,” and DJ booth, most of which serve to funnel players...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/27/23374369/walmart-land-roblox-experience-metaverse",
          "publishedOn": "2022-09-27T09:21:20.000Z",
          "wordCount": 12152,
          "title": "Walmart launches ‘metaverse’ experience in Roblox to sell toys to children",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/GdazEoDCVSdw5ebjanCuvOeen4A=/0x0:1600x900/1200x628/filters:focal(800x450:801x451)/cdn.vox-cdn.com/uploads/chorus_asset/file/24057767/walmart_land_roblox_experience_daytime.png"
        },
        {
          "id": "https://www.theverge.com/2022/9/27/23373832/roomba-combo-j7-plus-robot-vacuum-mop-specs-release-date-price",
          "author": null,
          "description": "The Roomba Combo j7 Plus is iRobot’s first combination robot vacuum and mop. | Image: iRobot\n    \n\n  \nRobot vacuums that can also mop have been around for a while, but most make you remove the mop before they can vacuum your carpets — unless you like slightly damp carpets. iRobot’s newest bot looks to solve this problem with a retractable robot mop arm that can lift itself up and under the vacuum to mop when it’s needed and stow itself up top when it’s not.\nThe Roomba Combo j7 Plus costs $1,099 and is available to preorder today. It will ship on October 4th, and is only being sold with the auto-emptying Clean Base at launch. The two-in-one vacuum mop uses a new combination of acoustic sensors to detect the different types of flooring in a home and “decide” when to lift its pad to avoid thread counts and when to lower it to clean hard...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/27/23373832/roomba-combo-j7-plus-robot-vacuum-mop-specs-release-date-price",
          "publishedOn": "2022-09-27T04:01:00.000Z",
          "wordCount": 14050,
          "title": "Roomba’s latest robot vacuum has a robot mop on top",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/CWz9doDZZpQt0Sb2VozxFNCDcvY=/0x0:2048x1536/1200x628/filters:focal(1024x768:1025x769)/cdn.vox-cdn.com/uploads/chorus_asset/file/24057001/Roomba_Combo_j7_Mop_Extended_Side.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/26/23372818/nasa-dart-crash-asteroid-redirect",
          "author": null,
          "description": "The surface of Dimorphos moments before the DART spacecraft slammed into it. | NASA\n    \n\n  \nA NASA spacecraft slammed into the surface of a distant asteroid at 7:14PM ET on Monday night, the climax of the agency’s Double Asteroid Redirection Test (DART). \nAn hour before impact, the target asteroid, Dimorphos, wasn’t even visible in the images from the spacecraft. In some of the early images sent back to Earth, even Dimorphos’ larger companion Didymos, looked like a single speck against a sea of black. The DART spacecraft was moving at 14,000 miles per hour, and details quickly came into view. Viewers on Earth saw the rough surface of Didymos zip by as the spacecraft cruised autonomously towards Dimorphos. Boulders filled the screen just before it went bright red, indicating a loss of signal — DART had reached its final...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/26/23372818/nasa-dart-crash-asteroid-redirect",
          "publishedOn": "2022-09-27T01:01:40.000Z",
          "wordCount": 12622,
          "title": "NASA just crashed a spacecraft into an asteroid to see what would happen",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/oBDRFkGKRJkT3TJ5LASVtNHQAGY=/0x0:764x772/1200x628/filters:focal(382x386:383x387)/cdn.vox-cdn.com/uploads/chorus_asset/file/24057087/Screen_Shot_2022_09_26_at_7.17.42_PM.png"
        },
        {
          "id": "https://www.theverge.com/2022/9/26/23373916/nexo-lawsuit-securities-regulation-new-york-attorney-general",
          "author": null,
          "description": "Illustration by Alex Castro / The Verge\n    \n\n  \nNew York Attorney General Letitia James is suing crypto company Nexo, alleging that the company misled customers by saying it was registered to sell securities and commodities and that it wasn’t approved to offer services like its “Earn Interest Product” that promised returns on deposited crypto. It’s the latest legal move in a fight between regulators and crypto companies looking to offer interest-earning accounts, often insisting that they shouldn’t be classified as securities.\nSeven other states — California, Kentucky, Maryland, Oklahoma, South Carolina, Washington, and Vermont — are also filing “administrative actions” against the company, according to a press release from the New York AG. The release also quotes James as saying:...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/26/23373916/nexo-lawsuit-securities-regulation-new-york-attorney-general",
          "publishedOn": "2022-09-27T00:45:34.000Z",
          "wordCount": 12438,
          "title": "Eight states sue crypto lender Nexo over security sales and misleading marketing",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/wPO2usOSxctI84haZv11M8ErP_0=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23587767/acastro_220524_STK428_0003.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/26/23371372/watch-nasa-dart-collision-asteroid",
          "author": null,
          "description": "An illustration of DART headed towards Dimorphos  | NASA/Johns Hopkins APL/Steve Gribben\n    \n\n  \nUpdate 9/26 8:08PM ET: The DART spacecraft smashed into an asteroid! Original post continues below. \nWhen NASA smashes a spacecraft into an asteroid on Monday, people on Earth will get an extremely close look at the action. \nNASA’s Double Asteroid Redirection Test (DART) is headed for its final destination, the surface of an asteroid called Dimorphos, which it will crash into at speeds of over 14,000 miles per hour. Researchers are hoping that the collision will change the asteroid’s orbit, speeding it up just a tiny bit. \nNeither Dimorphos, nor its larger companion, Didymos, pose any danger to Earth, but the experiment is designed to test whether or not a similar impact could make a difference if scientists ever discovered an asteroid...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/26/23371372/watch-nasa-dart-collision-asteroid",
          "publishedOn": "2022-09-27T00:08:28.000Z",
          "wordCount": 11956,
          "title": "How to watch NASA crash a spacecraft into an asteroid on Monday",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/37l_ZOr_hRErjxso672yjGxpeEY=/0x0:4800x2700/1200x628/filters:focal(2400x1350:2401x1351)/cdn.vox-cdn.com/uploads/chorus_asset/file/24052856/dart.jpeg"
        },
        {
          "id": "https://www.theverge.com/22777072/sony-ps5-playstation-5-console-where-how-to-buy-tips-restock",
          "author": null,
          "description": "Nearly two years later, it’s a little easier to get your hands on Sony’s PlayStation 5. | Photo by Vjeran Pavic / The Verge\n    \n\n  \nAs Sony’s PlayStation 5 and PlayStation 5 Digital Edition approach their second birthday, it seems that supplies of both next-gen consoles are finally catching up with demand (even with a new model reportedly on the way). Restock events are still the norm for snagging a console online, but things get a little more forgiving if you’re willing to visit a brick-and-mortar store, especially if you’re okay with paying a little more upfront for a bundle. What’s more, we’re beginning to see online stock stick around for several days if not longer, giving would-be buyers a better chance at securing Sony’s next-gen console without ever having to step foot outside the door.\n\n\nWith a little patience, determination, and luck, you can still get a PS5...\nContinue reading…",
          "link": "https://www.theverge.com/22777072/sony-ps5-playstation-5-console-where-how-to-buy-tips-restock",
          "publishedOn": "2022-09-26T21:44:45.000Z",
          "wordCount": 18160,
          "title": "How to buy a PlayStation 5",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/SKXQ8Qb08tENqBAp9Wf30_B0U_Y=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/22015295/vpavic_4278_20201030_0041.jpg"
        }
      ]
    },
    {
      "title": "Ars Technica",
      "feedUrl": "https://arstechnica.com/feed/",
      "siteUrl": "https://arstechnica.com",
      "articles": [
        {
          "id": "https://arstechnica.com/?p=1884719",
          "author": "John Timmer",
          "description": "Details of the impact aren't yet here, but the probe's last image indicates success.",
          "link": "https://arstechnica.com/?p=1884719",
          "publishedOn": "2022-09-26T23:17:27.000Z",
          "wordCount": 1775,
          "title": "DART goes silent after hitting an asteroid [Update]",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/Screen-Shot-2022-09-26-at-7.16.07-PM-760x380.png"
        },
        {
          "id": "https://arstechnica.com/?p=1884675",
          "author": "Ashley Belanger",
          "description": "LinkedIn relied on its user agreement to gain consent to research millions of users.",
          "link": "https://arstechnica.com/?p=1884675",
          "publishedOn": "2022-09-26T22:06:53.000Z",
          "wordCount": 1705,
          "title": "Experts debate the ethics of LinkedIn’s algorithm experiments on 20M users",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-969078502-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884570",
          "author": "Kevin Purdy",
          "description": "A little fix for CPUs that didn't properly sleep had decades-long consequences.",
          "link": "https://arstechnica.com/?p=1884570",
          "publishedOn": "2022-09-26T20:51:57.000Z",
          "wordCount": 1522,
          "title": "20-year-old Linux workaround is still slowing down AMD systems",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1160287370-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884596",
          "author": "Jon Brodkin",
          "description": "Google exec objects as EU mulls whether tech giants should fund telecom networks.",
          "link": "https://arstechnica.com/?p=1884596",
          "publishedOn": "2022-09-26T19:50:33.000Z",
          "wordCount": 1544,
          "title": "As ISPs seek payments from Big Tech, Google criticizes “sender-pays” model",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/google-matt-brittin-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884572",
          "author": "Sam Machkovech",
          "description": "Reading between the lines about what post-COVID E3 will look like.",
          "link": "https://arstechnica.com/?p=1884572",
          "publishedOn": "2022-09-26T19:28:49.000Z",
          "wordCount": 1927,
          "title": "E3 2023 books its physical venue, schedule—and confirms new fan-friendly twist",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/e32023listing-1-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884593",
          "author": "Dan Goodin",
          "description": "Distributed denial-of-service attacks are also likely to increase, advisory says.",
          "link": "https://arstechnica.com/?p=1884593",
          "publishedOn": "2022-09-26T19:14:57.000Z",
          "wordCount": 1772,
          "title": "Russia plans “massive cyberattacks” on critical infrastructure, Ukraine warns",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/03/ukr-matrix-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884390",
          "author": "Doug Johnson",
          "description": "Beyond lithium: Report weighs strengths, weaknesses of alternative battery types",
          "link": "https://arstechnica.com/?p=1884390",
          "publishedOn": "2022-09-26T19:05:43.000Z",
          "wordCount": 1634,
          "title": "Report pushes ‘big-tent’ approach for the future of batteries",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1202599932-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884533",
          "author": "Ashley Belanger",
          "description": "Negotiations could still go on for months as security risks are weighed.",
          "link": "https://arstechnica.com/?p=1884533",
          "publishedOn": "2022-09-26T17:36:35.000Z",
          "wordCount": 1685,
          "title": "TikTok can keep operating in US under deal being worked out with Biden",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1268141132-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884492",
          "author": "John Timmer",
          "description": "Shortly after 7 pm EST, the DART spacecraft will smack an asteroid.",
          "link": "https://arstechnica.com/?p=1884492",
          "publishedOn": "2022-09-26T17:10:32.000Z",
          "wordCount": 1322,
          "title": "It’s DART’s big day: Asteroid collision just hours away",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/image-3-760x380.jpeg"
        },
        {
          "id": "https://arstechnica.com/?p=1884028",
          "author": "Jennifer Ouellette",
          "description": "Hayabusa2 returned to Earth with soil samples from the asteroid in December 2020",
          "link": "https://arstechnica.com/?p=1884028",
          "publishedOn": "2022-09-26T17:06:07.000Z",
          "wordCount": 1847,
          "title": "Asteroid Ryugu was once part of a much larger parent body, new results find",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/ryugu3-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884438",
          "author": "Kevin Purdy",
          "description": "Punchy creator of Luna and Terra coins sought in $40 billion currency collapse.",
          "link": "https://arstechnica.com/?p=1884438",
          "publishedOn": "2022-09-26T16:27:43.000Z",
          "wordCount": 1619,
          "title": "Interpol issues red notice for crypto founder Do Kwon",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1241318864-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884453",
          "author": "Eric Berger",
          "description": "\"The decision allows time for employees to address the needs of their families.\"",
          "link": "https://arstechnica.com/?p=1884453",
          "publishedOn": "2022-09-26T15:58:54.000Z",
          "wordCount": 1674,
          "title": "NASA makes the call to protect its Artemis I mission from Hurricane Ian",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/03/SLS-Mar-17–7070-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884407",
          "author": "Benj Edwards",
          "description": "Using Respeecher, Vader will live on as a cloned voice effect performed by another actor.",
          "link": "https://arstechnica.com/?p=1884407",
          "publishedOn": "2022-09-26T15:21:43.000Z",
          "wordCount": 1539,
          "title": "Darth Vader’s voice will be AI-generated from now on",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/darth_vader_pixels_1-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884473",
          "author": "Financial Times",
          "description": "Starllink terminals need to actually make it into Iran for users to benefit.",
          "link": "https://arstechnica.com/?p=1884473",
          "publishedOn": "2022-09-26T15:20:20.000Z",
          "wordCount": 1692,
          "title": "Elon Musk offers Iranians uncensored Internet access",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2021/11/starlink-dish-and-router-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1882539",
          "author": "Andrew Cunningham",
          "description": "Thermal behavior is a bit odd, but there's lots to like about these new CPUs.",
          "link": "https://arstechnica.com/?p=1882539",
          "publishedOn": "2022-09-26T13:00:24.000Z",
          "wordCount": 1456,
          "title": "Ryzen 7600X and 7950X review: Zen 4 starts off expensive but impressive",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/IMG_0480-760x380.jpeg"
        },
        {
          "id": "https://arstechnica.com/?p=1877127",
          "author": "Andrew Cunningham",
          "description": "Ryzen 7000 CPUs use a new platform—with plenty of changes.",
          "link": "https://arstechnica.com/?p=1877127",
          "publishedOn": "2022-09-26T13:00:13.000Z",
          "wordCount": 1342,
          "title": "Everything you need to know about Zen 4, socket AM5, and AMD’s newest chipsets",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/zen4-ryzen-delid-760x380.jpeg"
        },
        {
          "id": "https://arstechnica.com/?p=1884031",
          "author": "Ars Contributors",
          "description": "A new book traces how historical accidents left us pitting education against biology.",
          "link": "https://arstechnica.com/?p=1884031",
          "publishedOn": "2022-09-25T10:00:59.000Z",
          "wordCount": 1792,
          "title": "Were your teen years exhausting? School schedules may be why",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-sb10069478bc-001-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884255",
          "author": "Samuel Axon",
          "description": "The lock screen gets a major overhaul.",
          "link": "https://arstechnica.com/?p=1884255",
          "publishedOn": "2022-09-24T17:28:59.000Z",
          "wordCount": 2373,
          "title": "iOS 16 review: Customization unlocked",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/iOS-16-760x380.png"
        },
        {
          "id": "https://arstechnica.com/?p=1884337",
          "author": "Eric Berger",
          "description": "NASA is buying some time with this decision.",
          "link": "https://arstechnica.com/?p=1884337",
          "publishedOn": "2022-09-24T15:35:18.000Z",
          "wordCount": 1712,
          "title": "NASA cancels Artemis I launch attempt but delays roll back decision",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/03/SLS-Mar-17-2022-1897-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880612",
          "author": "Ars Contributors",
          "description": "The \"Mozart effect\" isn't real—but music does affect our mental processes.",
          "link": "https://arstechnica.com/?p=1880612",
          "publishedOn": "2022-09-24T11:00:22.000Z",
          "wordCount": 1598,
          "title": "Music on the brain: Listening can influence our brain’s activity",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1389065000-760x380.jpg"
        }
      ]
    },
    {
      "title": "Business Latest",
      "feedUrl": "https://www.wired.com/feed/category/business/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "6329ea4d40fe1e8870aa3b51",
          "author": "Vittoria Elliott",
          "description": "An orchestrated attack went after an independent news website and harvested swathes of Facebook user data. And nobody can stop it.",
          "link": "https://www.wired.com/story/facebook-bots-ddos-attack/",
          "publishedOn": "2022-09-26T15:04:54.000Z",
          "wordCount": 20482,
          "title": "A Sprawling Bot Network Used Fake Porn to Fool Facebook",
          "imageUrl": "https://media.wired.com/photos/632b595aeecde8c117e7f5ae/191:100/w_1280,c_limit/Bot_Vietnam-(1).jpg"
        },
        {
          "id": "632ded1600704d14b5ffb9b4",
          "author": "Lauren Goode, Gideon Lichfield",
          "description": "The blockchain project’s cofounder Vitalik Buterin says its recent big upgrade lays a path for more technical changes, and greater adoption.",
          "link": "https://www.wired.com/story/whats-next-for-ethereum-after-the-merge/",
          "publishedOn": "2022-09-26T12:00:00.000Z",
          "wordCount": 26752,
          "title": "What’s Next for Ethereum After the Merge",
          "imageUrl": "https://media.wired.com/photos/632ea7cf8990652479ff39d3/191:100/w_1280,c_limit/BUTERIN_BIZ_GettyImages-1238606759.jpg"
        },
        {
          "id": "632e4ebbf2203b5586fac020",
          "author": "Chris Stokel-Walker",
          "description": "Automated accounts are the target of ire and the linchpin of Elon Musk’s attempt to break his deal with the platform. But some are benign—or even helpful.",
          "link": "https://www.wired.com/story/twitter-bots-elon-musk-trial/",
          "publishedOn": "2022-09-26T11:00:00.000Z",
          "wordCount": 21268,
          "title": "Not All Bots Are Bad, and Twitter Knows It",
          "imageUrl": "https://media.wired.com/photos/632e4eba20bc56769c4131ed/191:100/w_1280,c_limit/Bot_GoodBot.jpg"
        },
        {
          "id": "632ca371995b6da54b57efe1",
          "author": "Megan Farokhmanesh",
          "description": "The company is going after cryptocurrency gambling—but will that be enough to satisfy concerned streamers?",
          "link": "https://www.wired.com/story/twitch-crypto-gambling-sliker-pokimane-devin-nash-boycott/",
          "publishedOn": "2022-09-23T15:25:18.000Z",
          "wordCount": 18817,
          "title": "Twitch's Crypto Casino Ban Ignores the Bigger Play",
          "imageUrl": "https://media.wired.com/photos/632cee9d8990652479ff39bf/191:100/w_1280,c_limit/Twitch-Gambling-Business-GettyImages-1395854967.jpg"
        },
        {
          "id": "632caf9920bc56769c4131cc",
          "author": "Steven Levy",
          "description": "Plus: The Supreme Court in cyberspace, what’s up with Web3, and ghost town resurrections.",
          "link": "https://www.wired.com/story/plaintext-bogus-fears-of-censorship-could-spell-the-end-of-content-moderation/",
          "publishedOn": "2022-09-23T13:00:00.000Z",
          "wordCount": 24911,
          "title": "Bogus Fears of Censorship Could Spell the End of Content Moderation",
          "imageUrl": "https://media.wired.com/photos/632ce98ac4d3ebc9237bc689/191:100/w_1280,c_limit/plaintext_texas_biz_GettyImages-656427940.jpg"
        },
        {
          "id": "632cf64c977791160bfcd395",
          "author": "Morgan Meaker",
          "description": "An 8-year-old’s YouTube snafu—and one unlikely parent activist—sparked a nationwide debate on the tech giant’s ubiquity and handling of children’s data.",
          "link": "https://www.wired.com/story/denmark-google-schools-data/",
          "publishedOn": "2022-09-23T11:00:00.000Z",
          "wordCount": 22365,
          "title": "A Danish City Built Google Into Its Schools—Then Banned It",
          "imageUrl": "https://media.wired.com/photos/632cf64cd884b4dcc9416570/191:100/w_1280,c_limit/Denmark_google_GettyImages-1213059825.jpg"
        },
        {
          "id": "632c79038990652479ff398c",
          "author": "Caitlin Harrington",
          "description": "Elizabeth Warren and Cori Bush led over two dozen congressional Democrats in urging Amazon, Lyft, Uber, and others to reclassify contractors as employees.",
          "link": "https://www.wired.com/story/lawmakers-pressure-tech-companies-over-abortion-benefits-for-gig-workers/",
          "publishedOn": "2022-09-22T16:15:05.000Z",
          "wordCount": 19411,
          "title": "US Lawmakers Push Tech Firms on Abortion Benefits for Gig Workers",
          "imageUrl": "https://media.wired.com/photos/632ba9c640fe1e8870aa3b5c/191:100/w_1280,c_limit/Warren-Abortion-Gig-Employers-Business-1233338537.jpg"
        },
        {
          "id": "62fd21627072d2c1f58788c0",
          "author": "Steven Levy",
          "description": "Steve Case, founder of AOL, predicts the dominance of tech companies on the coasts will give way to a flourishing of startups from smaller cities.",
          "link": "https://www.wired.com/story/the-next-silicon-valley-will-be-in-the-us-heartlands/",
          "publishedOn": "2022-09-22T16:00:00.000Z",
          "wordCount": 23330,
          "title": "The Next Silicon Valley Will Be in the US Heartland",
          "imageUrl": "https://media.wired.com/photos/632ba570f2203b5586fabfec/191:100/w_1280,c_limit/Business-Next-Silicon-Valley-US-Heartlands-1399265458.jpg"
        },
        {
          "id": "6328f8e440fe1e8870aa3b4e",
          "author": "Jennifer Conrad",
          "description": "The EU’s chief antitrust enforcer Margrethe Vestager says that US tech companies are changing their behavior as global regulators question their dominance.",
          "link": "https://www.wired.com/story/the-us-and-eu-are-teaming-up-to-contain-big-tech/",
          "publishedOn": "2022-09-22T12:00:00.000Z",
          "wordCount": 21215,
          "title": "The US and EU are Teaming Up to Contain Big Tech",
          "imageUrl": "https://media.wired.com/photos/632b962cc4d3ebc9237bc67d/191:100/w_1280,c_limit/QA_biz_GettyImages-1232706719.jpg"
        },
        {
          "id": "6328b71020bc56769c413195",
          "author": "Aarian Marshall",
          "description": "Uber and Lyft spent millions promoting a controversial ballot measure. A new study suggests it has lowered driver wages.",
          "link": "https://www.wired.com/story/california-voted-for-cheaper-uber-rides-it-may-have-hurt-drivers/",
          "publishedOn": "2022-09-21T16:00:00.000Z",
          "wordCount": 21442,
          "title": "California Voted for Cheaper Uber Rides. It May Have Hurt Drivers",
          "imageUrl": "https://media.wired.com/photos/632a31898990652479ff393d/191:100/w_1280,c_limit/prop22-uber-lyft-biz-GettyImages-1167514356.jpg"
        },
        {
          "id": "6328ed95977791160bfcd2ea",
          "author": "Will Knight",
          "description": "Artists are free to create fantasies or nightmares with unrestricted image generator Stable Diffusion, but some fear a flood of AI-made horrors.",
          "link": "https://www.wired.com/story/the-joy-and-dread-of-ai-image-generators-without-limits/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 22166,
          "title": "The Joy and Dread of AI Image Generators Without Limits",
          "imageUrl": "https://media.wired.com/photos/632a20908990652479ff393a/191:100/w_1280,c_limit/lede_Corruption-of-a-Dark-mage.jpg"
        },
        {
          "id": "632a4d3440fe1e8870aa3b57",
          "author": "William Ralston",
          "description": "A new study shows that cycling packages the final few miles to their recipients isn’t just greener than using a van, but often quicker too.",
          "link": "https://www.wired.com/story/cargo-bikes-greener-quicker/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 21178,
          "title": "It’s Time for Cities to Ditch Delivery Trucks—for Cargo Bikes",
          "imageUrl": "https://media.wired.com/photos/632ab26d00704d14b5ffb99d/191:100/w_1280,c_limit/Cargo-Bike-Delivery-Science-455162274.jpg"
        },
        {
          "id": "6329c23beecde8c117e7f4ea",
          "author": "Peter Guest",
          "description": "The encrypted messaging app is a haven for politically motivated vitriol, but users are increasingly bringing threats to targets’ doorsteps.",
          "link": "https://www.wired.com/story/telegrams-doxing-problem/",
          "publishedOn": "2022-09-20T13:39:51.000Z",
          "wordCount": 21316,
          "title": "Telegram Has a Serious Doxing Problem",
          "imageUrl": "https://media.wired.com/photos/6329c23b00704d14b5ffb995/191:100/w_1280,c_limit/Doxing_telgram_biz_GettyImages-1173158197-(1).jpg"
        },
        {
          "id": "6328ff5574ce5b82a68ef2e9",
          "author": "Chris Baraniuk",
          "description": "From stamps and cash to passports and postboxes, the minting of the United Kingdom’s new royal iconography will take years.",
          "link": "https://www.wired.com/story/updating-british-royal-iconography/",
          "publishedOn": "2022-09-20T11:00:00.000Z",
          "wordCount": 21340,
          "title": "What Happens to Everything With Queen Elizabeth II’s Image?",
          "imageUrl": "https://media.wired.com/photos/6328ff5536c33c0247a2f0ac/191:100/w_1280,c_limit/queen_elizabeth_biz_GettyImages-163212621.jpg"
        },
        {
          "id": "6328fc0820bc56769c41319c",
          "author": "Chris Stokel-Walker",
          "description": "Users try to control the video platform’s algorithm by giving content a thumbs-down, but Mozilla researchers say it’s not so simple.",
          "link": "https://www.wired.com/story/youtube-dislike-button-mozilla-research/",
          "publishedOn": "2022-09-20T08:00:00.000Z",
          "wordCount": 19966,
          "title": "YouTube’s ‘Dislike’ Button Doesn’t Do What You Think",
          "imageUrl": "https://media.wired.com/photos/6328fc08f2203b5586fabfc9/191:100/w_1280,c_limit/youtube_dislike_biz_GettyImages-1024603538.jpg"
        },
        {
          "id": "631fb2ab62435d269fdbdaf0",
          "author": "Aarian Marshall, Matt Simon",
          "description": "By 2035, the batteries in California’s zero-emission cars could power every home in the state for three days.",
          "link": "https://www.wired.com/story/electric-vehicles-could-rescue-the-us-power-grid/",
          "publishedOn": "2022-09-19T11:00:00.000Z",
          "wordCount": 22220,
          "title": "Electric Vehicles Could Rescue the US Power Grid",
          "imageUrl": "https://media.wired.com/photos/6324830036c33c0247a2f08b/191:100/w_1280,c_limit/EVs_Science_GettyImages-1351239126.jpg"
        },
        {
          "id": "632354efc4d3ebc9237bc605",
          "author": "Steven Levy",
          "description": "Plus: Depicting the nerd mindset; the best lettuce; and the future is flooding.",
          "link": "https://www.wired.com/story/plaintext-neal-stephenson-named-the-metaverse-now-hes-building-it/",
          "publishedOn": "2022-09-16T13:00:00.000Z",
          "wordCount": 23873,
          "title": "Neal Stephenson Named the Metaverse. Now, He’s Building It",
          "imageUrl": "https://media.wired.com/photos/6323716274ce5b82a68ef252/191:100/w_1280,c_limit/Neal-Stephenson-Metaverse-Company-Business-Redux-h_8.01924852.jpg"
        },
        {
          "id": "63221ac5d884b4dcc9416509",
          "author": "Aarian Marshall",
          "description": "People must both drive less and switch to electric vehicles to reduce carbon emissions enough to avoid the worst effects of climate change.",
          "link": "https://www.wired.com/story/banning-gas-cars-is-good-but-itll-take-more-to-save-the-planet/",
          "publishedOn": "2022-09-16T11:00:00.000Z",
          "wordCount": 20181,
          "title": "Banning Gas Cars Is Good, but It’ll Take More to Save the Planet",
          "imageUrl": "https://media.wired.com/photos/63239e208990652479ff386f/191:100/w_1280,c_limit/California-Strategies-To-Reduce-Driving-Business-1241831020.jpg"
        },
        {
          "id": "63223fe940fe1e8870aa3ad0",
          "author": "Caitlin Harrington",
          "description": "A preliminary agreement prevented a total shutdown, but many supply chains still face delays and disruption caused by staff shortages.",
          "link": "https://www.wired.com/story/a-us-rail-strike-was-averted-but-the-crisis-is-far-from-over/",
          "publishedOn": "2022-09-15T21:02:20.000Z",
          "wordCount": 19322,
          "title": "A US Rail Strike Was Averted—but the Crisis Is Far From Over",
          "imageUrl": "https://media.wired.com/photos/6322602f74ce5b82a68ef210/191:100/w_1280,c_limit/Looming-US-Rail-Worker-Strike-Business-1423407361.jpg"
        },
        {
          "id": "6320a9edc9bb1af7ef249735",
          "author": "Vittoria Elliott",
          "description": "The Russian blockade and bombardments are cutting off thousands of tons of grain, threatening the food supply in countries that rely on wheat exports.",
          "link": "https://www.wired.com/story/satellites-ukraine-russia-grain/",
          "publishedOn": "2022-09-15T18:53:09.000Z",
          "wordCount": 19225,
          "title": "Satellite Data Shows How Russia Has Destroyed Ukrainian Grain",
          "imageUrl": "https://media.wired.com/photos/632235fcc4d3ebc9237bc5c6/191:100/w_1280,c_limit/Satellite-Images-Reveal-Scale-of-Russian-Grain-Blockades-Business-1241878175.jpg"
        }
      ]
    },
    {
      "title": "Feed: Artificial Intelligence Latest",
      "feedUrl": "https://www.wired.com/feed/tag/ai/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "632e4ebbf2203b5586fac020",
          "author": "Chris Stokel-Walker",
          "description": "Automated accounts are the target of ire and the linchpin of Elon Musk’s attempt to break his deal with the platform. But some are benign—or even helpful.",
          "link": "https://www.wired.com/story/twitter-bots-elon-musk-trial/",
          "publishedOn": "2022-09-26T11:00:00.000Z",
          "wordCount": 21268,
          "title": "Not All Bots Are Bad, and Twitter Knows It",
          "imageUrl": "https://media.wired.com/photos/632e4eba20bc56769c4131ed/191:100/w_1280,c_limit/Bot_GoodBot.jpg"
        },
        {
          "id": "6328ed95977791160bfcd2ea",
          "author": "Will Knight",
          "description": "Artists are free to create fantasies or nightmares with unrestricted image generator Stable Diffusion, but some fear a flood of AI-made horrors.",
          "link": "https://www.wired.com/story/the-joy-and-dread-of-ai-image-generators-without-limits/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 22166,
          "title": "The Joy and Dread of AI Image Generators Without Limits",
          "imageUrl": "https://media.wired.com/photos/632a20908990652479ff393a/191:100/w_1280,c_limit/lede_Corruption-of-a-Dark-mage.jpg"
        },
        {
          "id": "6320a9edc9bb1af7ef249735",
          "author": "Vittoria Elliott",
          "description": "The Russian blockade and bombardments are cutting off thousands of tons of grain, threatening the food supply in countries that rely on wheat exports.",
          "link": "https://www.wired.com/story/satellites-ukraine-russia-grain/",
          "publishedOn": "2022-09-15T18:53:09.000Z",
          "wordCount": 19225,
          "title": "Satellite Data Shows How Russia Has Destroyed Ukrainian Grain",
          "imageUrl": "https://media.wired.com/photos/632235fcc4d3ebc9237bc5c6/191:100/w_1280,c_limit/Satellite-Images-Reveal-Scale-of-Russian-Grain-Blockades-Business-1241878175.jpg"
        },
        {
          "id": "6315e68a44c07c3774c4cba0",
          "author": "Khari Johnson",
          "description": "The US regulator is eager to end unfair use of artificial intelligence and commercial surveillance, but experts remain skeptical.",
          "link": "https://www.wired.com/story/ftc-ai-regulation/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 21196,
          "title": "The FTC Is Closing in on Runaway AI",
          "imageUrl": "https://media.wired.com/photos/631a70b320bc56769c413043/191:100/w_1280,c_limit/business-ftc-ai.jpg"
        },
        {
          "id": "631134165d32e4cad34d6f3b",
          "author": "Amit Katwala",
          "description": "The Alphabet-backed AI firm is using virtual games to help its digital creations move more like humans.",
          "link": "https://www.wired.com/story/alphabet-deepmind-ai-humanoids-soccer-camp/",
          "publishedOn": "2022-09-02T11:00:00.000Z",
          "wordCount": 21030,
          "title": "Why DeepMind Is Sending AI Humanoids to Soccer Camp",
          "imageUrl": "https://media.wired.com/photos/631134163dfe1372fb611162/191:100/w_1280,c_limit/soccer_HZ_science_GettyImages-520264154.jpg"
        },
        {
          "id": "630506f9cea7c0581e825d21",
          "author": "Khari Johnson",
          "description": "The academic search engine’s policy on name changes is out of step with other search tools and publishers.",
          "link": "https://www.wired.com/story/trans-researchers-want-google-scholar-to-stop-deadnaming-them/",
          "publishedOn": "2022-09-01T11:00:00.000Z",
          "wordCount": 24084,
          "title": "Trans Researchers Want Google Scholar to Stop Deadnaming Them",
          "imageUrl": "https://media.wired.com/photos/630fe159567860ab6c66c667/191:100/w_1280,c_limit/business-deadnames-google.jpg"
        }
      ]
    },
    {
      "title": "Gear Latest",
      "feedUrl": "https://www.wired.com/feed/category/gear/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "5e456c576fd0760009425826",
          "author": "Scott Gilbertson",
          "description": "It won’t solve all of your privacy problems, but a virtual private network can make you a less tempting target for hackers.",
          "link": "https://www.wired.com/story/best-vpn/",
          "publishedOn": "2022-09-26T13:00:00.000Z",
          "wordCount": 26536,
          "title": "The Best VPNs to Protect Yourself Online",
          "imageUrl": "https://media.wired.com/photos/5e586f50ffd9380009895d8d/191:100/w_1280,c_limit/feature_art-best_vpn.jpg"
        },
        {
          "id": "5df1238e4a6a5900092a0c89",
          "author": "Parker Hall",
          "description": "We’ve rounded up our favorites, including third-party devices like the Sonos Roam and a voice-enabled Yamaha soundbar.",
          "link": "https://www.wired.com/gallery/best-alexa-and-amazon-echo-speakers/",
          "publishedOn": "2022-09-26T13:00:00.000Z",
          "wordCount": 20692,
          "title": "Which Amazon Echo or Alexa Speaker Is Best for You?",
          "imageUrl": "https://media.wired.com/photos/5e20f2a09fdee10008c4ce6d/191:100/w_2580,c_limit/Gear-Amazon-Echo-Studio-SOURCE-Amazon.jpg"
        },
        {
          "id": "6318a8cc40fe1e8870aa39b1",
          "author": "Medea Giordano",
          "description": "Cleaning sucks. The Lupe Pure makes it a little easier and has replaceable parts in case they ever break.",
          "link": "https://www.wired.com/review/lupe-pure-cordless-vacuum/",
          "publishedOn": "2022-09-26T12:00:00.000Z",
          "wordCount": 13257,
          "title": "I Like This Cordless Vacuum More Than Most Stick Vacs",
          "imageUrl": "https://media.wired.com/photos/632e143336c33c0247a2f0f2/191:100/w_1280,c_limit/Lupe-Cordless-Vacuum-Featured-Gear.jpg"
        },
        {
          "id": "632e550f00704d14b5ffb9bf",
          "author": "Chris Stokel-Walker",
          "description": "Vollebak believes its thermal camouflage jacket with graphene proves that invisibility could happen in the future.",
          "link": "https://www.wired.com/story/vollebak-invisibility-cloak/",
          "publishedOn": "2022-09-26T11:00:00.000Z",
          "wordCount": 22040,
          "title": "This Company Says It’s One Step Closer to an Invisibility Cloak",
          "imageUrl": "https://media.wired.com/photos/632e550c36c33c0247a2f0f6/191:100/w_1280,c_limit/Invisibility-Cloak-Featured-Gear.jpg"
        },
        {
          "id": "5f0f5970012dd1e0a3b492ab",
          "author": "Scott Gilbertson",
          "description": "Backups are boring, but they’ll save your bacon. Here’s how to make sure your data lives on, even when your PC doesn’t.",
          "link": "https://www.wired.com/story/how-to-back-up-your-digital-life/",
          "publishedOn": "2022-09-25T13:00:00.000Z",
          "wordCount": 23455,
          "title": "How to Back Up Your Digital Life",
          "imageUrl": "https://media.wired.com/photos/62312e348c5ef7962d4053ce/191:100/w_1280,c_limit/How-To-Back-Up-Your-Digital-Life-Gear-1068111110.jpg"
        },
        {
          "id": "6317ca0a62435d269fdbda6e",
          "author": "Justin Pot",
          "description": "Joined a new community and discovered—to your horror—that there are no party parrots? Let's fix that.",
          "link": "https://www.wired.com/story/how-to-upload-custom-emoji-slack/",
          "publishedOn": "2022-09-25T12:00:00.000Z",
          "wordCount": 17798,
          "title": "How to Upload Custom Emoji in Slack",
          "imageUrl": "https://media.wired.com/photos/632e1a82f2203b5586fac01b/191:100/w_1280,c_limit/How-to-Bulk-Load-Emoji-Slack-Gear-Alamy-2G1B158.jpg"
        },
        {
          "id": "5ec4483c2c63f8293fcb906b",
          "author": "Simon Hill",
          "description": "Everything you need to know to successfully transfer your contacts, music, photos, and apps from one iOS device to another.",
          "link": "https://www.wired.com/story/how-to-switch-iphones-or-ipad/",
          "publishedOn": "2022-09-25T12:00:00.000Z",
          "wordCount": 21808,
          "title": "How to Switch iPhones Without Losing a Thing",
          "imageUrl": "https://media.wired.com/photos/632e0ee5d884b4dcc9416575/191:100/w_1280,c_limit/How-to-Switch-iPhones-2022-Gear-GettyImages-1236366611.jpg"
        },
        {
          "id": "62f3de3d54d910713ee4f254",
          "author": "Eric Ravenscraft",
          "description": "I never knew what these charging blocks were for until my Nintendo Switch started to die in the living room.",
          "link": "https://www.wired.com/story/a-little-power-cube/",
          "publishedOn": "2022-09-25T11:00:00.000Z",
          "wordCount": 18926,
          "title": "Put a Little Power Cube Under Your Couch",
          "imageUrl": "https://media.wired.com/photos/632e0bc620bc56769c4131dd/191:100/w_1280,c_limit/Put-a-Power-Cube-Under-Your-Couch-SOURCE-Anker-Gear.jpg"
        },
        {
          "id": "63124126a4a22698f6d24ab0",
          "author": "David Nield",
          "description": "You don’t have to pay full price for downloads, subscriptions, or even in-app purchases. Here’s how.",
          "link": "https://www.wired.com/story/how-to-save-money-on-apps/",
          "publishedOn": "2022-09-25T11:00:00.000Z",
          "wordCount": 18611,
          "title": "How to Save Money on the Apps You Use",
          "imageUrl": "https://media.wired.com/photos/632e1e7ac4d3ebc9237bc69a/191:100/w_1280,c_limit/Save-Money-on-Apps-Gear-GettyImages-1363978377.jpg"
        },
        {
          "id": "6135c6178aa474c41f359e96",
          "author": "Simon Hill, Adrienne So",
          "description": "These weatherproof devices can keep a watchful eye on your property and let you get on with life.",
          "link": "https://www.wired.com/gallery/best-outdoor-security-cameras/",
          "publishedOn": "2022-09-24T13:00:00.000Z",
          "wordCount": 28483,
          "title": "Our Favorite Outdoor Security Cams for Your Home or Business",
          "imageUrl": "https://media.wired.com/photos/6165e89859c6a08b856ae950/191:100/w_2580,c_limit/Gear-Arlo-Pro-4.jpg"
        },
        {
          "id": "632c990c977791160bfcd388",
          "author": "Boone Ashworth",
          "description": "Plus: Framework has a new ultra-repairable Chromebook, there's a cheaper Google Chromecast, and Amazon refreshes its Fire HD tablets.",
          "link": "https://www.wired.com/story/windows-11-2022-update/",
          "publishedOn": "2022-09-24T13:00:00.000Z",
          "wordCount": 18958,
          "title": "Windows 11’s First Big(ish) Update Is Now Available",
          "imageUrl": "https://media.wired.com/photos/632e022ec4d3ebc9237bc694/191:100/w_1280,c_limit/Windows-11-Major-Update-2022-Gear.jpg"
        },
        {
          "id": "5f986fd8e4fe02a20082e849",
          "author": "Jaina Grey, Scott Gilbertson",
          "description": "These services deliver freshly roasted, delicious coffee right to your door—each with its own twist.",
          "link": "https://www.wired.com/story/best-coffee-subscriptions/",
          "publishedOn": "2022-09-24T12:00:00.000Z",
          "wordCount": 27176,
          "title": "The Best Coffee Subscriptions We’ve Savored",
          "imageUrl": "https://media.wired.com/photos/5fa2f195c529acf3a8338705/191:100/w_1280,c_limit/Gear-Grounds-and-Hounds-SOURCE-Grounds-and-Hounds.jpg"
        },
        {
          "id": "630f72fd3dfe1372fb61110e",
          "author": "Medea Giordano",
          "description": "You might not be scooping poop anymore, but Whisker's app can still give you vital information on your cat's health.",
          "link": "https://www.wired.com/review/whisker-litter-robot-4/",
          "publishedOn": "2022-09-24T12:00:00.000Z",
          "wordCount": 13683,
          "title": "The Latest Kitty Litter Robot Is Smarter, Quieter—and Pricier",
          "imageUrl": "https://media.wired.com/photos/632e0497f1e5c40d2b1bc74f/191:100/w_1280,c_limit/Whisker-Litter-Robot-4-Featured-Gear.jpg"
        },
        {
          "id": "632c935574ce5b82a68ef324",
          "author": "Parker Hall",
          "description": "Now’s a great time to upgrade your home entertainment solutions for the months to come.",
          "link": "https://www.wired.com/story/weekend-deals-september-24-2022/",
          "publishedOn": "2022-09-24T11:00:00.000Z",
          "wordCount": 19783,
          "title": "12 Great Deals on Apple Gadgets, TVs, and Bluetooth Speakers",
          "imageUrl": "https://media.wired.com/photos/617c8f04e770a2a792a14f7c/191:100/w_1280,c_limit/Gear-Macbook-Pro-21-top-Art.jpg"
        },
        {
          "id": "631a40d4995b6da54b57ee1e",
          "author": "Carol Milberger",
          "description": "Worries about polio, monkeypox, and Covid-19 are rising. Here’s how to gather your health information, even if you’ve lost the paper records.",
          "link": "https://www.wired.com/story/how-to-find-vaccine-history-store-it-safely/",
          "publishedOn": "2022-09-24T11:00:00.000Z",
          "wordCount": 21665,
          "title": "How to Find Your Vaccine History—and Store It Safely",
          "imageUrl": "https://media.wired.com/photos/632e170df2203b5586fac019/191:100/w_1280,c_limit/vaccine_history_science_GettyImages-1230181903.jpg"
        },
        {
          "id": "60dc74924abd3c033f4a0180",
          "author": "Scott Gilbertson",
          "description": "Need an ultrafast drive for video editing or a rugged option to back up your photos in the field? We’ve got a solution for every situation.",
          "link": "https://www.wired.com/story/best-portable-external-storage-drives/",
          "publishedOn": "2022-09-23T14:00:00.000Z",
          "wordCount": 23346,
          "title": "These Are the Best Portable Storage Drives",
          "imageUrl": "https://media.wired.com/photos/60e4e904aacef0398a186163/191:100/w_1280,c_limit/Gear-Crucial-X6.jpg"
        },
        {
          "id": "607895413c4558580f4abffa",
          "author": "Julian Chokkattu, Gear Team",
          "description": "Sitting at a desk for hours? Upgrade your WFH setup and work in style with these WIRED-tested comfy seats.",
          "link": "https://www.wired.com/gallery/best-office-chairs/",
          "publishedOn": "2022-09-23T13:00:00.000Z",
          "wordCount": 29806,
          "title": "Give Your Back a Break With Our Favorite Office Chairs",
          "imageUrl": "https://media.wired.com/photos/618978f7665f24682a2d21d0/191:100/w_2580,c_limit/Gear-Herman-Miller-Aeron.jpg"
        },
        {
          "id": "630fcbbbdbc9ebd1c95a746a",
          "author": "Parker Hall",
          "description": "Plug in this bright yellow audio interface, and you can play live music with anyone within 620 miles.",
          "link": "https://www.wired.com/review/elk-live-bridge/",
          "publishedOn": "2022-09-23T12:00:00.000Z",
          "wordCount": 13981,
          "title": "The Elk Live Bridge Lets You Jam Together Online",
          "imageUrl": "https://media.wired.com/photos/632ca6ec036b54662b5105e8/191:100/w_1280,c_limit/Elk-Live-Bridge-Featured-Gear.jpg"
        },
        {
          "id": "5ba41f704bb3fa2ced83094f",
          "author": "Simon Hill, Brian Barrett",
          "description": "Welcome to your new Apple smartphone. Here's how to get the most out of it right out of the box.",
          "link": "https://www.wired.com/story/how-to-set-up-a-new-iphone/",
          "publishedOn": "2022-09-23T11:00:00.000Z",
          "wordCount": 22124,
          "title": "How to Set Up Your New iPhone",
          "imageUrl": "https://media.wired.com/photos/632cb9cb8990652479ff39a0/191:100/w_1280,c_limit/iPhone-Set-Up-Featured-Gear.jpg"
        },
        {
          "id": "60084ece15db9ef1886a34f6",
          "author": "Scott Gilbertson, Simon Hill",
          "description": "Keep your phone, tablet, laptop, and other electronics running with these handheld power banks.",
          "link": "https://www.wired.com/gallery/best-portable-chargers-power-banks/",
          "publishedOn": "2022-09-22T13:00:00.000Z",
          "wordCount": 27102,
          "title": "Power Up Anywhere With Our Favorite Portable Chargers",
          "imageUrl": "https://media.wired.com/photos/6205847949455570f3fe45c0/191:100/w_2580,c_limit/Gear-Elecjet_PowerPie_P20.jpg"
        }
      ]
    },
    {
      "title": "Ideas Latest",
      "feedUrl": "https://www.wired.com/feed/category/ideas/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "6328a9f4d884b4dcc941652d",
          "author": "Eleanor Cummins",
          "description": "Everyone is telling one another to “get help,” but few acknowledge that the practice is often flawed.",
          "link": "https://www.wired.com/story/therapy-sucks/",
          "publishedOn": "2022-09-26T12:00:00.000Z",
          "wordCount": 24115,
          "title": "Why Therapy Is Broken",
          "imageUrl": "https://media.wired.com/photos/632c983862435d269fdbdbe3/191:100/w_1280,c_limit/therapy-flawed.jpg"
        },
        {
          "id": "632a559feecde8c117e7f4f0",
          "author": "Helena Fitzgerald",
          "description": "Millennials, the first generation to be online as kids, are starting to feel like we’ve aged out. Is there a way to age gracefully on the internet?",
          "link": "https://www.wired.com/story/growing-old-online/",
          "publishedOn": "2022-09-25T13:00:00.000Z",
          "wordCount": 29811,
          "title": "Growing Old Online",
          "imageUrl": "https://media.wired.com/photos/632e4cf720bc56769c4131ec/191:100/w_1280,c_limit/aging-online.jpg"
        },
        {
          "id": "632b3054d884b4dcc941655d",
          "author": "Albert Fox Cahn",
          "description": "When “if you see something, say something” becomes “we see everything,” everyone loses.",
          "link": "https://www.wired.com/story/the-surveillance-solutionism-of-putting-cameras-in-nyc-subways/",
          "publishedOn": "2022-09-22T12:00:00.000Z",
          "wordCount": 19479,
          "title": "The ‘Surveillance Solutionism’ of Putting Cameras in NYC Subways",
          "imageUrl": "https://media.wired.com/photos/632bad8e36c33c0247a2f0be/191:100/w_1280,c_limit/cameras-nyc-subway.jpg"
        },
        {
          "id": "6328bee136c33c0247a2f0ab",
          "author": "WIRED Ideas",
          "description": "Many associate the “America First” movement with Trump, but its origins—and rebirth—are more complicated.",
          "link": "https://www.wired.com/story/america-first-meme-politics/",
          "publishedOn": "2022-09-21T12:00:00.000Z",
          "wordCount": 23323,
          "title": "This Dangerous Meme in US Politics Is Over a Century Old",
          "imageUrl": "https://media.wired.com/photos/632a55bc3c360bac53306190/191:100/w_1280,c_limit/dangerous-meme-america-first.jpg"
        },
        {
          "id": "63288cb640fe1e8870aa3b0e",
          "author": "Adrian Hon",
          "description": "What do puzzles, video games, and conspiracy theories have in common?",
          "link": "https://www.wired.com/story/qanon-games-alternate-reality-conspiracy-theories/",
          "publishedOn": "2022-09-20T12:00:00.000Z",
          "wordCount": 24550,
          "title": "Games, Mysteries, and the Lure of QAnon",
          "imageUrl": "https://media.wired.com/photos/63291007c9bb1af7ef24985e/191:100/w_1280,c_limit/games-mysteries-qanon.jpg"
        },
        {
          "id": "630fa634333af8e1504c49a1",
          "author": "Paul Ford",
          "description": "Retrocomputing is about more than nostalgic nerdery. It’s also a way to keep your tech in perspective.",
          "link": "https://www.wired.com/story/modern-humans-learn-ancient-software-retrocomputing/",
          "publishedOn": "2022-09-15T13:00:00.000Z",
          "wordCount": 19623,
          "title": "What Modern Humans Can Learn From Ancient Software",
          "imageUrl": "https://media.wired.com/photos/630fa99379f10149f7bb9e38/191:100/w_1280,c_limit/WI100122_ST_Ford_01.jpg"
        },
        {
          "id": "63208fea20bc56769c4130dc",
          "author": "Matt Perault",
          "description": "New privacy and expression laws that vary state to state will be a nightmare for platforms, and for users’ rights.",
          "link": "https://www.wired.com/story/the-end-of-roe-will-spark-a-digital-civil-war/",
          "publishedOn": "2022-09-14T12:00:00.000Z",
          "wordCount": 20361,
          "title": "The End of Roe Will Spark a Digital Civil War",
          "imageUrl": "https://media.wired.com/photos/63212a43c9bb1af7ef2497c0/191:100/w_1280,c_limit/roe-digital-civil-war.jpg"
        },
        {
          "id": "630fb1b9dbc9ebd1c95a7469",
          "author": "Virginia Heffernan",
          "description": "When TV came online in the aughts, it was exciting. Then Facebook took over.",
          "link": "https://www.wired.com/story/i-want-the-internet-tv-we-were-all-promised/",
          "publishedOn": "2022-09-13T13:00:00.000Z",
          "wordCount": 19590,
          "title": "The Vast Wasteland of Internet Television",
          "imageUrl": "https://media.wired.com/photos/631f6121f1e5c40d2b1bc632/191:100/w_1280,c_limit/Heffernan_TV_Internet_Backchannel_IMG_3692_horizontal.jpg"
        },
        {
          "id": "630f9ec45d32e4cad34d6f24",
          "author": "Meghan O'Gieblyn",
          "description": "WIRED’s spiritual advice columnist reassures a literary reader that it’s OK to communicate with images.",
          "link": "https://www.wired.com/story/am-i-wrong-to-judge-talking-in-emoji/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 21634,
          "title": "Am I Wrong to Judge People for Talking to Me in Emoji?",
          "imageUrl": "https://media.wired.com/photos/630fa20cf89e2120665181db/191:100/w_1280,c_limit/WI100122_ST_CloudSupport_LO_01.jpg"
        },
        {
          "id": "62fd1fe9b07577beee1be7f9",
          "author": "Charlotte Kent",
          "description": "Jennifer Lyn Morone became a corporation in hopes of protecting her data privacy. Her experience shows the downfalls of treating data like property.",
          "link": "https://www.wired.com/story/art-data-property-roe/",
          "publishedOn": "2022-09-08T13:00:00.000Z",
          "wordCount": 25705,
          "title": "The Woman Who Became a Company Has Lessons for a Post-Roe World",
          "imageUrl": "https://media.wired.com/photos/63192414977791160bfcd0ac/191:100/w_1280,c_limit/woman-became-company.jpg"
        },
        {
          "id": "6303a03afd602ff2f11e6ffa",
          "author": "Erica Berry",
          "description": "Tech dependence is following many students back to school—but waging a war against devices helps no one.",
          "link": "https://www.wired.com/story/cell-phone-bans-school/",
          "publishedOn": "2022-09-07T11:00:00.000Z",
          "wordCount": 24331,
          "title": "Banning Phones in Class? Not So Fast",
          "imageUrl": "https://media.wired.com/photos/6317e88a00704d14b5ffb7ca/191:100/w_1280,c_limit/phones-in-class.jpg"
        },
        {
          "id": "6306003d1814a994d3a63460",
          "author": "Katherine Cross",
          "description": "Telling people to quit the platform is less effective than stopping influential elites from using the site in harmful ways.",
          "link": "https://www.wired.com/story/twitter-democracy-harm-reduction/",
          "publishedOn": "2022-09-06T13:00:00.000Z",
          "wordCount": 25625,
          "title": "So, You Want Twitter to Stop Destroying Democracy",
          "imageUrl": "https://media.wired.com/photos/631296005d32e4cad34d6f9b/191:100/w_1280,c_limit/twitter-stop-destroying-democracy.jpg"
        },
        {
          "id": "63122b60a4a22698f6d24aae",
          "author": "Kate Knibbs",
          "description": "It’s more than an unproven medical treatment—it’s a view into the antiabortion movement’s larger project.",
          "link": "https://www.wired.com/story/abortion-pill-reversal-essay/",
          "publishedOn": "2022-09-05T13:00:00.000Z",
          "wordCount": 27562,
          "title": "What Abortion Pill ‘Reversal’ Really Accomplishes",
          "imageUrl": "https://media.wired.com/photos/631276b8a4a22698f6d24aba/191:100/w_1280,c_limit/abortion-pill-reversal.jpg"
        },
        {
          "id": "630629f0fd602ff2f11e70a4",
          "author": "Jennifer Conrad",
          "description": "Johns Hopkins' long history with student-spies suggests this most recent incident will not lead to much change—but maybe that's OK.",
          "link": "https://www.wired.com/story/national-security-spies-johns-hopkins/",
          "publishedOn": "2022-09-01T12:00:00.000Z",
          "wordCount": 23362,
          "title": "The Russian Spy in My Econ Class",
          "imageUrl": "https://media.wired.com/photos/63100b03f89e2120665181e1/191:100/w_1280,c_limit/russian-spy-econ-class.jpg"
        },
        {
          "id": "630e23a9567860ab6c66c659",
          "author": "Justin Sherman",
          "description": "The agency’s lawsuit against Kochava should squash the industry’s core defense—and help keep sensitive info off the open market.",
          "link": "https://www.wired.com/story/the-ftc-may-finally-protect-americans-from-data-brokers/",
          "publishedOn": "2022-08-31T12:00:00.000Z",
          "wordCount": 19758,
          "title": "The FTC May (Finally) Protect Americans From Data Brokers",
          "imageUrl": "https://media.wired.com/photos/630ec0bb9fbbe8d3536bfa07/191:100/w_1280,c_limit/ftc-data-brokers.jpg"
        },
        {
          "id": "62fb9c2216995ea7b1a92dd3",
          "author": "Josephine Wolff",
          "description": "Cyberinsurance doesn't cover acts of war. But even as cyberattacks mount, the definition of \"warlike\" actions remains blurry.",
          "link": "https://www.wired.com/story/russia-ukraine-cyberwar-cyberinsurance/",
          "publishedOn": "2022-08-30T13:00:00.000Z",
          "wordCount": 22747,
          "title": "Who Pays for an Act of Cyberwar?",
          "imageUrl": "https://media.wired.com/photos/630d6253f89e2120665181d0/191:100/w_1280,c_limit/who-pays-cyberwar.jpg"
        }
      ]
    },
    {
      "title": "Science Latest",
      "feedUrl": "https://www.wired.com/feed/category/science/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "632b67a7036b54662b5105e0",
          "author": "Cody Cassidy",
          "description": "How a Dutch fabric seller made the most powerful magnifying lens of his time—and of the next 150 years—and became the first person ever to see a microorganism.",
          "link": "https://www.wired.com/story/secret-microscope-sparked-scientific-revolution/",
          "publishedOn": "2022-09-27T10:00:00.000Z",
          "wordCount": 29220,
          "title": "The Secret Microscope That Sparked a Scientific Revolution",
          "imageUrl": "https://media.wired.com/photos/632e3b6d903a8608f4dcb743/191:100/w_1280,c_limit/backchannel_microscope.jpg"
        },
        {
          "id": "632a013eeecde8c117e7f4ed",
          "author": "Ramin Skibba",
          "description": "The mission was designed to test whether a probe could knock a hazardous space rock away from a crash course with Earth.",
          "link": "https://www.wired.com/story/nasas-dart-spacecraft-smashes-into-an-asteroid-on-purpose/",
          "publishedOn": "2022-09-26T23:28:58.000Z",
          "wordCount": 22373,
          "title": "NASA’s DART Spacecraft Smashes Into an Asteroid—on Purpose",
          "imageUrl": "https://media.wired.com/photos/63324d5ac9bb1af7ef2498cd/191:100/w_1280,c_limit/Dimorphos-Science.jpg"
        },
        {
          "id": "632b8de2c4d3ebc9237bc67b",
          "author": "Ramin Skibba",
          "description": "Bad weather forced a third delay for the space agency’s SLS rocket plans—another setback for the uncrewed back-to-the-moon mission.",
          "link": "https://www.wired.com/story/hurricane-ian-blows-back-nasas-artemis-launch/",
          "publishedOn": "2022-09-26T19:15:14.000Z",
          "wordCount": 18856,
          "title": "Hurricane Ian Blows Back NASA’s Artemis Launch",
          "imageUrl": "https://media.wired.com/photos/6331c4fb036b54662b510639/191:100/w_1280,c_limit/Artemis_delay_Science_GettyImages-1243484045.jpg"
        },
        {
          "id": "632e463c977791160bfcd39d",
          "author": "Victoria Turk",
          "description": "Phages may help fight drug-resistant infections—but finding the right ones for each bacterium is no mean feat.",
          "link": "https://www.wired.com/story/phage-viruses-fighting-drug-resistant-bacteria/",
          "publishedOn": "2022-09-26T11:00:00.000Z",
          "wordCount": 27557,
          "title": "Viruses to Fight Superbugs? Scientists Are Working on It",
          "imageUrl": "https://media.wired.com/photos/632e463cd884b4dcc941657a/191:100/w_1280,c_limit/Superbugs_Phages_science_ScienceSource_SS2477568.jpg"
        },
        {
          "id": "6328b2df995b6da54b57ef8c",
          "author": "Ben Brubaker",
          "description": "Physicists have solved a key problem of robotic locomotion by revising the usual rules of interaction between simple component parts.",
          "link": "https://www.wired.com/story/a-wheel-made-of-odd-matter-spontaneously-rolls-uphill/",
          "publishedOn": "2022-09-25T12:00:00.000Z",
          "wordCount": 24676,
          "title": "A Wheel Made of ‘Odd Matter’ Spontaneously Rolls Uphill",
          "imageUrl": "https://media.wired.com/photos/632e2a6540fe1e8870aa3bad/191:100/w_1280,c_limit/quanta_Odd-wheels-2880x1620_Lede.jpg"
        },
        {
          "id": "6328b09e995b6da54b57ef8b",
          "author": "Jack Tamisiea",
          "description": "A cache of phytoplankton at the Academy of Natural Sciences of Drexel University is helping researchers reconstruct historical coastlines.",
          "link": "https://www.wired.com/story/philadelphias-diatom-archive-is-a-way-way-wayback-machine/",
          "publishedOn": "2022-09-24T12:00:00.000Z",
          "wordCount": 25665,
          "title": "Philadelphia’s Diatom Archive Is a Way, Way, Wayback Machine",
          "imageUrl": "https://media.wired.com/photos/632e2876d884b4dcc9416577/191:100/w_1280,c_limit/CLimateDesk_Science_microscopy-diatom-archive.jpg"
        },
        {
          "id": "631a40d4995b6da54b57ee1e",
          "author": "Carol Milberger",
          "description": "Worries about polio, monkeypox, and Covid-19 are rising. Here’s how to gather your health information, even if you’ve lost the paper records.",
          "link": "https://www.wired.com/story/how-to-find-vaccine-history-store-it-safely/",
          "publishedOn": "2022-09-24T11:00:00.000Z",
          "wordCount": 21665,
          "title": "How to Find Your Vaccine History—and Store It Safely",
          "imageUrl": "https://media.wired.com/photos/632e170df2203b5586fac019/191:100/w_1280,c_limit/vaccine_history_science_GettyImages-1230181903.jpg"
        },
        {
          "id": "631bae99d884b4dcc94164e1",
          "author": "Rhett Allain",
          "description": "If you want to attain high speeds without getting airborne, it helps to know a little something about friction.",
          "link": "https://www.wired.com/story/the-physics-of-going-fast-but-not-too-fast-on-a-giant-slide/",
          "publishedOn": "2022-09-23T13:00:00.000Z",
          "wordCount": 25264,
          "title": "The Physics of Going Fast—but Not Too Fast—on a Giant Slide",
          "imageUrl": "https://media.wired.com/photos/632c9d0c00704d14b5ffb9a9/191:100/w_1280,c_limit/friction_slide_Science_GettyImages-1272469804-(1).jpg"
        },
        {
          "id": "632ccb63d884b4dcc941656f",
          "author": "Jonathan O'Callaghan",
          "description": "Virgin Orbit will launch satellites from the country for the first time, bringing orbital flight capability to Europe.",
          "link": "https://www.wired.com/story/first-british-satellite-launch/",
          "publishedOn": "2022-09-23T11:00:00.000Z",
          "wordCount": 21241,
          "title": "The UK Is Rejoining the Space Race",
          "imageUrl": "https://media.wired.com/photos/632ccb6236c33c0247a2f0c3/191:100/w_1280,c_limit/Virgin-Orbit-87_science.jpg"
        },
        {
          "id": "632cddeea8bb66572c8c044e",
          "author": "Charlie Metcalfe",
          "description": "An ambitious cable project aims to power thousands of homes with renewable energy by 2030.",
          "link": "https://www.wired.com/story/the-uks-wild-plan-to-use-a-giant-cable-to-catch-sun-from-the-sahara/",
          "publishedOn": "2022-09-23T11:00:00.000Z",
          "wordCount": 21103,
          "title": "The Wild Plan to Export Sun From the Sahara to the UK",
          "imageUrl": "https://media.wired.com/photos/632cddee977791160bfcd393/191:100/w_1280,c_limit/Grid_UK_Biz_GettyImages-1368441144.jpg"
        },
        {
          "id": "632a125774ce5b82a68ef2f9",
          "author": "Emily Mullin",
          "description": "The technique had largely been limited to editing patients’ cells in the lab. New research shows promise for treating diseases more directly.",
          "link": "https://www.wired.com/story/theres-new-proof-crispr-can-edit-genes-inside-human-bodies/",
          "publishedOn": "2022-09-22T13:00:00.000Z",
          "wordCount": 20247,
          "title": "There’s New Proof Crispr Can Edit Genes Inside Human Bodies",
          "imageUrl": "https://media.wired.com/photos/632b96bef1e5c40d2b1bc708/191:100/w_1280,c_limit/dna_crispr_science_GettyImages-498187798.jpg"
        },
        {
          "id": "6329fa9874ce5b82a68ef2f8",
          "author": "Matt Simon",
          "description": "Meticulous turf is environmentally terrible. Yet grass does have one charm: It “sweats,” helping cool the local area.",
          "link": "https://www.wired.com/story/lawns-are-dumb-but-ripping-them-out-may-come-with-a-catch/",
          "publishedOn": "2022-09-22T12:00:00.000Z",
          "wordCount": 20734,
          "title": "Lawns Are Dumb. But Ripping Them Out May Come With a Catch",
          "imageUrl": "https://media.wired.com/photos/632b9524c9bb1af7ef24986e/191:100/w_1280,c_limit/lawn_science_GettyImages-557383651.jpg"
        },
        {
          "id": "632b748b8990652479ff394a",
          "author": "April Reese",
          "description": "Extreme temperatures are the direct result of climate change, which means more intense heat events, wildfires, and droughts to come.",
          "link": "https://www.wired.com/story/europe-heat-wave-limits/",
          "publishedOn": "2022-09-22T11:00:00.000Z",
          "wordCount": 20964,
          "title": "Europe’s Heat Waves Offer a Grim Vision of the Future",
          "imageUrl": "https://media.wired.com/photos/632b748b74ce5b82a68ef31b/191:100/w_1280,c_limit/Spain_Wildfire_Science_GettyImages-1409603369.jpg"
        },
        {
          "id": "631f7fcfd884b4dcc94164f3",
          "author": "Ruha Benjamin",
          "description": "As a young Black woman, I saw my pregnancy treated like a problem. So I ditched the doctors for home delivery and found an alternative model for health care.",
          "link": "https://www.wired.com/story/ruha-benjamin-pregnancy-black-maternal-mortality/",
          "publishedOn": "2022-09-22T10:00:00.000Z",
          "wordCount": 31870,
          "title": "A Better Birth Is Possible",
          "imageUrl": "https://media.wired.com/photos/632a2e6f74ce5b82a68ef2fd/191:100/w_1280,c_limit/Backchannel_Alanna-Fields_RuhaBenjamin.jpg"
        },
        {
          "id": "632a4d3440fe1e8870aa3b57",
          "author": "William Ralston",
          "description": "A new study shows that cycling packages the final few miles to their recipients isn’t just greener than using a van, but often quicker too.",
          "link": "https://www.wired.com/story/cargo-bikes-greener-quicker/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 21178,
          "title": "It’s Time for Cities to Ditch Delivery Trucks—for Cargo Bikes",
          "imageUrl": "https://media.wired.com/photos/632ab26d00704d14b5ffb99d/191:100/w_1280,c_limit/Cargo-Bike-Delivery-Science-455162274.jpg"
        },
        {
          "id": "6318fe21c4d3ebc9237bc511",
          "author": "Maryn McKenna",
          "description": "A global fungal pandemic wiped out amphibians, destroyed biodiversity, and ultimately increased human illness. Now a second similar pathogen is on the way.",
          "link": "https://www.wired.com/story/the-fungus-that-killed-frogs-and-led-to-a-surge-in-malaria/",
          "publishedOn": "2022-09-20T16:00:00.000Z",
          "wordCount": 21337,
          "title": "The Fungus That Killed Frogs—and Led to a Surge in Malaria",
          "imageUrl": "https://media.wired.com/photos/6328e00a20bc56769c413199/191:100/w_1280,c_limit/Chiriqui-Harlequin-frog_Panama_science_(c)-Marcos-Guerra,-Smithsonian-Tropical-Research-Institute-(1).jpg"
        },
        {
          "id": "63235caf20bc56769c4130f0",
          "author": "Gregory Barber",
          "description": "Recent studies have revealed flaws in the heat index. With rising temperatures and humidity, maybe it’s time for a more holistic approach.",
          "link": "https://www.wired.com/story/the-us-is-measuring-extreme-heat-wrong/",
          "publishedOn": "2022-09-20T11:00:00.000Z",
          "wordCount": 21885,
          "title": "The US Is Measuring Extreme Heat Wrong",
          "imageUrl": "https://media.wired.com/photos/6328e23beecde8c117e7f4e6/191:100/w_1280,c_limit/heatindex_Science_GettyImages-1234663319-(1).jpg"
        },
        {
          "id": "631f6903c4d3ebc9237bc5b6",
          "author": "Maggie Chen",
          "description": "Neurons get a lot of attention—but researchers think this star-shaped brain cell type could hold the key to treating some disorders.",
          "link": "https://www.wired.com/story/to-understand-brain-disorders-consider-the-astrocyte/",
          "publishedOn": "2022-09-19T12:00:00.000Z",
          "wordCount": 21301,
          "title": "To Understand Brain Disorders, Consider the Astrocyte",
          "imageUrl": "https://media.wired.com/photos/6324834336c33c0247a2f08d/191:100/w_1280,c_limit/astrocytes_science_ScienceSource_SS2359343.jpg"
        },
        {
          "id": "631fb2ab62435d269fdbdaf0",
          "author": "Aarian Marshall, Matt Simon",
          "description": "By 2035, the batteries in California’s zero-emission cars could power every home in the state for three days.",
          "link": "https://www.wired.com/story/electric-vehicles-could-rescue-the-us-power-grid/",
          "publishedOn": "2022-09-19T11:00:00.000Z",
          "wordCount": 22220,
          "title": "Electric Vehicles Could Rescue the US Power Grid",
          "imageUrl": "https://media.wired.com/photos/6324830036c33c0247a2f08b/191:100/w_1280,c_limit/EVs_Science_GettyImages-1351239126.jpg"
        },
        {
          "id": "631f681e036b54662b510484",
          "author": "Ingrid Wickelgren",
          "description": "A statistical analysis of chemical tags on DNA may help unify disparate theories of aging.",
          "link": "https://www.wired.com/story/epigenetic-clocks-predict-animals-true-biological-age/",
          "publishedOn": "2022-09-18T12:00:00.000Z",
          "wordCount": 30446,
          "title": "Epigenetic ‘Clocks’ Predict Animals’ True Biological Age",
          "imageUrl": "https://media.wired.com/photos/6324b3f81ff1d31425318562/191:100/w_1280,c_limit/Quanta_Aging_2560_Lede.jpg"
        }
      ]
    },
    {
      "title": "Security Latest",
      "feedUrl": "https://www.wired.com/feed/category/security/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "5e456c576fd0760009425826",
          "author": "Scott Gilbertson",
          "description": "It won’t solve all of your privacy problems, but a virtual private network can make you a less tempting target for hackers.",
          "link": "https://www.wired.com/story/best-vpn/",
          "publishedOn": "2022-09-26T13:00:00.000Z",
          "wordCount": 26536,
          "title": "The Best VPNs to Protect Yourself Online",
          "imageUrl": "https://media.wired.com/photos/5e586f50ffd9380009895d8d/191:100/w_1280,c_limit/feature_art-best_vpn.jpg"
        },
        {
          "id": "632e50ef40fe1e8870aa3bb0",
          "author": "Justin Ling",
          "description": "UN countries are preparing to pick a new head of the International Telecommunications Union. Who wins could shape the open web's future.",
          "link": "https://www.wired.com/story/2022-itu-secretary-general-election/",
          "publishedOn": "2022-09-26T11:00:00.000Z",
          "wordCount": 25567,
          "title": "This Vote Could Change the Course of Internet History",
          "imageUrl": "https://media.wired.com/photos/632e50efc9bb1af7ef24988d/191:100/w_1280,c_limit/UN-Vote-ITU-Security-GettyImages-1335882101.jpg"
        },
        {
          "id": "632e4a7640fe1e8870aa3baf",
          "author": "Varsha Bansal",
          "description": "Many companies have pulled physical servers from the country as a mandate to collect customer data goes into effect.",
          "link": "https://www.wired.com/story/vpn-firms-flee-india-data-collection-law/",
          "publishedOn": "2022-09-25T11:00:00.000Z",
          "wordCount": 18655,
          "title": "VPN Providers Flee India as a New Data Law Takes Hold",
          "imageUrl": "https://media.wired.com/photos/632e4a76f2203b5586fac01f/191:100/w_1280,c_limit/VPNs-Flee-India-Security-GettyImages-1217160311.jpg"
        },
        {
          "id": "632e4525c9bb1af7ef24988b",
          "author": "Lily Hay Newman, Matt Burgess",
          "description": "Plus: A leaked trove illuminates Russia’s internet regulator, a report finds Facebook and Instagram violated Palestinian rights, and more.",
          "link": "https://www.wired.com/story/child-predators-twitch-russia-internet-regulator-security-roundup/",
          "publishedOn": "2022-09-24T13:00:00.000Z",
          "wordCount": 19718,
          "title": "Child Predators Mine Twitch to Prey on Kids",
          "imageUrl": "https://media.wired.com/photos/632e452520bc56769c4131e8/191:100/w_1280,c_limit/Twitch-Child-Predators-Security-GettyImages-1320999349.jpg"
        },
        {
          "id": "632b349f00704d14b5ffb9a1",
          "author": "Andy Greenberg",
          "description": "New research shows how third-party apps could be exploited to infiltrate these sensitive workplace tools.",
          "link": "https://www.wired.com/story/slack-microsoft-teams-app-security/",
          "publishedOn": "2022-09-23T16:52:52.000Z",
          "wordCount": 21930,
          "title": "Slack’s and Teams’ Lax App Security Raises Alarms",
          "imageUrl": "https://media.wired.com/photos/632d0df220bc56769c4131d5/191:100/w_1280,c_limit/security-slack-teams.jpg"
        },
        {
          "id": "632dcedd20bc56769c4131d7",
          "author": "Matt Burgess",
          "description": "Amid protests against the killing of Mahsa Amini, authorities have cut off mobile internet, WhatsApp, and Instagram. The death toll continues to rise.",
          "link": "https://www.wired.com/story/iran-protests-2022-internet-shutdown-whatsapp/",
          "publishedOn": "2022-09-23T15:23:24.000Z",
          "wordCount": 20479,
          "title": "Iran’s Internet Shutdown Hides a Deadly Crackdown",
          "imageUrl": "https://media.wired.com/photos/632dcedd36c33c0247a2f0ee/191:100/w_1280,c_limit/Iran-Internet-Shutdown-Security-AP_22264589595157.jpg"
        },
        {
          "id": "632a29ecc9bb1af7ef249865",
          "author": "Dhruv Mehrotra",
          "description": "Churches are using invasive phone-monitoring tech to discourage “sinful” behavior. Some software is seeing more than congregants realize.",
          "link": "https://www.wired.com/story/covenant-eyes-anti-porn-accountability-monitoring-apps/",
          "publishedOn": "2022-09-22T17:00:00.000Z",
          "wordCount": 26975,
          "title": "The Ungodly Surveillance of Anti-Porn ‘Shameware’ Apps",
          "imageUrl": "https://media.wired.com/photos/632ba19662435d269fdbdba4/191:100/w_1280,c_limit/security-shameware.jpg"
        },
        {
          "id": "632b295b00704d14b5ffb9a0",
          "author": "Lily Hay Newman",
          "description": "Security firm Chainguard has created a simple, open source way for organizations to defend the cloud against some of the most insidious attacks.",
          "link": "https://www.wired.com/story/chainguard-wolfi-linux-distribution/",
          "publishedOn": "2022-09-22T14:46:02.000Z",
          "wordCount": 19960,
          "title": "A New Linux Tool Aims to Guard Against Supply Chain Attacks",
          "imageUrl": "https://media.wired.com/photos/632bbd9cd884b4dcc941656d/191:100/w_1280,c_limit/Security-Open-Source-Linux-1403599186.jpg"
        },
        {
          "id": "632a4347c4d3ebc9237bc61c",
          "author": "Matt Burgess",
          "description": "But as Ukrainians retake ground, some of the firms are erasing their online presence.",
          "link": "https://www.wired.com/story/ukraine-war-mobile-networks-russia/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 21052,
          "title": "Shadowy Russian Cell Phone Companies Are Cropping Up in Ukraine",
          "imageUrl": "https://media.wired.com/photos/632a4347995b6da54b57efd7/191:100/w_1280,c_limit/Shadowy-Russian-Cell-Companies-Security-GettyImages-713877183.jpg"
        },
        {
          "id": "6329c23beecde8c117e7f4ea",
          "author": "Peter Guest",
          "description": "The encrypted messaging app is a haven for politically motivated vitriol, but users are increasingly bringing threats to targets’ doorsteps.",
          "link": "https://www.wired.com/story/telegrams-doxing-problem/",
          "publishedOn": "2022-09-20T13:39:51.000Z",
          "wordCount": 21316,
          "title": "Telegram Has a Serious Doxing Problem",
          "imageUrl": "https://media.wired.com/photos/6329c23b00704d14b5ffb995/191:100/w_1280,c_limit/Doxing_telgram_biz_GettyImages-1173158197-(1).jpg"
        },
        {
          "id": "63238b91d884b4dcc941650e",
          "author": "Olatunji Olaigbe",
          "description": "Despite having one of the strongest data-protection policies in Africa, the country’s enforcement and disclosure practices remain dangerously broken.",
          "link": "https://www.wired.com/story/nigeria-cybersecurity-issues/",
          "publishedOn": "2022-09-19T11:00:00.000Z",
          "wordCount": 21859,
          "title": "The Deep Roots of Nigeria’s Cybersecurity Problem",
          "imageUrl": "https://media.wired.com/photos/6325236a036b54662b51058f/191:100/w_1280,c_limit/Nigeria-Cybersecurity-Security-GettyImages-1193599505.jpg"
        },
        {
          "id": "6309107c567860ab6c66c64f",
          "author": "David Nield",
          "description": "Tired of advertisers spying on your private communications? This beta promises to kick tracking technology to the curb.",
          "link": "https://www.wired.com/story/how-to-use-duckduckgo-privacy-first-email/",
          "publishedOn": "2022-09-18T12:00:00.000Z",
          "wordCount": 18662,
          "title": "How to Use DuckDuckGo’s Privacy-First Email Service",
          "imageUrl": "https://media.wired.com/photos/6324febb20bc56769c41311a/191:100/w_1280,c_limit/How-to-Use-DuckDuckGo-Email-Privacy-Gear.jpg"
        },
        {
          "id": "63250dc8f2203b5586fabfbb",
          "author": "Matt Burgess",
          "description": "Snipers on buildings. Drone no-fly zones. Temporary CCTV. The security plan is even more complex than it was for the London 2012 Olympics.",
          "link": "https://www.wired.com/story/queen-elizabeth-ii-funeral-details-security/",
          "publishedOn": "2022-09-18T11:00:00.000Z",
          "wordCount": 21703,
          "title": "The Queen’s Funeral Sets Off the Biggest UK Police Operation Ever",
          "imageUrl": "https://media.wired.com/photos/63250dc8eecde8c117e7f4a4/191:100/w_1280,c_limit/Queen-Queues-London-Security-GettyImages-1243218331.jpg"
        },
        {
          "id": "6324bae4c9bb1af7ef2497d2",
          "author": "Andrew Couts",
          "description": "Plus: An AI artist exposes surveillance of Instagram users, the US charges Iranians over a ransomware campaign, and more.",
          "link": "https://www.wired.com/story/cbp-phone-database-ai-instagram-surveillance/",
          "publishedOn": "2022-09-17T13:00:00.000Z",
          "wordCount": 18534,
          "title": "US Border Agents May Have a Copy of Your Text Messages",
          "imageUrl": "https://media.wired.com/photos/6324fc19c9bb1af7ef2497da/191:100/w_1280,c_limit/US-Border-Patrol-Data-Security-GettyImages-1083178844.jpg"
        },
        {
          "id": "632496798990652479ff3877",
          "author": "Lily Hay Newman",
          "description": "An alleged teen hacker claims to have gained deep access to the company’s systems, but the full picture of the breach is still coming into focus.",
          "link": "https://www.wired.com/story/uber-hack-mfa-phishing/",
          "publishedOn": "2022-09-16T21:35:11.000Z",
          "wordCount": 19431,
          "title": "The Uber Hack’s Devastation Is Just Starting to Reveal Itself",
          "imageUrl": "https://media.wired.com/photos/6324bd9ac4d3ebc9237bc60e/191:100/w_1280,c_limit/Uber-Hack-Security-GettyImages-1238322525.jpg"
        },
        {
          "id": "631b4210eecde8c117e7f368",
          "author": "Matt Laslo",
          "description": "The American Data Privacy and Protection Act could protect people across the country. But first, it has to get past Nancy Pelosi.",
          "link": "https://www.wired.com/story/adppa-roe-democrats-congress/",
          "publishedOn": "2022-09-15T11:00:00.000Z",
          "wordCount": 24443,
          "title": "The Shaky Future of a Post-Roe Federal Privacy Law",
          "imageUrl": "https://media.wired.com/photos/63226c3020bc56769c4130ee/191:100/w_1280,c_limit/security-roe-530562743.jpg"
        },
        {
          "id": "6320f8e900704d14b5ffb882",
          "author": "Matt Laslo",
          "description": "Peiter “Mudge” Zatko’s allegations about the social media platform renewed a sense of urgency for lawmakers to rein in Big Tech.",
          "link": "https://www.wired.com/story/peiter-mudge-zatko-twitter-senate-judiciary-testimony/",
          "publishedOn": "2022-09-14T19:01:41.000Z",
          "wordCount": 18846,
          "title": "The Twitter Whistleblower’s Testimony Has Senators Out for Blood",
          "imageUrl": "https://media.wired.com/photos/632115df20bc56769c4130e7/191:100/w_1280,c_limit/Congress's%20takeaways%20from%20the%20Twitter%20whistleblower%20hearing-GettyImages-1423404059.jpg"
        },
        {
          "id": "6320f08cd884b4dcc94164fe",
          "author": "Chris Stokel-Walker",
          "description": "Yurii Shchyhol gives WIRED a rare interview about running the country’s Derzhspetszviazok and the state of the online conflict with Russia.",
          "link": "https://www.wired.com/story/yurii-shchyhol-urkaine-cyberwar-russia/",
          "publishedOn": "2022-09-14T11:00:00.000Z",
          "wordCount": 20922,
          "title": "Ukraine’s Cyberwar Chief Sounds Like He’s Winning",
          "imageUrl": "https://media.wired.com/photos/6320f08c62435d269fdbdb39/191:100/w_1280,c_limit/Ukraine%E2%80%99s-Cyberwar-Chief-Sounds-Like-He%E2%80%99s-Winning-Security-GettyImages-1242260474-GettyImages-1242283013.jpg"
        },
        {
          "id": "631fc39f8990652479ff3848",
          "author": "Matt Burgess",
          "description": "Exposing wrongdoing is risky on the best of days. Whistleblower Aid cofounder John Tye explains the extensive steps needed to keep people safe.",
          "link": "https://www.wired.com/story/whistleblower-safety-mudge-twitter-senate-hearing/",
          "publishedOn": "2022-09-13T11:00:00.000Z",
          "wordCount": 19713,
          "title": "How Whistleblowers Navigate a Security Minefield",
          "imageUrl": "https://media.wired.com/photos/631fc39f00704d14b5ffb878/191:100/w_1280,c_limit/How-Whistleblowers-Navigate-a-Security-Minefield-Security-GettyImages-1242680586.jpg"
        },
        {
          "id": "631b90a1d884b4dcc94164be",
          "author": "Lily Hay Newman",
          "description": "Safety Check and Lockdown Mode give people in vulnerable situations ways to quarantine themselves from acute risks.",
          "link": "https://www.wired.com/story/apple-ios-16-safety-check-lockdown-mode/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 20550,
          "title": "iOS 16 Has 2 New Security Features for Worst-Case Scenarios",
          "imageUrl": "https://media.wired.com/photos/631bbd66f1e5c40d2b1bc626/191:100/w_1280,c_limit/security-apple-lock.jpg"
        }
      ]
    },
    {
      "title": "WIRED Guides Latest",
      "feedUrl": "https://www.wired.com/feed/tag/wired-guide/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": []
    },
    {
      "title": "Product Hunt — The best new products, every day",
      "feedUrl": "https://www.producthunt.com/feed",
      "siteUrl": "https://www.producthunt.com",
      "articles": [
        {
          "id": "https://www.producthunt.com/posts/roomba-combo-j7",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/roomba-combo-j7",
          "publishedOn": "2022-09-27T09:24:36.000Z",
          "wordCount": 943,
          "title": "Roomba Combo j7+  — A Roomba that vacuums and mops",
          "imageUrl": "https://ph-files.imgix.net/cac6a1e6-4491-4a0a-9491-a3d2855a2fab.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/draxlr-3-0",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/draxlr-3-0",
          "publishedOn": "2022-09-27T08:20:40.000Z",
          "wordCount": 1172,
          "title": "Draxlr 3.0 — Get answers from your data & share them without writing code",
          "imageUrl": "https://ph-files.imgix.net/7504b276-9dc4-4855-a3a4-dae9021c1e1d.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/wair-3",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/wair-3",
          "publishedOn": "2022-09-27T07:00:03.000Z",
          "wordCount": 1015,
          "title": "WAIR — Drive sales and reduce returns with size recommendations",
          "imageUrl": "https://ph-files.imgix.net/620dc23d-791a-4ff1-9de7-99d30d308134.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/teta-beta",
          "author": null,
          "description": "“\n              Hello Product Hunt! 👋\nHere is Gianluca.  \n\nTeta? Like Webflow but for mobile apps, based on Flutter.\n\n  The Beta version of Teta allows you to build apps in no time, integrating payments, subscriptions, back-end and allowing you to scale with our CMS.  \n\n🧑‍💻 Full-stack, not just design.  \n\n🛠 Tons of features: In-App Purchases with PayPal (ApplePay, GooglePay), In-App Subscriptions with Qonversion & RevenueCat, Google Maps, AdMob, Mapbox, and more.\n\n🔹 Based on Flutter\n\n⚡️ Support Supabase\n\n🌪 In-house CMS solution to manage dynamic data & user authentication\n\n🔥 Up to 100 widgets, to build any kind of interface\n\n 🤝 Real-time collaboration, to get 10x faster your workflow\n\n🌏 +180.000 users from +160 countries\n\n🌈  Community based with +12K members on Discord\n\n\n\n_\n\n💻 Try Teta now for free: https://app.teta.so \n\n📲 Download Teta for Android: https://play.google.com/store/ap... \n\n🎥 YouTube for tutorials: https://www.youtube.com/channel/... \n\n📖 Documentation Site: https://docs.teta.so \n\n👋 Discord: http://discord.gg/z9MjHSMaSX \n\n🕸 Website: https://www.teta.so \n\n\n_\n\n📍 What's on our roadmap?\n\nThere are still so many new things to come, and the beta is just one of them.  We are working hard every day to continue to improve the experience on Teta, make it smarter and easier.   The team is expanding, and with it the potential of Teta to make your life easy and spend more time doing what you love to do.\n\n❤️ I would like to thank our users who from the very first approach with Teta have not hesitated to give advice and be patient to see improvements.\n\nThank you to our community Discord moderators and our beloved Bug Hunters.\n\nWe are a small team but with a big vision and a big mission. \nWe look forward to hearing your questions and comments!\n\n-Gianluca\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/teta-beta",
          "publishedOn": "2022-09-27T06:51:24.000Z",
          "wordCount": 1069,
          "title": "Teta (Beta) — Build an app in a weekend",
          "imageUrl": "https://ph-files.imgix.net/dd0d19e4-58b5-4949-bf47-a4974c694e22.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/spotify-blend",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/spotify-blend",
          "publishedOn": "2022-09-27T06:39:39.000Z",
          "wordCount": 976,
          "title": "Spotify Blend — Instantly create a shared playlist between you and a friend",
          "imageUrl": "https://ph-files.imgix.net/4b773897-525e-4090-859b-0c60d9e98889.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/ponzu",
          "author": null,
          "description": "Ponzu.gg along with my close friend and fellow gamer David. Ponzu generates tileable textures for 3D models in seconds using only your words and imagination.\n\nWe’re both engineers who love games as a creative medium — we’ve tried to make games on and off in our spare time, but we consistently run into the “asset cold start problem”. Our worlds look bland and unappealing, causing us to lose motivation and drop the project.\n\nSo, we built Ponzu to create plug and play textures in seconds using AI. Simply give Ponzu a prompt describing a material, choose from a set of styles, and season your world with new flavors.\n\nHere’s what you get with Ponzu:\n1. AI-generated texture assets\n2. Normal, AO, specular, and displacement maps for each texture\n3. Adjustable 3D previews in the browser\n4. Customizable styles and shareable links\n\nWe built Ponzu to help developers and artists bring their ideas to life, and we can’t wait to hear your feedback!\n\nOne last note: Ponzu is free to use, but we have limited capacity to run GPUs. There might be times when requests queue up and take a few seconds to process!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/ponzu",
          "publishedOn": "2022-09-27T06:09:07.000Z",
          "wordCount": 1036,
          "title": "Ponzu — AI-powered textures for 3D models",
          "imageUrl": "https://ph-files.imgix.net/b74acf06-065e-4e64-8459-71f0d6f5a53f.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/lune-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/lune-2",
          "publishedOn": "2022-09-27T05:44:59.000Z",
          "wordCount": 913,
          "title": "Lune — Connecting every customer experience with climate impact",
          "imageUrl": "https://ph-files.imgix.net/c1052a10-9382-4f0f-9dcd-706e707565f9.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/infisical",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/infisical",
          "publishedOn": "2022-09-27T04:33:17.000Z",
          "wordCount": 998,
          "title": "Infisical — Help dev teams sync environment variables",
          "imageUrl": "https://ph-files.imgix.net/73582f2c-bbed-4f3e-9626-e87f7b64d1dc.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/antimatter-studios",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/antimatter-studios",
          "publishedOn": "2022-09-27T04:07:10.000Z",
          "wordCount": 962,
          "title": "Antimatter Studios — A collaborative meme studio for your classroom",
          "imageUrl": "https://ph-files.imgix.net/fd510aec-cdfb-4f23-84d9-97b6be4f3738.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/bidi-charge",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/bidi-charge",
          "publishedOn": "2022-09-27T03:17:29.000Z",
          "wordCount": 1047,
          "title": "Bidi Charge — Crowdinvest in charging points that users need",
          "imageUrl": "https://ph-files.imgix.net/e5aa7deb-f99b-43f7-af47-05a6e6a4301c.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/securityscorecard-chrome-extension",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/securityscorecard-chrome-extension",
          "publishedOn": "2022-09-27T01:29:13.000Z",
          "wordCount": 993,
          "title": "SecurityScorecard Chrome Extension — See the potential security risk for every site you visit",
          "imageUrl": "https://ph-files.imgix.net/71d5eae9-19d3-46ec-8583-c9e36870ec54.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/mentionitis",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/mentionitis",
          "publishedOn": "2022-09-26T22:24:28.000Z",
          "wordCount": 992,
          "title": "Mentionitis — In-page bookmarking and searching",
          "imageUrl": "https://ph-files.imgix.net/3b783152-20b7-4073-8182-c9467ed29d3a.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/swoop-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/swoop-2",
          "publishedOn": "2022-09-26T21:35:56.000Z",
          "wordCount": 988,
          "title": "Swoop — Latest trends, for less",
          "imageUrl": "https://ph-files.imgix.net/e5593ca7-096d-4fe5-8c88-370786083092.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/spatialchat-3-0",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/spatialchat-3-0",
          "publishedOn": "2022-09-26T21:35:21.000Z",
          "wordCount": 1169,
          "title": "SpatialChat 3.0 — All-in-one space for collaboration, all-hands and networking",
          "imageUrl": "https://ph-files.imgix.net/b943b841-3dca-48d1-8a57-026cddd9fd3b.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/postflow",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/postflow",
          "publishedOn": "2022-09-26T20:25:27.000Z",
          "wordCount": 864,
          "title": "PostFlow — Social media management in your ClickUp workspace",
          "imageUrl": "https://ph-files.imgix.net/5b6092df-668b-462c-8dae-33cdc734e796.webp?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/sourcegraph-4-0",
          "author": null,
          "description": "https://about.sourcegraph.com/so...\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/sourcegraph-4-0",
          "publishedOn": "2022-09-26T19:56:27.000Z",
          "wordCount": 1040,
          "title": "Sourcegraph 4.0 — The code intelligence platform for modern devs",
          "imageUrl": "https://ph-files.imgix.net/588013b3-e4ff-47d0-a1e5-a85fe47e56fb.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/the-companies-api",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/the-companies-api",
          "publishedOn": "2022-09-26T18:46:32.000Z",
          "wordCount": 978,
          "title": "The Companies API — The API to search & enrich 54 million companies",
          "imageUrl": "https://ph-files.imgix.net/e50a7607-beab-4c44-a380-0984ff10b09b.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/qadeputy-2",
          "author": null,
          "description": "https://qadeputy.com. You can register for a demo (https://qadeputy.com/demo), create a new account, start a free trial and learn how to #TestSmarter with QADeputy's Test Case Management solution!!\n\nHappy Testing!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/qadeputy-2",
          "publishedOn": "2022-09-26T16:11:04.000Z",
          "wordCount": 1031,
          "title": "QADeputy — Test smarter with QADeputy test management",
          "imageUrl": "https://ph-files.imgix.net/d9425d47-bc9a-4304-b82a-2e4272a4d8c0.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/student-hub-os",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/student-hub-os",
          "publishedOn": "2022-09-26T15:20:12.000Z",
          "wordCount": 1033,
          "title": "Student Hub OS — An all-in-one student operating system",
          "imageUrl": "https://ph-files.imgix.net/2b8193ba-30d8-4c58-a11f-4aa4591b8e59.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/le-digest",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/le-digest",
          "publishedOn": "2022-09-26T14:53:11.000Z",
          "wordCount": 1035,
          "title": "Le Digest — A simple, daily email to start your day on the right foot",
          "imageUrl": "https://ph-files.imgix.net/4fc02488-a668-46fd-9437-bdcb6b92b56f.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/videook",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/videook",
          "publishedOn": "2022-09-26T13:56:18.000Z",
          "wordCount": 951,
          "title": "VideoOk — Social proof platform to collect & share video testimonials",
          "imageUrl": "https://ph-files.imgix.net/c1529b41-0431-46fc-a37b-4acf325a5aff.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/quest-71ad8003-23f9-4d84-9718-8b20aebbbda0",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/quest-71ad8003-23f9-4d84-9718-8b20aebbbda0",
          "publishedOn": "2022-09-26T13:24:54.000Z",
          "wordCount": 874,
          "title": "Quest — Build quizzes with NFT reward in minutes",
          "imageUrl": "https://ph-files.imgix.net/35ff5ada-925e-4798-816a-b423e619a54a.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/radiance-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/radiance-2",
          "publishedOn": "2022-09-26T12:47:56.000Z",
          "wordCount": 1033,
          "title": "Radiance — Video tool to transfer knowledge among teams",
          "imageUrl": "https://ph-files.imgix.net/43be294e-f01e-43e3-94f6-84727a69ee3a.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/datumo",
          "author": null,
          "description": "https://zcal.co/i/1R96vEVo \n\nDaniele,  Eleonora, Rossana & Stefano\n\nP.S. we're planning to expand the number of available CRM integrations, and it would be great if you could share with us the CRM or marketing automation tool you're using and wish to find in datumo.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/datumo",
          "publishedOn": "2022-09-26T12:30:19.000Z",
          "wordCount": 960,
          "title": "datumo — Keep your CRM in good shape",
          "imageUrl": "https://ph-files.imgix.net/eb79f1c0-c580-4b40-9f7f-96e091f1c021.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/shoppingos",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/shoppingos",
          "publishedOn": "2022-09-26T11:57:40.000Z",
          "wordCount": 841,
          "title": "ShoppingOS — Instant bank payments for fast-growing businesses",
          "imageUrl": "https://ph-files.imgix.net/4da65d13-1352-40ed-933e-c532b5151695.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/tomoclub",
          "author": null,
          "description": "https://calendly.com/tomoclubdem...\n\nLooking forward to support from Product hunt community response for the same.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/tomoclub",
          "publishedOn": "2022-09-26T11:44:45.000Z",
          "wordCount": 923,
          "title": "TomoClub — Live educational games to learn social and emotional skills",
          "imageUrl": "https://ph-files.imgix.net/24120949-27eb-47fc-aeb6-525aa42963b0.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/colossyan-creator",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/colossyan-creator",
          "publishedOn": "2022-09-26T09:11:59.000Z",
          "wordCount": 1009,
          "title": "Colossyan Creator — Videos with AI actors, easy and save time on video recording",
          "imageUrl": "https://ph-files.imgix.net/47f7e441-bc88-4e08-a079-12c8dc28d9fc.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/awesome-oss-developer-security-tools",
          "author": null,
          "description": "https://boxyhq.com/)\n\nSecurity quickly becomes a challenge for developers, we have experienced this ourselves and this is why we decided to curate a list that brings together compliance controls and security tools that help developers implement these controls successfully.\n\nWe’d love your feedback and contribution to the growing list. Star us on GitHub, follow us on Twitter and join our Discord community to discuss developer security.\nGitHub: https://github.com/boxyhq/awesom...\nTwitter: https://twitter.com/boxyhq\nDiscord: https://discord.boxyhq.com\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/awesome-oss-developer-security-tools",
          "publishedOn": "2022-09-26T08:56:15.000Z",
          "wordCount": 1109,
          "title": "Awesome OSS Developer Security Tools — A curated list of free OSS developer-first security tools",
          "imageUrl": "https://ph-files.imgix.net/f0d865cc-5ac3-444c-b0a6-45ae728a288c.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/avoma-scheduler",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/avoma-scheduler",
          "publishedOn": "2022-09-26T08:26:52.000Z",
          "wordCount": 1014,
          "title": "Avoma Scheduler — Automate meeting lifecycle, from scheduling to note-taking",
          "imageUrl": "https://ph-files.imgix.net/204912bf-4c9a-4a03-9e89-01e442d38cf4.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/bobo-color-book",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/bobo-color-book",
          "publishedOn": "2022-09-26T07:55:27.000Z",
          "wordCount": 1044,
          "title": "Bobo Color Book — Children's painting book",
          "imageUrl": "https://ph-files.imgix.net/715470c3-3550-44cf-88ed-fb25b95a96a3.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/aboutkorea",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/aboutkorea",
          "publishedOn": "2022-09-26T07:33:08.000Z",
          "wordCount": 970,
          "title": "AboutKorea — Comprehensive portal of content and services for foreigners",
          "imageUrl": "https://ph-files.imgix.net/5be84f63-538b-4fb2-a09b-45f58e0c0dd2.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/disciplina",
          "author": null,
          "description": "https://apps.apple.com/redeem?ct...\n\nThank you all for your support and advice.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/disciplina",
          "publishedOn": "2022-09-26T07:15:38.000Z",
          "wordCount": 1014,
          "title": "Disciplina — Don't break the chain",
          "imageUrl": "https://ph-files.imgix.net/1e8d73ea-9651-451b-a750-13329a862e23.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/readinglines-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/readinglines-2",
          "publishedOn": "2022-09-25T17:43:07.000Z",
          "wordCount": 996,
          "title": "ReadingLines — Extract text from images",
          "imageUrl": "https://ph-files.imgix.net/0d101eb7-3ead-47a3-b0b3-c45fe01333e0.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/sharecv",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/sharecv",
          "publishedOn": "2022-09-25T17:35:35.000Z",
          "wordCount": 915,
          "title": "ShareCV — Create and share modern resumes in minutes",
          "imageUrl": "https://ph-files.imgix.net/3ddfa7df-9593-4e39-8457-761bb0b11407.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/lord-of-the-rent-lotr",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/lord-of-the-rent-lotr",
          "publishedOn": "2022-09-25T15:41:26.000Z",
          "wordCount": 1026,
          "title": "Lord Of The Rent (LOTR) — A viral mini-game on NYC rental prices",
          "imageUrl": "https://ph-files.imgix.net/2a16a1fc-0301-489e-8f66-6be45001d0ae.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/element-hunter",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/element-hunter",
          "publishedOn": "2022-09-25T12:11:10.000Z",
          "wordCount": 1036,
          "title": "Element Hunter — Auto search relevant photos and videos for content creators",
          "imageUrl": "https://ph-files.imgix.net/088f39ac-667f-4f5f-bcb0-a0ca1b188f36.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/save-my-shirt",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/save-my-shirt",
          "publishedOn": "2022-09-24T23:01:29.000Z",
          "wordCount": 1072,
          "title": "Save My Shirt! — That box of old, nostalgic t-shirts you save, but digital",
          "imageUrl": "https://ph-files.imgix.net/52e5a360-554c-45e1-9ab9-62b3faf06c49.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/another-darn-to-do-list-app",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/another-darn-to-do-list-app",
          "publishedOn": "2022-09-24T13:52:57.000Z",
          "wordCount": 1115,
          "title": "Another Darn To-Do List App — The most motivating way to get shit done.",
          "imageUrl": "https://ph-files.imgix.net/da6a9fd1-6ed9-468b-82c0-a1d33625d3bc.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/chartbrew-v2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/chartbrew-v2",
          "publishedOn": "2022-09-24T13:13:53.000Z",
          "wordCount": 1084,
          "title": "Chartbrew v2 — Visualize data from all your data sources in one place",
          "imageUrl": "https://ph-files.imgix.net/b59df08b-4199-4f5d-8d20-ca792adabaf4.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/texti-app",
          "author": null,
          "description": "https://texti.app\n\nFor the tech savvy out there, it’s just a chrome app that has a nestjs server, and interacts directly with openai’s gpt3 davincii algorithm.\n\nIt has a pseudo user identification with fingerprintjs, keeping all the information anonymous.\n\nWith Love.\nConstantin\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/texti-app",
          "publishedOn": "2022-09-23T17:45:18.000Z",
          "wordCount": 870,
          "title": "Texti.app — AI that lives in your browser!",
          "imageUrl": "https://ph-files.imgix.net/9bff34c9-d61d-48a9-8310-0d43330eb25d.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/networks-by-zoho-cliq",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/networks-by-zoho-cliq",
          "publishedOn": "2022-09-23T11:41:42.000Z",
          "wordCount": 1134,
          "title": "Networks by Zoho Cliq — External collaboration for businesses in Zoho Cliq",
          "imageUrl": "https://ph-files.imgix.net/47edabf1-1f55-4b88-830f-8e3e10a009b5.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/stytch-passwords",
          "author": null,
          "description": "👀 Breach detection: password reuse opens the possibility of credential stuffing attacks. Stytch integrates with HaveIBeenPwnd and prevents users from setting passwords that are present in their dataset of nearly 12 billion compromised credentials. Every time someone logs in with a password, Stytch checks HaveIBeenPwnd to see if those credentials have been compromised since last authentication and triggers a password reset if a breach is detected.\n💪 Strength assessment: in the face of password overload, users default to using easy-to-guess passwords. Stytch uses Dropbox’s zxcvbn password strength estimator, which provides a flexible strength assessment based on how resistant a password is to modern password guessing techniques. This feature is designed to make picking a strong password ea…",
          "link": "https://www.producthunt.com/posts/stytch-passwords",
          "publishedOn": "2022-09-22T22:32:36.000Z",
          "wordCount": 961,
          "title": "Stytch Passwords — Modernize your password flow",
          "imageUrl": "https://ph-files.imgix.net/515fc9d8-1c7b-4302-b988-9854f0cb977e.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/trendoo",
          "author": null,
          "description": "I couldn't be more thrilled to share Trendoo with the Product Hunt community.\nThe motivation behind Trendoo\nThe web has come quite far since web 1.0 in 1989 until its gradual replacement with the emergence of web 2.0 in 2005. The problem with web 2.0, however, is that businesses hold our data and can use it to be commercialised and used to manipulate public opinion.\nData leaks, such as the one experienced by 533 million Facebook users across 106 countries, have exposed vast amounts of personal information. The sharing of troves of full names, phone numbers, email addresses, and profile details leaves victims vulnerable to criminal attacks.\nAnd most of us now realize that platforms themselves harvest and sell user data for it to be raked over and exploited by advertisers. For many, this fee…",
          "link": "https://www.producthunt.com/posts/trendoo",
          "publishedOn": "2022-09-22T15:57:33.000Z",
          "wordCount": 1017,
          "title": "Trendoo — World's first NFT marketplace for influencers",
          "imageUrl": "https://ph-files.imgix.net/1b895241-8ee5-4c23-9ac8-be4fe83659c6.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/coslr",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/coslr",
          "publishedOn": "2022-09-22T13:48:48.000Z",
          "wordCount": 1055,
          "title": "COSLR — Find, e-mail & convert customers in minutes- with 1 platform",
          "imageUrl": "https://ph-files.imgix.net/3e0a4674-8d95-49ff-a614-6e49ffb0baef.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/re_cloud",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/re_cloud",
          "publishedOn": "2022-09-22T10:21:36.000Z",
          "wordCount": 1002,
          "title": "re_cloud —  Your data control center",
          "imageUrl": "https://ph-files.imgix.net/8b10c6f4-7ede-4666-9174-e8b5787e8199.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/remotely-8",
          "author": null,
          "description": "Why does your team need this?\nEveryone notices a social disconnect while working remote. Lacking the common ground to form lasting social connections people can be left feeling isolated. Affecting their mental health, wellbeing and overall productivity. 😰\n\nWithout team cohesion this can negatively impact employee retention costing companies: \n\n> Recruiting costs\n> Onboarding costs\n> Lost productivity\n> Lost engagement\n> Customer service and errors\n> Training costs\n> Cultural impact\n\nIf you had the chance to positively impact your team's culture with just 20 mins a week of structured activities would you take it?\n\nWe’re really excited that our MVP is now live with FREE original games and virtual meeting spaces. \nwww.remotelyhq.com \n\nIf you have any questions, please fire away below in the comments. \n\nWe’d love to hear what you think.\n\nAlso feel free to join our community on Discord. \nhttps://discord.com/invite/bV65E...\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/remotely-8",
          "publishedOn": "2022-09-21T21:27:40.000Z",
          "wordCount": 1039,
          "title": "Remotely — Avatar-based social hub with meetings, games & activities",
          "imageUrl": "https://ph-files.imgix.net/3deb2f9e-4a3e-4e2d-bc0e-488302cb151e.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/blockem",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/blockem",
          "publishedOn": "2022-09-21T16:26:36.000Z",
          "wordCount": 1022,
          "title": "Blockem — Crypto scam blocker",
          "imageUrl": "https://ph-files.imgix.net/161756de-1c16-4c2a-b1ca-f103868b2592.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/bridge-audio",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/bridge-audio",
          "publishedOn": "2022-09-21T09:30:26.000Z",
          "wordCount": 952,
          "title": "Bridge.audio — Dropbox for Music & Audio",
          "imageUrl": "https://ph-files.imgix.net/fd57a2bf-41ad-4cee-bae4-8f4917124223.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/muze-64c6741d-17b3-4f03-9816-6e17a62ea662",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/muze-64c6741d-17b3-4f03-9816-6e17a62ea662",
          "publishedOn": "2022-09-19T19:40:56.000Z",
          "wordCount": 1050,
          "title": "Muze — Music to inspire performance",
          "imageUrl": "https://ph-files.imgix.net/f11a6ee0-5ec9-4da9-9389-86969a5971ac.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/confluence-vc-investor-database",
          "author": null,
          "description": "https://www.confluence.vc/investors\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/confluence-vc-investor-database",
          "publishedOn": "2022-09-16T13:07:45.000Z",
          "wordCount": 975,
          "title": "Confluence.VC Investor Database — 2,000+ VCs filtered by sector, stage, geography, and type",
          "imageUrl": "https://ph-files.imgix.net/9dde3811-43f3-4d7d-8156-544878b4ebe6.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}