{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news/",
      "articles": [
        {
          "id": "https://www.freecodecamp.org/news/what-is-the-difference-between-parameters-and-arguments-in-javascript/",
          "author": "Segun Ajibola",
          "description": "JavaScript is one of the most popular programming languages out there for web development. The dynamic values passed in a JavaScript function can change when the function gets called in another location in the code. The keywords we use to name these data are parameters and arguments, but some developers",
          "link": "https://www.freecodecamp.org/news/what-is-the-difference-between-parameters-and-arguments-in-javascript/",
          "publishedOn": "2022-09-28T21:18:15.000Z",
          "wordCount": 1315,
          "title": "Parameters vs Arguments in JavaScript – What's the Difference?",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Parameters-vs-Arguments.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-code-a-2d-game-using-javascript-html-and-css/",
          "author": "Beau Carnes",
          "description": "JavaScript can be a surprisingly good programming language to use for creating 2D games. Especially games you want to be playable on almost any device.  We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to code a 2D game using JavaScript, HTML, CSS,",
          "link": "https://www.freecodecamp.org/news/how-to-code-a-2d-game-using-javascript-html-and-css/",
          "publishedOn": "2022-09-28T19:29:45.000Z",
          "wordCount": 871,
          "title": "How to Code a 2D Game Using JavaScript, HTML, and CSS",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/2dgamejs.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-test-in-express-and-mongoose-apps/",
          "author": "Rakesh Potnuru",
          "description": "Testing is a vital part of software development. The sooner you start testing, the better.  In this article, I'll show you how to write tests for your NodeJs/ExpressJS and MongoDB/Mongoose applications with Jest and Supertest. Let's get started First let's set up a demo Express.js app. Let's say we",
          "link": "https://www.freecodecamp.org/news/how-to-test-in-express-and-mongoose-apps/",
          "publishedOn": "2022-09-27T23:26:16.000Z",
          "wordCount": 1666,
          "title": "How to Test Your Express.js and Mongoose Apps with Jest and SuperTest",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/how-to-write-tests.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/node-js-server-side-javascript-what-is-node-used-for/",
          "author": "Ihechikara Vincent Abba",
          "description": "The release of Node.js in 2009 by Ryan Dahl increased the scope of what developers could do with JavaScript. Prior to that, you could only use JavaScript on the client side (the browser) or frontend of web applications. With Node.js, developers can create server side applications, command line tools, and",
          "link": "https://www.freecodecamp.org/news/node-js-server-side-javascript-what-is-node-used-for/",
          "publishedOn": "2022-09-27T21:34:58.000Z",
          "wordCount": 1475,
          "title": "Node.js Server-Side JavaScript – What is Node Used For?",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/christina-wocintechchat-com-glRqyWJgUeY-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-use-the-cli-beginner-guide/",
          "author": "Maybell Obadoni",
          "description": "There's a lot to learn when you're getting into tech. But fortunately there are some skills that you can use across different programming languages, operating systems, and tools.  And knowing how to use the command line interface (also known as the command prompt or terminal, depending on your operating",
          "link": "https://www.freecodecamp.org/news/how-to-use-the-cli-beginner-guide/",
          "publishedOn": "2022-09-27T21:11:32.000Z",
          "wordCount": 2155,
          "title": "How to Use the Command Line Interface – for Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/BEGINNERS--HACK-ON-USING-CLI--1-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/debugging-in-python-using-pdb/",
          "author": "Jagruti Tiwari",
          "description": "Debugging tools are at the heart of any programming language. And as a developer, it's hard to make progress and write clean code unless you know your way around these tools. This article will help you get acquainted with one such tool: The Python Debugger (pdb) [https://docs.python.org/3/library/pdb.html#:~:text=The%20module%20pdb%20defines%20an,context%20of%20any%20stack%20frame] Note that this",
          "link": "https://www.freecodecamp.org/news/debugging-in-python-using-pdb/",
          "publishedOn": "2022-09-27T17:50:42.000Z",
          "wordCount": 1686,
          "title": "How to Debug Your Python Code with the Python Debugger (pdb)",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/paulius-andriekus-552Vm3_Ah6A-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-implement-vertical-scrolling-in-react-using-react-router-hash-link/",
          "author": "Edeh Israel Chidera",
          "description": "Smooth scrolling is a feature that makes webpages more usable and allows for a better user scrolling experience in most browsers. Implementing a smooth page scroll while using react-router-dom has been a problem in React.js. So this article, you are going to learn how to implement smooth vertical scrolling using",
          "link": "https://www.freecodecamp.org/news/how-to-implement-vertical-scrolling-in-react-using-react-router-hash-link/",
          "publishedOn": "2022-09-27T17:42:42.000Z",
          "wordCount": 1279,
          "title": "How to Implement Vertical Scrolling in React Using react-router-hash-link",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/ferenc-almasi-L8KQIPCODV8-unsplash.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-information-systems-definition-for-beginners/",
          "author": "Kolade Chris",
          "description": "You may have heard the term \"information systems\" as a type of degree some people get from a college or university. Or maybe you've heard it as a general term used to describe information and communication systems in general. Information systems are more than a degree or a general term.",
          "link": "https://www.freecodecamp.org/news/what-is-information-systems-definition-for-beginners/",
          "publishedOn": "2022-09-27T16:43:54.000Z",
          "wordCount": 1619,
          "title": "What is Information Systems? Definition for Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/christopher-gower-m_HRfLhgABo-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-java-programming/",
          "author": "Beau Carnes",
          "description": "Java has been one of the most popular programming languages for a long time. It is considered a general-purpose, concurrent, strongly typed, class-based object-oriented language. We just published a full course on the freeCodeCamp.org YouTube channel that will teach you the Java programming language. This course is perfect for beginners.",
          "link": "https://www.freecodecamp.org/news/learn-java-programming/",
          "publishedOn": "2022-09-27T13:37:06.000Z",
          "wordCount": 815,
          "title": "Learn Java Programming (version 17)",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/java.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/linux-basics/",
          "author": "Daniel Iwugo",
          "description": "Time to learn how to use the operating system of the average hacker 🐧. In this article, we will take a little tour of:  * The Linux operating system  * Package management  * The Linux file structure  * The Command Line Interface And you get to",
          "link": "https://www.freecodecamp.org/news/linux-basics/",
          "publishedOn": "2022-09-26T23:20:22.000Z",
          "wordCount": 4025,
          "title": "Linux for Hackers – Basics for Cybersecurity Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/linux-basics-for-hackers.jpeg"
        }
      ]
    },
    {
      "title": "DEV Community 👩‍💻👨‍💻",
      "feedUrl": "https://dev.to/feed",
      "siteUrl": "https://dev.to",
      "articles": [
        {
          "id": "https://dev.to/emphie/fups-that-made-me-a-better-programmer-4kil",
          "author": "Michał Hadamik",
          "description": "How about not spending your weekends on fixing bugs that could have been easily predicted and not rushing because you underestimated the time you will spend on a project? \nWell, read about my f*ups guide to learn from my mistakes and avoid your own! \nDo backups regularly\nLet me tell you a story. In one of my previous jobs, I was the person responsible for making manual backups for WordPress websites. I did it every month, but one month I forgot! Guess what happened... Yeah, our website server was attacked, I didn’t think it would be significant as I made backups regularly. I thought I could just upload the last version I had, but after checking the folder on the NAS server and looking for copies, I nearly had a mini heart attack! It transpired that that month, there were a lot of changes t…",
          "link": "https://dev.to/emphie/fups-that-made-me-a-better-programmer-4kil",
          "publishedOn": "2022-09-29T09:58:41.000Z",
          "wordCount": 2054,
          "title": "f*ups that made me a better programmer",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--X9a2BaL0--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/pd9ua6nag3cbotkmbkwz.jpg"
        },
        {
          "id": "https://dev.to/drprime01/how-to-create-a-glassmorphism-effect-with-pure-css-eca",
          "author": "DrPrime01",
          "description": "Glassmorphism is a new design trend that started in 2021 after many developers complained about the controversial style of another design trend, neomorphism. Today, many websites and UI implement the glassmorphism effect, including major tech giants like Apple and Microsoft. \nAs the name implies, glassmorphism is about creating an HTML semantic container that resembles translucent glass. While the developer may decide the other style properties of the container, glassmorphism itself is the glass-like effect morphed with other developer-selected CSS properties.\nAlthough some web applications generate the glassmorphism effect, and all you have to do is copy and paste the code in your code editor, it is a big challenge for a developer to know how to create one with CSS without external assist…",
          "link": "https://dev.to/drprime01/how-to-create-a-glassmorphism-effect-with-pure-css-eca",
          "publishedOn": "2022-09-29T09:49:13.000Z",
          "wordCount": 1512,
          "title": "How to Create a Glassmorphism Effect with Pure CSS",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--UtbZkrpc--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ia79v1juqznyblo513vb.png"
        },
        {
          "id": "https://dev.to/bytehide/bicep-extension-finally-arrives-in-visual-studio-heres-what-you-need-to-know-2ach",
          "author": "ByteHide",
          "description": "Bicep, the open source project used by Visual Studio Code to extend its capabilities, has finally arrived in Visual Studio, enabling users of Microsoft’s flagship IDE to use some of Bicep’s most popular features in the same program they have been using since they were introduced to it — in other words, Visual Studio itself.\nThe Bicep extension for Visual Studio Code was released 2 years ago (December 11, 2020) and as of today has over 450,000 downloads. I think it was about time it was available for Visual Studio, right?\n\nHowever, not all of Bicep’s features are available in this release, so you might need to be patient while they make their way over there. Here’s what you need to know about Bicep and the extension that has brought it to Visual Studio.\nVisual Studio is one of the most popu…",
          "link": "https://dev.to/bytehide/bicep-extension-finally-arrives-in-visual-studio-heres-what-you-need-to-know-2ach",
          "publishedOn": "2022-09-29T09:21:34.000Z",
          "wordCount": 1625,
          "title": "Bicep Extension Finally Arrives in Visual Studio! Here's What You Need to Know",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--xJyqPsHi--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/kitenyp5sb3bnv3xgblp.png"
        },
        {
          "id": "https://dev.to/dagnelies/day-9-10-webauthn-library-done-342l",
          "author": "Arnaud Dagnelies",
          "description": "It's done. The small helper library is finally done!\npages / CDN configured properly\nlinks were fixed\nreadme improved\nthe missing verification algorithm was added\ntested it\nIt was time consuming grunt work. But now it's done. Hooray! 🎉🎉🎉 \nThere is certainly room for improving the code, the docs and the tests, there always is, but it's good enough for me! Now I will take a small break and soon focus on the next step(s). After all, this was just a small stepping stone of a grander project.\nI also wondered about the next steps:\nParticipate in Hacktoberfest? \nShowing this lib to specialized communities?\nWriting a Dev.to article about something?\nEnjoying some free time (yay!)\nWe'll see, stay tuned.",
          "link": "https://dev.to/dagnelies/day-9-10-webauthn-library-done-342l",
          "publishedOn": "2022-09-29T09:15:40.000Z",
          "wordCount": 1233,
          "title": "Day 9-10: Webauthn library: done! 🎉",
          "imageUrl": "https://dev.to/social_previews/article/1205324.png"
        },
        {
          "id": "https://dev.to/mohsinyaqoob/an-introduction-to-vite-4e5l",
          "author": "Mohsin Yaqoob",
          "description": "Vite is a JavaScript build tool that simplifies the way we build and develop front-end web applications. At its core, it does two things:\nIt Serves your code locally during development.\nBundles your JavaScript, CSS and other assets together for production.\n\nThere are many other tools out there that do the same thing. For example, we have WebPack, but what makes Vite different?\nWell Vite was created by Evan Yu who also created Vue.js as a way to both simplify and speed up the build process.\nNot long ago web developers had no native way to combine JavaScript files in a modular way this led to tools like WebPack and Rollup that concatenate multiple files together into a single bundle for the browser.\nThe problem is that this process becomes increasingly slow as the app adds more code and depe…",
          "link": "https://dev.to/mohsinyaqoob/an-introduction-to-vite-4e5l",
          "publishedOn": "2022-09-29T09:13:40.000Z",
          "wordCount": 1866,
          "title": "An introduction to Vite ⚡",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--eaP5eowh--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/baja7ar3rdosodm4fhvj.png"
        },
        {
          "id": "https://dev.to/sharmanandini4/best-ways-you-can-use-onboarding-for-newly-hired-developers-2n9n",
          "author": "Nandini Sharma",
          "description": "There is nothing more expensive than a bad hire. Failing to successfully onboard employees can also result in low employee morale, diminished confidence, and decreased levels of employee enthusiasm. Therefore, ultimately causing businesses to fall short of sales expectations as well as company objectives.   \nYour organization can benefit by making sure that newly hired developers have a smooth transition into their roles. A thorough preparation strategy, a positive mindset, and ensuring that training resources are effectively utilized can make your developers onboarding experience successful. \nThe process of incorporating new hires into the organization is known as employee onboarding. This largely entails introducing your new hires to their workplace, corporate rules, and company culture.…",
          "link": "https://dev.to/sharmanandini4/best-ways-you-can-use-onboarding-for-newly-hired-developers-2n9n",
          "publishedOn": "2022-09-29T07:47:29.000Z",
          "wordCount": 2252,
          "title": "Best Ways You Can Use Onboarding for Newly- Hired Developers",
          "imageUrl": "https://dev.to/social_previews/article/1206285.png"
        },
        {
          "id": "https://dev.to/julio_santacruz/dude-do-the-initial-git-configuration-1oao",
          "author": "Julio Santacruz",
          "description": "Intro\n\n\nHello, Let me tell you that I just restarted my work computer, why is this relevant? because I lost all my settings and it's time to configure them again. I imagine you got an idea with the title, we will see the initial git configurations, the ones I need to start working.\nI hope this publication is useful to you, I am sure it will be useful for my future self.\nGit is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency. there is more software for version control, but git is the one I like to use.\nFirst of all, to start a new repository we can use the command\ngit init\n\nNow let's set the user information (us).\ngit config --global user.email \"your@email.com\"\ngit config --global user.name \"your_name\"\n\nTo find where the settings are stored we can use the command.\ngit config --list --show-origin\n\nGit works with branches, I'm sure you already know that, as I write this, the default name of the main branch is 'master'. By convention we could call it 'main', let's see how to change the name\ngit branch -m old_name new_name\n\nto ensure that all projects start with the main branch name 'main'\ngit config --global init.defaultBranch main\n\nFor bonus we are going to connect our project to a repository in GITHUB. As a first step we are going to set the 'origin'\ngit remote add origin repository_URL\n\nTo verify that the URL was saved correctly\ngit remote -v\n\nTo fetch the latest version from the remote repository\ngit pull origin main\n\nif there is an error for different versions we can add the flag '---allow-unrelated-histories'\ngit pull origin main --allow-unrelated-histories\n\nFinally, to send our information to the remote repository we can do git push and save the changes from our local repository to GitHub\ngit push origin main",
          "link": "https://dev.to/julio_santacruz/dude-do-the-initial-git-configuration-1oao",
          "publishedOn": "2022-09-29T07:41:06.000Z",
          "wordCount": 1431,
          "title": "Dude, do the initial Git configuration",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--_hTpR9wO--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rn6be8gznn1440y3cxql.png"
        },
        {
          "id": "https://dev.to/dailydevtips1/running-medusa-in-docker-2dd4",
          "author": "Chris Bongers",
          "description": "Now that we have medusa up and running, I wanted to move away from the default SQLite database as those are very limited.\nThe alternative would be Postgres, which medusa can efficiently work with.\nLuckily, it's relatively easy to set up medusa in docker.\nLet's see how that works.\nOnce you installed the medusa server project you'll see that you have a Dockerfile and a docker-compose.yml file.\nWith those, we can spool up a running docker version of the medusa server.\nRun the following command:\ndocker-compose up --build\n\nOnce it's done, you should see the container with the part.\n\nThis already would have run the migration, but you can always open up the specific server docker terminal and execute commands.\nSometimes you might want to connect to the database to see what's happening there.\nTo connect, use the following details:\nhost: 127.0.0.1\n\nuser: postgres\n\npassword: postgres\n\ndatabase: medusa-docker\n\nport: 5432\n\n\n\nAnd once in you should see all the tables!\n\nAnd that's it. Your actual server will be running on localhost:9000 as you would expect, and you can do everything as before.\nThank you for reading my blog. Feel free to subscribe to my email newsletter and connect on Facebook or Twitter",
          "link": "https://dev.to/dailydevtips1/running-medusa-in-docker-2dd4",
          "publishedOn": "2022-09-29T07:08:54.000Z",
          "wordCount": 1488,
          "title": "Running medusa in docker",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--B47xY8tV--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/aieqbovjitpx6w3em2wd.jpg"
        },
        {
          "id": "https://dev.to/angha_ramdohokar_0b6505c2/api-authentication-jwt-vs-oauth-802",
          "author": "Angha Ramdohokar",
          "description": "In my current project, we were designing a system with multiple APIs. The APIs we are building will be used by other systems as well. Whenever there is an API call we need to secure that API from external users so that we know only authenticated users are making use of our APIs and that is nothing but API authentication.\nIn simple terms, API authentication is all about proving or verifying the identity of the people accessing your system.\n\nIts goal is to prevent attacks from cybercriminals who snoop around websites looking for the slightest vulnerability to take advantage of.\n\nOur requirement was quiet simple that we need to secure our APIs in a way that other systems can easily use it. But at the same time we don't want to share our username and password with other systems. Also in future…",
          "link": "https://dev.to/angha_ramdohokar_0b6505c2/api-authentication-jwt-vs-oauth-802",
          "publishedOn": "2022-09-29T07:05:02.000Z",
          "wordCount": 2007,
          "title": "API Authentication - JWT vs OAuth",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--wJ1xGjLf--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/7jet5gcxu80bp7bedf8s.png"
        },
        {
          "id": "https://dev.to/aswin2001barath/javascript-is-everywhere-4mga",
          "author": "Aswin Barath",
          "description": "Javascript inspires me the most in the technology space.\nThe fact is that Javascript is the language of the web. \nEvery website that we browse from Google search or other search engines, uses JavaScript.\nJavaScript facilitates every person, business, and organization’s interactive online presence across the world.\nJavaScript is the world's most popular programming language.\nBrendan Eich created the JavaScript programming language and co-founded the Mozilla project, the Mozilla Foundation, and the Mozilla Corporation.\nJavaScript is one of the core technologies of the World Wide Web (WWW), alongside HTML and CSS.\nAs of 2022, 98% of websites use JavaScript for building webpages you can visually see (client side), often using third-party libraries.\nHence, one popular usage of JavaScript is to …",
          "link": "https://dev.to/aswin2001barath/javascript-is-everywhere-4mga",
          "publishedOn": "2022-09-29T06:53:11.000Z",
          "wordCount": 1926,
          "title": "JavaScript is Everywhere!",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--nURWNMsH--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/w2gdyjpviti3p0xfbl41.png"
        },
        {
          "id": "https://dev.to/roshan_100kar/what-are-the-tokens-in-java-3em6",
          "author": "Roshan Shambharkar",
          "description": "What are the tokens in JAVA.\nTokens:- Tokens are the smallest unit of programming language which helps the the programmer to create instructions\nTokens are two types\nKeyword:- \ncompiler aware words are called keyword\n\n\nKeyword have predefine meaning and cannot be altered by programmer's \n\n\nAll Keywords are written low case.\n\n\n\nIdentifier:- Identifier are the names given by the programmer to the members of java such as class name, method name, variable name, interfaces name, packages etc.\nThere are certain rule to follow while naming the identifiers\nRules to name Identifier\n1Programm ❌\nProgram1 ✅ \n2- Character spaces are not allowed while naming the identifiers\nMy First Program ❌\nMyFirstProgram ✅\n3- Special character are not allowed while naming the Identifiers other than '$' and '_'\n$Programs ✅\n_Program  ✅\n4- Keyword cannot be used in Place of Identifiers",
          "link": "https://dev.to/roshan_100kar/what-are-the-tokens-in-java-3em6",
          "publishedOn": "2022-09-29T06:51:01.000Z",
          "wordCount": 1253,
          "title": "What Are the Tokens In JAVA",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--6XI-p3yV--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/gzxbn3p2xiuniop4mkuo.jpeg"
        },
        {
          "id": "https://dev.to/urstrulyvishwak/javascript-pure-function-1gjf",
          "author": "Kurapati Mahesh",
          "description": "Two Rules\n\n\n\nGiven the same input, always return same output.\nProduces no side effects\nUse: Easy to refactor, makes code more flexible and adaptable.\n// Pure function.\nconst multiplyNumbers = (x,y) => x * y;\n\nmultiplyNumbers(2, 3);\n> 6\n\n// Impure function.\nlet a = 4;\nconst multiplyNumbers = (b) => a *= b;\n\nmultiplyNumbers(3);\nconsole.log(a); // first time: 12\n> 12\nmultiplyNumbers(3);\nconsole.log(a); // second time: 36\n> 36\n\n// Mutates external variable so it isn't pure.\n\n// Impure function.\naddNumberarr = (arr, num) => {\narr.push(num);\n};\nconst testArr = [1,2,3];\naddNumberarr(testArr, 4);\n\nconsole.log(testArr);\n> [1, 2, 3, 4]\n\n// Mutates input array so it isn't pure.\n\n// pure version of above.\naddNumberarr = (arr, num) => {\nreturn [...arr, num];\n};\nconst testArr = [1,2,3];\naddNumberarr(testArr, 4);\n> [1, 2, 3, 4]\n\nJS Built-in Pure functions:\narr.reduce()\narr.map()\narr.filter()\narr.concat()\narr.slice()\narr.each()\narr.every()\n... - spread syntax \n\nJS Built-in Impure functions:\narr.splice()\narr.push()\narr.sort()\nMath.random()\n\nThanks,\nFollow: https://twitter.com/urstrulyvishwak",
          "link": "https://dev.to/urstrulyvishwak/javascript-pure-function-1gjf",
          "publishedOn": "2022-09-29T06:34:46.000Z",
          "wordCount": 1297,
          "title": "javascript: Pure Function",
          "imageUrl": "https://dev.to/social_previews/article/1206261.png"
        }
      ]
    },
    {
      "title": "小众软件",
      "feedUrl": "https://feeds.appinn.com/appinns",
      "siteUrl": "https://www.appinn.com",
      "articles": [
        {
          "id": "https://www.appinn.com/?p=43501",
          "author": "青小蛙",
          "description": "简单打码 是一款简单的智能图片打码应用，支持 iPhone 与 Android，除了喜闻乐见的 AI 自动识别打码，还支持在图片上涂鸦、添加表情、文字、水印。@Appinn 来自发现频道，开发者 @h",
          "link": "https://www.appinn.com/jiandan-dama/",
          "publishedOn": "2022-09-29T09:04:00.000Z",
          "wordCount": 2327,
          "title": "简单打码 – 支持表情、涂鸦的自动打码工具[iPhone/Android]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-29T164112.371.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43484",
          "author": "青小蛙",
          "description": "青小蛙一直有一个需求，就是将几张图片、截图简单的拼接起来，完全不需要花里胡哨的边框、留白、变形、文字，就只是简单的把他们拼接在一起，在一起… 然后今天下午，就在微博提出了这个问题。@您的脸",
          "link": "https://www.appinn.com/photo-collage-online/",
          "publishedOn": "2022-09-28T07:56:17.000Z",
          "wordCount": 2281,
          "title": "求简单易用的「在线拼接多张图片」工具",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/photo-collage.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43468",
          "author": "青小蛙",
          "description": "即刻转‪换是一款功能全面的视频格式、音频格式转换工具，能够非常简单的在几乎所有主流多媒体格式之间转换，支持音轨、字幕，内置多种设备模板，点几下就行了，完全不需要去研究播放格式、视频参数。@Appinn",
          "link": "https://www.appinn.com/video-converter-x2/",
          "publishedOn": "2022-09-26T12:35:17.000Z",
          "wordCount": 2263,
          "title": "即刻转‪换 – 功能全面的视频、音频格式转换软件[macOS]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-26T170141.915.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43457",
          "author": "青小蛙",
          "description": "想必不少朋友都遇到过下面这些问题：拍照的快递单号、电脑窗口里的文字、某些不让复制的网站，怎么才能复制里面的文字？ 其实只需一个 OCR 文字识别工具就可以搞定！ 今天来安利一下白描，一款多平台通用的图",
          "link": "https://www.appinn.com/baimiao-for-windows/",
          "publishedOn": "2022-09-26T06:55:29.000Z",
          "wordCount": 2327,
          "title": "白描终于出 Win 版了！超火的图片转文字工具九月特惠价 18 元起，终生免费更新",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-26T144630.347.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43453",
          "author": "青小蛙",
          "description": "来自问题频道：在 Edge 浏览器里保存图片需要经过三步操作：右键-图像另存为-存储，在需要保存多张图片的时候，操作就会变得很繁琐，有没有一款插件能像 Safari 浏览器一样直接一键保存图片到下载文",
          "link": "https://www.appinn.com/download-image-like-safari/",
          "publishedOn": "2022-09-26T04:33:24.000Z",
          "wordCount": 2266,
          "title": "求右键直接保存图片到下载文件夹的插件，像 Safari 一样保存图片",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/download-image-like-safari.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43449",
          "author": "青小蛙",
          "description": "闪卡 · WinkNotes 是笔记、知识整理、记忆学习的完美组合，iPhone / iPad / Mac 三端支持。作为考研备考、外语学习、专业研究、工作提升或是终生学习者，都可以用闪卡在分秒必争的",
          "link": "https://www.appinn.com/winknotes/",
          "publishedOn": "2022-09-25T10:07:34.000Z",
          "wordCount": 2406,
          "title": "闪卡 · WinkNotes – 独特分栏笔记、知识整理、记忆学习[macOS/iOS]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-25T180220.094.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43445",
          "author": "青小蛙",
          "description": "前几天有同学在寻找「长按【右箭头键 → 】三倍速播放，松开后恢复（类似B站网页端）」的视频播放器（ https://meta.appinn.net/t/topic/36323 ）。 然后大佬们纷纷献计",
          "link": "https://www.appinn.com/potplayer-fast-forward-ahk/",
          "publishedOn": "2022-09-23T10:34:50.000Z",
          "wordCount": 2416,
          "title": "PotPlayer：长按右箭头键实现三倍速播放[AHK]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/PotPlayer-Fast-forward.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43433",
          "author": "青小蛙",
          "description": "Parallels Desktop 18 是一款高性能的 macOS 虚拟机，可以用来在 Mac 电脑上以运行普通程序的方式，运行 Windows、Linux，甚至再运行一个 macOS 系统，方便随",
          "link": "https://www.appinn.com/parallels-desktop-18-coupon-code/",
          "publishedOn": "2022-09-23T05:23:08.000Z",
          "wordCount": 2395,
          "title": "Parallels Desktop 18 最新优惠码，国庆 75 折",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-23T124329.854.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43417",
          "author": "开发者推荐账号",
          "description": "万彩信息开发过很多款与制作动画相关的软件，如果是我的老粉，应该用过不少他们家的软件，比如万彩动画大师、Focusky动画演示大师、万彩微影，等等。这些软件，都有一个非常明显的特点，就是：简单高效，0基",
          "link": "https://www.appinn.com/animiz09/",
          "publishedOn": "2022-09-22T09:10:32.000Z",
          "wordCount": 2252,
          "title": "万彩特效大师(限时送会员) – 0基础轻松剪辑合成特效动画视频，不用AE也能制作特效大片",
          "enclosure": {
            "url": "https://files.animiz.cn/videoclipmaster/home/demo/award-ceremony.mp4",
            "length": "27968081",
            "type": "video/mp4"
          },
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-22T131005.929.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43416",
          "author": "青小蛙",
          "description": "EPUB Manga Creator 是一款可以把一堆漫画图片打包成 EPUB 格式的在线工具。虽然是在线版本，但内容在浏览器本地处理，无上传，所以可以速度很快，开源。@Appinn 故事是这样的，青",
          "link": "https://www.appinn.com/epub-manga-creator/",
          "publishedOn": "2022-09-22T08:35:57.000Z",
          "wordCount": 2296,
          "title": "EPUB Manga Creator – 把漫画图片打包成 EPUB 格式",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-22T160027.839.jpg"
        }
      ]
    },
    {
      "title": "Linux 中国◆开源社区",
      "feedUrl": "https://linux.cn/rss.xml",
      "siteUrl": "https://linux.cn/",
      "articles": [
        {
          "id": "https://linux.cn/article-15086-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "复古极客给 SSD 添加机械硬盘读写声音\n\r\n复古计算的一个 “问题” 是，我们用紧凑型闪存、SD 卡甚至 SSD 来取代这些传统的机械硬盘时，通常情况下不会发出任何你能听到的声音。这样不但显得不够“复古”，而且有时你无法判断电脑是崩溃了还是仍在工作。有位极客制造的一个小装置解决了这个问题，它被称为 HDD Clicker，它连接到硬盘活动指示灯，触发扬声器发出的一系列咔嚓声，听起来非常像硬盘在寻找轨道。\n\r\n\r\n消息来源：Hackday\n\r\n\r\n\r\n老王点评：我觉得我的 SSD 硬盘也需要这样一个小装置，要是能像个 U 盘一样插上就能用就更好了。这就是“无用”的极客精神。\n\r\n\r\n\n\r\n黑爵士达斯·维德的声音未来将用 AI 合成\n\r\n为星战系列的黑爵士达斯·维德的配音长达 45 年的 James Jones 已经 91 岁了。他早就考虑退出了，在创作星战电视剧《欧比旺·克诺比》期间，James Jones 签署了允许迪士尼在未来项目中使用 AI 合成其声音的协议。他们使用的软件是 AI 语音建模工具 Respeecher，它使用了深度学习去建模和复制人类声音，能达到以假乱真。在此之前卢卡斯公司使用该软件在《曼达洛人》中克隆了天行者卢克的扮演者的声音。\n\r\n\r\n消息来源：Ars Technica\n\r\n\r\n\r\n老王点评：从配音演员、有声书朗读演员开始，AI 真的会接管很多工作。\n\r\n\r\n\n\r\nCloudflare 宣布了一个新的“验证码”服务\n\r\nCloudflare 本周宣布了一个名为 Turnstile 的项目，旨在取消整个网络上用来验证人们是否机器人的传统验证码。它会根据遥测和会话中表现出的客户行为自动选择浏览器挑战方案，以检查网页的访问者是否实际上是机器人。廉价劳动力的兴起、各种验证码类型的错误以及自动解算器让验证码越来越容易绕过。一些研究人员声称基于 AI 的攻击可以成功解决世界上最受欢迎的网站使用的验证码。\n\r\n\r\n消息来源：Tech Crunch\n\r\n\r\n\r\n老王点评：终究还是一种高级的验证码。\n\r\n\r\n回音\n\r\n\r\n谷歌 推迟 MV2 扩展淘汰时间，明年 1 月起停止接受 MV2 扩展更新，这些扩展将从明年 6 月开始不再列出。",
          "link": "https://linux.cn/article-15086-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-29T09:46:33.000Z",
          "wordCount": 488,
          "title": "硬核观察 #774 复古极客给 SSD 添加机械硬盘读写声音",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15085-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Rust for Linux 这个项目是希望今后可以使用 Rust 编程语言来编写内核代码，该项目已经进行了几年，有越来越多的开发者认为是时候将这项工作合并到主线中了。在 2022 年的 Linux 内核维护者峰会上，Miguel Ojeda 向大家更新了此项目的最新状况，希望能达成一致来确定何时可以完成合并。\n\r\n他得到的答案是很清晰的：内核中确实很快会有 Rust 了。\n\r\n这方面并没有什么悬念。Linus Torvalds 在会议开始时就说，他计划接受（可能在 12 月中旬发布的） 6.1 内核的 Rust 补丁，除非他听到强烈的反对意见。Ojeda 表示，他很期待这一天，并询问这些补丁应该如何进入主线。Torvalds 说，他不愿意直接接受这些补丁，所以看起来很可能需要 Kees Cook 来将这项工作引向上游。\n\r\nDave Airlie 说，有一些 MacBook 驱动程序的开发者打算用 Rust 来做他们的工作，所以很可能在不久之后就会有真正的 Rust 驱动程序进入上游了。不过，Torvalds 说他希望最开始只合入尽量少的内容，只是让基础设施先进入内核，让开发者开始使用它。它应该可以完成编译，但应该基本仅限在 “hello, world” 这种水平就好。他说，这将是一个向世界发出的信号：“终于落地了”。\n\r\nGreg Kroah-Hartman 问道，针对特定子系统的 Rust 绑定实现，该如何进入上游；是应该通过 Rust 树还是通过相关子系统的维护者？Ojeda 回答说，Rust 核心支持应该通过 Rust 树来合入，但其他的应该经过维护者来合入。Alexei Starovoitov 担心，如果子系统维护者不想在他们的子系统中使用 Rust，他们也无法拒绝 Rust 补丁；James Bottomley 补充说，对于长期从事 C 语言开发的人来说，Ru…",
          "link": "https://linux.cn/article-15085-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-29T07:43:16.000Z",
          "wordCount": 662,
          "title": "Linux 内核开发者对 Rust 进入内核的讨论",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15084-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Colima 是 macOS 和 Linux 上的 Docker Desktop 替代品，它现在由 DDEV 支持。\n\r\n\r\nDDEV 是一个开源工具，可以在几分钟内轻松启动和运行本地 PHP 开发环境。由于其每个项目的环境配置可以扩展、版本控制和共享，所以它很强大和灵活。简而言之，DDEV 旨在允许开发团队在其工作流程中使用容器，而无需复杂的定制配置。\n\r\nDDEV 用灵活、现代、基于容器的解决方案取代了更传统的 AMP 栈解决方案（WAMP、MAMP、XAMPP 等）。因为它使用容器，DDEV 允许每个项目使用任何一组应用、Web 服务器版本、数据库服务器、搜索索引服务器和其他类型的软件。\n\r\n2022 年 3 月，DDEV 团队 宣布支持 Colima，这是 macOS 和 Linux 上的开源 Docker Desktop 替代品。Colima 是开源的，据所有报告显示，它比其替代方案有所 性能提升，所以使用 Colima 似乎是一个没有问题的选择。\n\r\n迁移到 Colima\n\r\n首先，Colima 几乎是 Docker Desktop 的替代品。我说几乎是因为在将它用于现有的 DDEV 项目时需要重新配置。具体来说，必须重新导入数据库。解决方法是先导出数据库，然后启动 Colima，然后再导入。很简单。\n\r\nColima 要求安装 Docker 或 Podman 命令。在 Linux 上，它还需要 Lima。\n\r\nDocker 默认随 Docker Desktop for macOS 一起安装，但它也可以作为独立命令使用。如果你想要 100% 纯 Colima，你可以卸载 Docker Desktop for macOS，并独立安装和配置 Docker 客户端。完整的安装说明可以在 DDEV 文档站点上找到。\n\r\n\n\r\n容器技术栈图片 图片来源：（Mike Ane…",
          "link": "https://linux.cn/article-15084-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-29T01:53:34.000Z",
          "wordCount": 664,
          "title": "我如何从 Docker Desktop 切换到 Colima",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15083-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Constellation 是第一个始终加密的 kubernetes（K8S）。在这个 K8S 中，你的所有工作负载和控制平面都被完全屏蔽起来，你可以使用加密证书远程确认这一点。\n\r\n\r\nConstellation Kubernetes 引擎使用 秘密计算secret computing 和 机密虚拟机confidential VM，将 Kubernetes 集群与云架构的其余部分隔离开来。因此，无论是在静态还是在内存中，数据总是被加密的，并创建了一个 机密上下文confidential context。根据创建 Constellation 的公司 Edgeless Systems 的说法，由于它为在公共云上运行的数据和工作流增加了安全性和保密性，因此机密计算是云计算的未来。\n\r\nKubernetes 节点在使用 Constellation 的私有虚拟机中运行。根据 Edgeless Systems 的说法，机密虚拟机是安全飞地的演变，它将机密计算的三个原则——运行时加密、隔离和远程证明——扩展到整个虚拟系统。机密虚拟机（TDX）使用底层硬件对私有计算的特殊支持，例如 AMD 安全加密虚拟化（AEM）、SEV-安全嵌套分页（SEV-SNP）和英特尔信任域扩展。此外，ARM 去年还发布了名为 Realms 的新 V9 架构。此设计包括私有 VM 功能。\n\r\nConstellation 尝试在集群级别提供证明或通过加密证书进行验证，以及“始终在线”加密。 Constellation 中的机密 VMS 使用了 Fedora CoreOS，它构建在一个不可变的文件系统之上，是面向容器而设计的。Constellation 还利用 Sigstore 来保护 DevOps 信任链。\n\r\n使用秘密计算时，性能可能会令人担忧。是的，加密会影响性能，但 AMD 和微软的联合基准测试发现，这只会导致 2% 到 8% 之间的微小性能损失。Edgeless Systems 声称 Constellation 将在繁重的工作负载下表现类似。\n\r\n鉴于 Constellation 已通过 CNCF 认证，并且可与包括 GCP 和 Azure 在内的所有主要云服务互操作，这应保证其与其他 Kubernetes 工作负载和工具的互操作性。\n\r\n\r\nvia: https://www.opensourceforu.com/2022/09/kubernetes-to-soon-support-confidential-computing/\n\r\n作者：Laveesh Kocher 选题：lkxed 译者：littlebirdnest 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15083-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-29T01:22:43.000Z",
          "wordCount": 509,
          "title": "Kubernetes 即将支持机密计算",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15082-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Linus Torvalds 获颁英特尔首个终身创新成就奖\n\r\n在英特尔 2022 创新大会上的开幕致辞中，CEO Pat Gelsinger 将 Linus Torvalds 邀请到了台上，向他颁发了首个终身创新成就奖，并向他赠送了一本签名的关于 80386 开发的书。Pat 写的这本书让 Torvalds 对机器架构有了深入了解，并在后来的 Linux 内核代码开发工作中发挥了重要的作用。Torvalds 之前也得过其它奖项，如 2014 年 IEEE 计算机协会计算机先锋奖。\n\r\n\r\n消息来源：Hot Hardware\n\r\n\r\n\r\n老王点评：Torvalds 确实做到了终身成就。\n\r\n\r\n\n\r\n英特尔认为摩尔定律仍旧有效\n\r\n之前我们报道过，英伟达的黄仁勋称，蛮力加晶体管的方法和摩尔定律的进步基本上已经走到了尽头。但英特尔 CEO 在周二的发布会上称，摩尔定律“依然有效”，英特尔正致力于推进制造工艺的进步，例如采用新的光刻技术和 RibbonFET 架构。他说，“我们希望从今天的单个封装上容纳大约1000亿个晶体管开始，到这个十年结束时实现在单个封装中加入一万亿个晶体管”。\n\r\n\r\n消息来源：Digital Trends\n\r\n\r\n\r\n老王点评：或许一两年之后，我们再来看这条新闻。\n\r\n\r\n\n\r\nRust for Linux v10 补丁发布，预计合并到 Linux 6.1\n\r\nv10 补丁主要是对以前的 v9 补丁的一些最小的修改，该补丁集包括 27 个补丁，共计 12.5 万行新代码。与之前相比，这是一个较小的 Rust 补丁系列，目的是为了更容易地实现合并到上游。一旦这项工作被主线化，使 Rust 支持更多的内核子系统和早期的 Rust 驱动就可以继续开发，并持续实现主线化。\n\r\n\r\n消息来源：Phoronix\n\r\n\r\n\r\n老王点评：这回应该定了，主要是前几天内核开发者们开会达成了共识。",
          "link": "https://linux.cn/article-15082-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-28T09:02:45.000Z",
          "wordCount": 487,
          "title": "硬核观察 #773 Linus Torvalds 获颁英特尔首个终身创新成就奖",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15081-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "对开源的信任是一个正反馈循环。\n\r\n\r\n\n\r\n这是我即将在 Wiley 出版的《计算和云计算中的信任Trust in Computing and the Cloud》一书中经过编辑的节选，也是我之前写的一篇文章《信任与选择开源》Trust & choosing open source的延伸。\n\r\n在那篇文章中，我提出了一个问题。当我们说 “我相信开放源码软件” 时，我们在做什么？作为回答，我认为，我们正在做的是确定有足够多的编写和测试该软件的人与我有类似的要求，而且他们的专业知识加在一起，使我使用该软件的风险可以接受。我同时也介绍了 “分布式信任distributed trust” 的概念。\n\r\n在社区内分布信任的概念是亚里士多德提出的 “人群智慧理论wisdom of the crowd theory” 的应用，其中的假设是，许多人的意见通常比一个人或少数人的意见更有明智。虽然在某些情况下，最简单的形式显然是错误的 —— 最明显的例子是民众对极权主义政权的支持 —— 但这一原则可以为建立某些信息提供一个非常有效的机制。\n\r\n我们称这种集体经验的提炼为“分布式信任”，它通过互联网上的许多机制收集。如 TripAdvisor 或 Glassdoor，记录了关于组织或其提供的服务的信息，还有像 UrbanSitter 或 LinkedIn，允许用户添加关于特定人的信息（例如，见 LinkedIn 的推荐和技能与个人档案中的认可部分）。从这些例子中可以获得的利益因网络效应而大大增加，因为随着成员数量的增加，成员之间可能的联系数量也成倍增加。\n\r\n分布式信任的例子还包括像 Twitter 这样的平台，一个账户的追随者数量可以被视为衡量其声誉，甚至是衡量其可信度的标准，我们应该以强烈的怀疑态度去看待这种计算。事实上，Twitter 认为它必须解决拥有大量追随者的账户的社会力量问题，并…",
          "link": "https://linux.cn/article-15081-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-28T07:39:18.000Z",
          "wordCount": 522,
          "title": "开源如何构建分布式信任",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15080-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Fedora 现场 USB 发行版为引导和进入恢复模式提供了有效的解决方案。\n\r\n\r\n我的家庭实验室里有十几台物理计算机以及更多的虚拟机。这些系统中的大多数是我用来进行测试和实验的。我经常写使用自动化来简化系统管理任务的文章。我还在多个地方写过，我从自己的错误中学到的东西比几乎任何其他方式都多。\n\r\n在过去的几周里，我学到了很多东西。\n\r\n我给自己制造了一个大麻烦。作为多年的系统管理员，我写了数百篇关于 Linux 的文章和五本书，我应该对 Linux 更了解。话又说回来，我们都会犯错，这是一个重要的教训：你永远不会因为有经验而不犯错。\n\r\n我不打算讨论我的错误的细节。告诉你这是一个错误就足够了，在我做之前我应该多考虑一下我在做什么。此外，细节并不是重点。经验不能让你免于犯下的每一个错误，但它可以帮助你恢复。这就是本文要讨论的内容：使用现场 USB 发行版启动并进入恢复模式。\n\r\n问题\n\r\n首先，我制造了问题，这本质上是 /etc/default/grub 文件的错误配置。接下来，我使用 Ansible 将错误配置的文件分发到我所有的物理计算机并运行 grub2-mkconfig。全部 12 个。这真的，真的很快。\n\r\n除了两台之外，所有的都无法启动。它们在 Linux 启动的早期阶段崩溃，出现各种无法定位 /root 文件系统的错误。\n\r\n我可以使用 root 密码进入“维护”模式，但是如果没有挂载 /root，即使是最简单的工具也无法访问。直接引导到恢复内核也不起作用。系统真的被破坏了。\n\r\nFedora 恢复模式\n\r\n解决此问题的唯一方法是找到进入恢复模式的方法。当一切都失败时，Fedora 提供了一个非常酷的工具：用于安装 Fedora 新实例的现场 USBLive USB 驱动器。\n\r\n将 BIOS 设置为从现场 USB 设备启动后，我启动到 Fedora 36 …",
          "link": "https://linux.cn/article-15080-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-28T04:12:00.000Z",
          "wordCount": 726,
          "title": "我如何使用现场 USB 设备恢复我的 Linux 系统",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15079-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Audacity 的新更新带来了一些重要功能，例如 VST3 插件支持和新效果按钮。\n\r\n\r\n\n\r\nAudacity 3.2 来了，这是这个最流行的自由开源音频编辑和录制工具之一的小版本更新。\n\r\n此版本是在之前的主要版本 Audacity 3.0 发布一年多之后发布的。\n\r\n即使在去年引起争议 之后，它仍然是目前最好的 Linux 音频编辑器之一。\n\r\n此版本有许多新增功能，例如对VST3 插件的支持、对 Apple 芯片、FFMPEG 5.0 的支持等等。\n\r\n让我们快速了解一下 Audacity 的新功能。\n\r\nAudacity 3.2：有什么新功能？\n\r\n这是一个小版本更新，带来了重大的变化和补充。\n\r\n一些主要亮点包括：\n\r\n\r\n支持 VST3 插件。\n\r\nApple 芯片支持。\n\r\nFFMPEG 5.0。\n\r\nVST3、LV2、音频单元和 LADSPA 的实时功能。\n\r\n用于实时效果的专用按钮。\n\r\n删除对 Linux 系统的 JACK 要求。\n\r\n对用户界面的各种调整。\n\r\n\r\n新的效果按钮\n\r\n\n\r\nAudacity 的界面中添加了一个专用的实时效果按钮，使用户可以轻松地即时下载和应用效果。\n\r\n你可以访问官方维基 了解有关此功能的更多信息。\n\r\nVST3 插件支持\n\r\nAudacity 3.2 还引入了对 VST3 插件的支持，这使用户能够利用 VST3 的高级音频处理功能，包括高效利用 CPU、更好地处理 MIDI、支持 MIDI I/O 等等。\n\r\n将音频上传到云端\n\r\n\n\r\n在 Audacity 中加入的另一个令人兴奋的功能是，可以选择直接从应用程序中分享音频到 Audacity 的新云音频平台 audio.com。\n\r\nFFMPEG 5.0\n\r\nAudacity 现在也支持了 FFMPEG 5.0；这确保了用户可以利用最新的开源音频/视频库套件。\n\r\n苹果芯片支持\n\r\n此版本还为基于 arm64 架构的 Apple 芯片带来了 macOS 支持。\n\r\n下载 Audacity 3.2\n\r\n你可以通过其官方网站、GitHub 发布区、Flathub 或 Snap 下载最新的 Audacity 版本。\n\r\n\r\nAudacity 3.2 下载\n\r\n\r\n💬 你会尝试 Audacity 3.2 吗？我认为对VST3插件的支持应该是一个改变游戏规则的因素，你怎么看？在下面的评论部分分享它！\n\r\n\r\nvia: https://news.itsfoss.com/audacity-3-2-release/\n\r\n作者：Sourav Rudra 选题：lkxed 译者：littlebirdnest 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15079-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-28T01:22:18.000Z",
          "wordCount": 549,
          "title": "Audacity 3.2 发布，增加了 VST3 插件和 Apple 芯片支持",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15078-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "喜欢阅读漫画书吗？有 大量可用于 Linux 的漫画阅读器。\n\r\n但是，为日漫Manga量身定做的东西呢？\n\r\n我想我找到了一个适合阅读漫画的完美应用，它可以管理它们，也可以下载它们进行离线使用。我最近发现的这个应用叫做 Kommiku。\n\r\n让我提一下这个应用的主要亮点，并帮助你在 Linux 上开始使用它。\n\r\nKomikku: 一个 Linux 专用的日漫阅读器\n\r\n\n\r\nKomikku 是一个开源的日漫阅读器，且仅有 Linux 应用。\n\r\n它主要是为配合 GNOME 桌面环境而定制的，但你也可以在运行 其他桌面环境 的 Linux 发行版上使用它。\n\r\n许多 PDF 或 电子书阅读器，如 Bookworm、Calibre 和 Foliate 都支持漫画书格式。\n\r\n然而，Komikku 用户会有更多的功能，以获得阅读漫画的良好体验。\n\r\n\n\r\n例如，Komikku 可在线和离线观看日漫。此外，你可以从支持的服务器上下载它。\n\r\nKomikku 的特点\n\r\nKomikku 的一些最佳功能包括：\n\r\n\r\n从几十个支持的服务器进行在线阅读。\n\r\n离线阅读已下载的日漫。\n\r\n按类别组织你的日漫库。\n\r\n从右到左、从左到右、垂直和网络漫画阅读模式。\n\r\n几种类型的导航（键盘方向键、通过鼠标左右滑动或点击（触摸板/触摸屏）、滚轮和滑动手势（触摸板和触摸屏）。\n\r\n自动更新漫画。\n\r\n自动下载新章节。\n\r\n阅读历史。\n\r\n浅色和深色主题。\n\r\n自适应设计（能够从桌面工作站扩展到移动电话）。\n\r\n键盘快捷键。\n\r\n\r\n\n\r\n安装\n\r\nKomikku 可在 Flathub 上找到。因此，你可以把它安装在任何 Linux 发行版上。\n\r\n不过，你需要 在你的系统上设置 Flatpak 并启用 Flathub 仓库。\n\r\n当你在系统上设置了 Flatpak，你可以通过软件中心搜索它，或者从你的终端安装它。\n\r\n\n\r\n要使用终端安装 Komikku，请输入以下命令：\n\r\nflatpak install flathub info.febvre.Komikku\r\n\n\r\nKomikku 的原生包也可用于 Arch Linux 和 Fedora 等发行版。以下是安装它们的命令：\n\r\n对于 Arch Linux（在 AUR 中可用）：\n\r\nyay -Syu komikku\r\n\n\r\n对于 Fedora（在官方仓库中可用）：\n\r\nsudo dnf install komikku\r\n\n\r\n在其 GitLab 页面上可以查看 Komikku 的源代码以及从源代码构建它的说明。可以前往其官方网页了解更多信息。\n\r\n\r\n下载 Komikku\n\r\n\r\n总结\n\r\n我发现 Komikku 非常直观干净。我注意到在线服务器并不总是工作，经常有一些小故障，但管理离线漫画和将你的藏品分类是毫不费力的。\n\r\n所有这些都要感谢 Valéry Febvre（Komikku 的开发者），我们有了另一个有用的 Linux 应用。如果你喜欢这个应用，你可以考虑向该项目捐款。\n\r\n你使用哪种漫画书阅读器？你会尝试 Komikku 吗？请在下面的评论中告诉我你的想法。\n\r\n\r\nvia: https://itsfoss.com/komikku-manga-reader/\n\r\n作者：Anuj Sharma 选题：lkxed 译者：geekpi 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15078-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-27T09:57:58.000Z",
          "wordCount": 554,
          "title": "Komikku: 一个自由开源的 Linux 日漫阅读器",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15077-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "20 年历史的芯片组补丁影响现代 AMD Linux 系统\n\r\nAMD 工程师发现内核中一个有 20 年历史的芯片组补丁仍然被应用于现代 AMD 系统，在特定工作负荷下会影响 Zen 架构处理器的性能。旧代码与 ACPI 处理器空闲代码有关，旨在修复使用 VIA 芯片组的 AMD Athlon 处理器的问题。它不影响英特尔处理器。修复此问题的补丁将在 Linux 6.0 中合并。\n\r\n\r\n消息来源：Phoronix\n\r\n\r\n\r\n老王点评：看来 Linux 内核中的这种遗留问题也不少啊，毕竟作为一个 30 年的项目，已经庞大到很难全面了解的程度了。\n\r\n\r\n\n\r\nOpenAI 开源多语言语音识别系统\n\r\nOpenAI 开源了 Whisper，这是一个自动语音识别系统，该公司声称可以实现多种语言的 “鲁棒” 转录，以及从这些语言翻译成英语。OpenAI 称，Whisper 的与其它的语音识别系统的同之处在于，它是在 68 万小时的多语言和 “多任务” 数据基础上训练出来的，这些数据从网络上收集而来，从而提高了对独特口音、背景噪音和技术术语的识别。\n\r\n\r\n消息来源：Tech Crunch\n\r\n\r\n\r\n老王点评：可能会有更智能的语音助手出现，毕竟这是开源了的。\n\r\n\r\n\n\r\n勒索软件开始摧毁数据而不是加密数据\n\r\n研究人员发现，至少有一个勒索软件团伙正在试验一种新的攻击方式，这种方式不是加密数据，而是直接摧毁数据。其目的是使受害者在不支付赎金的情况下无法获取到他们的数据。摧毁数据比加密数据更简单，也可以避免加密数据被解密，因而致使受害者更容易支付赎金。\n\r\n\r\n消息来源：ZDNet\n\r\n\r\n\r\n老王点评：这要比以前的勒索软件更危险，所以，作为底线，无论如何，勤备份。",
          "link": "https://linux.cn/article-15077-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-27T09:43:31.000Z",
          "wordCount": 480,
          "title": "硬核观察 #772 20 年历史的芯片组补丁影响现代 AMD Linux 系统",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15076-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "UbuntuDDE 22.04 LTS 发布，带有 Linux 内核 5.15、深度应用商店及一些升级。\n\r\n\r\n\n\r\nUbuntuDDE Remix 是一个在 Ubuntu 之上集成深度桌面环境（DDE）的发行版。不想尝试深度发行版但喜欢其用户界面的用户可以尝试一下。\n\r\n它以 Ubuntu 22.04 LTS 为基础，这是一次主要版本升级。\n\r\n让我们看看他们能提供什么。\n\r\nUbuntuDDE Remix 22.04 的新内容\n\r\n他们通过这个发行版为 Ubuntu 添加了许多新东西，例如 “全局搜索栏”、基于 GTK 的应用程序的升级版本、新壁纸、深度应用程序商店等等。\n\r\n让我们看看 UbuntuDDE Remix 22.04 带来的一些关键变化。\n\r\nDDE 全局搜索\n\r\n\n\r\n他们称之为 “DDE 全局搜索”，这是一个快速应用启动器。\n\r\n这使用户能够快速搜索任何内容，无论是应用程序、文件、文件夹，甚至是简单的网络搜索。它由键盘快捷键（Shift + Space）激活。\n\r\nLinux 内核 5.15\n\r\n该发行版还具有 Linux 内核 5.15，它为各种功能打开了大门，例如对英特尔 Alder Lake CPU 的增强支持、对 NTFS3 驱动程序的改进、改进的苹果 M1 支持等等。\n\r\n我们之前介绍了此 Linux 内核版本的亮点，你可以 查看它 以获取更多信息：\n\r\n重新设计的新安装程序\n\r\n\n\r\nUbuntuDDE Remix 上的安装程序似乎从 Qt 安装程序框架 的书中吸取了一些经验，在 Calamares 安装程序中提供了基于 Qt 的样式，并有一个非常熟悉的布局，可以毫不费力地安装发行版的所有常规选项。\n\r\n新壁纸\n\r\n\n\r\n该版本还包括许多新壁纸供你使用。\n\r\n🛠️ 其他变化\n\r\n你可以期待它附带的明显的深度应用程序和好东西。一些值得一提的包括：\n\r\n\r\n预装深度应用商店\n\r\nLibreOffice 7.3.6.2\n\r\n通过 OTA 更新定期进行软件更新\n\r\n包含升级的基于 DTK 的应用程序，如深度音乐、深度终端、Boot Maker、系统监视器等\n\r\n\r\n下载 UbuntuDDE 混音 22.04\n\r\n你可以前往官方 下载页面下载 UbuntuDDE Remix 22.04 的 ISO 文件。\n\r\n\r\nUbuntuDDE Remix 22.04\n\r\n\r\n如果你正在寻找一个现场 USB 创建工具来安装 UbuntuDDE Remix，请阅读本指南以轻松创建一个：\n\r\n\r\n在 Linux 上使用 Rufus？这是一些最好的现场 USB 创建工具\n\r\n\r\n请注意，它不是 Ubuntu 的官方版本（因此是 “Remix”），但可以马上尝试深度桌面看起来很令人兴奋。\n\r\n💬 你怎么看？你想在 Ubuntu 上体验深度桌面吗？\n\r\n\r\nvia: https://news.itsfoss.com/ubuntudde-remix-22-04-released/\n\r\n作者：Sourav Rudra 选题：lkxed 译者：littlebirdnest 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15076-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-27T07:45:08.000Z",
          "wordCount": 563,
          "title": "UbuntuDDE Remix 22.04 LTS 发布！",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15075-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "如今，Mac 应用商店正在售卖 LibreOffice。难道它不是免费的吗？我们来了解一下个中缘由。\n\r\n\r\n\n\r\nLibreOffice 是一个自由、开源、跨平台的办公套件。\n\r\n所以它一直是 微软 Office 的最佳免费替代品。\n\r\n如果事实的确如此, 我现在怎么会在这里讨论 LibreOffice 的购买呢？\n\r\n文档基金会计划向市场推出这个项目以筹集资金，\n\r\n如今文档基金会正在努力改进营销策略，鼓励人们支持 LibreOffice 的发展。\n\r\n当然，发布企业版是他们能做到的最好方式之一。\n\r\n但是，能否通过提供相似的服务，把这种机会扩展到终端用户呢？\n\r\n最方便的办法 是像 Mac 应用商店那样，通过专有渠道销售 LibreOffice。\n\r\n最近，文档基金会 宣布 在 Mac 应用商店销售 LibreOffice；他们是这么说的：\n\r\n\r\n跟以前的情况相比，文档基金会在 Mac 应用商店发布软件的举措是一次变革，这是一种新的市场策略：文档基金会专注于社区版的发布，而属于相关生态系统的公司专注于针对企业用户的、长期提供支持服务以及能够带来价值增值的版本。\n\r\n\r\n很多用户信赖并依靠的是自己平台的官方应用商店。因此，在他们的官方应用商店销售 LibreOffice 能起到方便用户的作用。你可以自动将 LibreOffice 更新为最新版本，而无需每次更新时下载相应的版本。\n\r\n\n\r\n为了享受从 Mac 应用商店下载 LibreOffice 的便利，你需要一次性付费购买。\n\r\n它在 Mac 应用商店的卖价是 8.99 美元。\n\r\n\r\n你仍然可以在 LibreOffice 网站 上免费下载 Mac 版 LibreOffice。\n\r\n\r\nMac 应用商店不是已经可以下载了吗？\n\r\n\n\r\n嗯，是，也不是。\n\r\nCollabora Office（基于 LibreOffice 的企业版）在 Mac 应用商店售价是 8.99 美元。\n\r\n它基于 LibreOffice，并不完全是 LibreOffice 的社区版本。所以现在，文档基金会在 Mac 应用商店推出了社区版。\n\r\n他们也在告示中提到：\n\r\n\r\n“我们感谢 Collabora 公司长期以来在 Mac 应用商店对 LibreOffice 的支持”\n\r\n- Italo Vignoli，LibreOffice 市场营销团队\n\r\n\r\n（LCTT 校注：也就是说，文档基金会在 Mac 应用商店推出的 LibreOffice 是无商业支持的社区版，和具有商业支持的、基于企业版定制的 Collabora Office 的售价一样。因此，这种行为可看作是文档基金会的某种自愿募捐方式 —— 如果不愿意捐助，你可以继续下载免费版本。）\n\r\n这笔费用对 LibreOffice 有何帮助？\n\r\n截至目前，LibreOffice 已成为一个大型开源项目。很多 Linux 发行版中默认自带 LibreOffice，这并不奇怪，一些教育机构也决定使用 LibreOffice，从而取代微软 Office。\n\r\n当然，它可能在某种意义上并不完美。但是它正在不断取得进步，能满足用户关于文档、表格或演示文稿方面的基本功能。\n\r\n所以，收取的费用将用于项目的支持工作，可以覆盖项目的维护成本和远期用于支付贡献者和文档基金会工作人员的相关费用。\n\r\n微软应用商店也会推出 LibreOffice 吗？\n\r\n\n\r\n微软应用商店现在并不直接提供 LibreOffice。\n\r\n在微软应用商店，你可以以 14.99 美元的价格购买 Collabora Office。但是，文档基金会还没有发布官方的社区版。\n\r\n还有 Allo Office，以前被称为 LibreOffice Vanilla。\n\r\n也许在它登陆 Mac 应用商店之后，他们可能会把它引入微软商店。\n\r\n💬 对于在 Mac 应用商店购买 LibreOffice，你怎么看？\n\r\n\r\nvia: https://news.itsfoss.com/libreoffice-mac-os-store/\n\r\n作者：Ankush Das 选题：lkxed 译者：cool-summer-021 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15075-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-27T07:15:00.000Z",
          "wordCount": 576,
          "title": "为什么 LibreOffice 在 Mac 应用商店卖 8.99 美元？",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "先知安全技术社区",
      "feedUrl": "https://xz.aliyun.com/feed",
      "siteUrl": "https://xz.aliyun.com/forum/",
      "articles": [
        {
          "id": "https://xz.aliyun.com/t/11732",
          "author": null,
          "description": "0ctf2022 hessian-only-jdk writeup jdk原生链",
          "link": "https://xz.aliyun.com/t/11732",
          "publishedOn": "2022-09-28T08:51:31.000Z",
          "wordCount": null,
          "title": "0ctf2022 hessian-only-jdk writeup jdk原生链",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11740",
          "author": null,
          "description": "警惕破解软件！APS 窃密木马已感染万余台设备",
          "link": "https://xz.aliyun.com/t/11740",
          "publishedOn": "2022-09-28T08:50:00.000Z",
          "wordCount": null,
          "title": "警惕破解软件！APS 窃密木马已感染万余台设备",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11734",
          "author": null,
          "description": "API安全漏洞靶场crapi的基本介绍与解题思路",
          "link": "https://xz.aliyun.com/t/11734",
          "publishedOn": "2022-09-28T08:48:22.000Z",
          "wordCount": 388,
          "title": "API安全漏洞靶场crapi的基本介绍与解题思路",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11727",
          "author": null,
          "description": "某json 1.2.80 漏洞分析",
          "link": "https://xz.aliyun.com/t/11727",
          "publishedOn": "2022-09-27T08:40:47.000Z",
          "wordCount": null,
          "title": "某json 1.2.80 漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11728",
          "author": null,
          "description": "关于HTTP Request Smuggling（HTTP请求夹带）的二三事",
          "link": "https://xz.aliyun.com/t/11728",
          "publishedOn": "2022-09-27T06:39:49.000Z",
          "wordCount": null,
          "title": "关于HTTP Request Smuggling（HTTP请求夹带）的二三事",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11721",
          "author": null,
          "description": "某开源堡垒机历史漏洞分析",
          "link": "https://xz.aliyun.com/t/11721",
          "publishedOn": "2022-09-22T15:55:37.000Z",
          "wordCount": null,
          "title": "某开源堡垒机历史漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11723",
          "author": null,
          "description": "CVE-2022-33980命令执行漏洞分析",
          "link": "https://xz.aliyun.com/t/11723",
          "publishedOn": "2022-09-21T15:54:31.000Z",
          "wordCount": null,
          "title": "CVE-2022-33980命令执行漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11729",
          "author": null,
          "description": "从前端代码审计挖掘未授权进入后台到文件上传拿下某色情网站",
          "link": "https://xz.aliyun.com/t/11729",
          "publishedOn": "2022-09-21T15:52:28.000Z",
          "wordCount": null,
          "title": "从前端代码审计挖掘未授权进入后台到文件上传拿下某色情网站",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11711",
          "author": null,
          "description": "Dll劫持注入从原理到白加黑漏洞利用",
          "link": "https://xz.aliyun.com/t/11711",
          "publishedOn": "2022-09-21T15:51:59.000Z",
          "wordCount": null,
          "title": "Dll劫持注入从原理到白加黑漏洞利用",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11720",
          "author": null,
          "description": "对writeObject流程动点手脚",
          "link": "https://xz.aliyun.com/t/11720",
          "publishedOn": "2022-09-20T15:59:24.000Z",
          "wordCount": null,
          "title": "对writeObject流程动点手脚",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11716",
          "author": null,
          "description": "关于\"linux capability\"的两个特殊案例",
          "link": "https://xz.aliyun.com/t/11716",
          "publishedOn": "2022-09-20T15:57:55.000Z",
          "wordCount": null,
          "title": "关于\"linux capability\"的两个特殊案例",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11722",
          "author": null,
          "description": "GenieACS CVE-2021-46704认证前RCE漏洞分析",
          "link": "https://xz.aliyun.com/t/11722",
          "publishedOn": "2022-09-20T15:54:08.000Z",
          "wordCount": null,
          "title": "GenieACS CVE-2021-46704认证前RCE漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11701",
          "author": null,
          "description": "goby指纹提取与yara逆向.md",
          "link": "https://xz.aliyun.com/t/11701",
          "publishedOn": "2022-09-19T15:55:27.000Z",
          "wordCount": null,
          "title": "goby指纹提取与yara逆向.md",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11714",
          "author": null,
          "description": "记一次较为详细的某CMS代码审计",
          "link": "https://xz.aliyun.com/t/11714",
          "publishedOn": "2022-09-19T15:53:01.000Z",
          "wordCount": null,
          "title": "记一次较为详细的某CMS代码审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11705",
          "author": null,
          "description": "一些BAT的XSS实例（四）高级篇",
          "link": "https://xz.aliyun.com/t/11705",
          "publishedOn": "2022-09-16T02:40:54.000Z",
          "wordCount": null,
          "title": "一些BAT的XSS实例（四）高级篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11697",
          "author": null,
          "description": "利用ASP.NET Web API Help Page文件上传",
          "link": "https://xz.aliyun.com/t/11697",
          "publishedOn": "2022-09-16T02:35:20.000Z",
          "wordCount": null,
          "title": "利用ASP.NET Web API Help Page文件上传",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11673",
          "author": null,
          "description": "基于netfilter的rootkit",
          "link": "https://xz.aliyun.com/t/11673",
          "publishedOn": "2022-09-16T02:33:43.000Z",
          "wordCount": null,
          "title": "基于netfilter的rootkit",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11699",
          "author": null,
          "description": "不常见的内存与流量取证 -- WMCTF 2022 1!5!",
          "link": "https://xz.aliyun.com/t/11699",
          "publishedOn": "2022-09-15T15:45:49.000Z",
          "wordCount": null,
          "title": "不常见的内存与流量取证 -- WMCTF 2022 1!5!",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11674",
          "author": null,
          "description": "CVE-2020-8558-跨主机访问127.0.0.1",
          "link": "https://xz.aliyun.com/t/11674",
          "publishedOn": "2022-09-15T15:41:29.000Z",
          "wordCount": null,
          "title": "CVE-2020-8558-跨主机访问127.0.0.1",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11676",
          "author": null,
          "description": "红日安全团队ATT&CK(二)实战系列靶场",
          "link": "https://xz.aliyun.com/t/11676",
          "publishedOn": "2022-09-15T15:40:07.000Z",
          "wordCount": null,
          "title": "红日安全团队ATT&CK(二)实战系列靶场",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11656",
          "author": null,
          "description": "“黑猫”又伸出恶魔之手？揭秘BlackCat病毒的三重勒索",
          "link": "https://xz.aliyun.com/t/11656",
          "publishedOn": "2022-09-15T15:39:00.000Z",
          "wordCount": null,
          "title": "“黑猫”又伸出恶魔之手？揭秘BlackCat病毒的三重勒索",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11703",
          "author": null,
          "description": "CVE-2022-1292的分析",
          "link": "https://xz.aliyun.com/t/11703",
          "publishedOn": "2022-09-14T13:40:35.000Z",
          "wordCount": null,
          "title": "CVE-2022-1292的分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11690",
          "author": null,
          "description": "Gitlab常见漏洞复现及后利用",
          "link": "https://xz.aliyun.com/t/11690",
          "publishedOn": "2022-09-14T13:39:16.000Z",
          "wordCount": null,
          "title": "Gitlab常见漏洞复现及后利用",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11695",
          "author": null,
          "description": "从mcms历史漏洞中捡漏",
          "link": "https://xz.aliyun.com/t/11695",
          "publishedOn": "2022-09-13T11:53:55.000Z",
          "wordCount": null,
          "title": "从mcms历史漏洞中捡漏",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11688",
          "author": null,
          "description": "2022 网鼎杯玄武组-you can find it 题解—Spring通用MemShell改造",
          "link": "https://xz.aliyun.com/t/11688",
          "publishedOn": "2022-09-13T11:52:20.000Z",
          "wordCount": null,
          "title": "2022 网鼎杯玄武组-you can find it 题解—Spring通用MemShell改造",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11669",
          "author": null,
          "description": "某后台管理系统的审计",
          "link": "https://xz.aliyun.com/t/11669",
          "publishedOn": "2022-09-09T15:56:45.000Z",
          "wordCount": null,
          "title": "某后台管理系统的审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11684",
          "author": null,
          "description": "关于那WebSocket劫持的二三事",
          "link": "https://xz.aliyun.com/t/11684",
          "publishedOn": "2022-09-08T15:55:34.000Z",
          "wordCount": null,
          "title": "关于那WebSocket劫持的二三事",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11682",
          "author": null,
          "description": "一些BAT的XSS实例（三）中级篇",
          "link": "https://xz.aliyun.com/t/11682",
          "publishedOn": "2022-09-07T15:54:00.000Z",
          "wordCount": null,
          "title": "一些BAT的XSS实例（三）中级篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11659",
          "author": null,
          "description": "红队开发基础-基础免杀(四)",
          "link": "https://xz.aliyun.com/t/11659",
          "publishedOn": "2022-09-06T15:55:00.000Z",
          "wordCount": null,
          "title": "红队开发基础-基础免杀(四)",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11653",
          "author": null,
          "description": "揭开新型窃密软件的面纱：伪装成CDR画图应用安装包",
          "link": "https://xz.aliyun.com/t/11653",
          "publishedOn": "2022-09-06T15:54:00.000Z",
          "wordCount": null,
          "title": "揭开新型窃密软件的面纱：伪装成CDR画图应用安装包",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11664",
          "author": null,
          "description": "Linux提权基础分享和讨论",
          "link": "https://xz.aliyun.com/t/11664",
          "publishedOn": "2022-09-06T15:53:35.000Z",
          "wordCount": null,
          "title": "Linux提权基础分享和讨论",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11671",
          "author": null,
          "description": "CVE-2020-28413 MantisBT SQL注入漏洞分析",
          "link": "https://xz.aliyun.com/t/11671",
          "publishedOn": "2022-09-05T15:55:21.000Z",
          "wordCount": null,
          "title": "CVE-2020-28413 MantisBT SQL注入漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11681",
          "author": null,
          "description": "一些BAT的XSS实例（二）进阶篇",
          "link": "https://xz.aliyun.com/t/11681",
          "publishedOn": "2022-09-05T15:54:50.000Z",
          "wordCount": null,
          "title": "一些BAT的XSS实例（二）进阶篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11672",
          "author": null,
          "description": "JAVA常用框架SQL注入审计",
          "link": "https://xz.aliyun.com/t/11672",
          "publishedOn": "2022-09-05T15:54:25.000Z",
          "wordCount": null,
          "title": "JAVA常用框架SQL注入审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11677",
          "author": null,
          "description": "一些BAT的XSS实例（一）基础篇",
          "link": "https://xz.aliyun.com/t/11677",
          "publishedOn": "2022-09-01T09:00:03.000Z",
          "wordCount": null,
          "title": "一些BAT的XSS实例（一）基础篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11662",
          "author": null,
          "description": "利用Nginx、Tyk Gateway API和CloudFlare防火墙隐藏C2设施",
          "link": "https://xz.aliyun.com/t/11662",
          "publishedOn": "2022-08-31T14:55:35.000Z",
          "wordCount": null,
          "title": "利用Nginx、Tyk Gateway API和CloudFlare防火墙隐藏C2设施",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11667",
          "author": null,
          "description": "域内批量获取敏感文件",
          "link": "https://xz.aliyun.com/t/11667",
          "publishedOn": "2022-08-31T14:54:03.000Z",
          "wordCount": null,
          "title": "域内批量获取敏感文件",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "dev.to top (month)",
      "feedUrl": "https://rsshub.app/dev.to/top/month",
      "siteUrl": "https://dev.to/top/month",
      "articles": [
        {
          "id": "https://dev.to/novu/building-a-beautiful-kanban-board-with-nodejs-react-and-websockets-39dk",
          "author": "Nevo David, novu",
          "description": "#react #webdev #javascript #opensource",
          "link": "https://dev.to/novu/building-a-beautiful-kanban-board-with-nodejs-react-and-websockets-39dk",
          "publishedOn": "2022-09-28T10:41:17.000Z",
          "wordCount": 6108,
          "title": "Building a Kanban board with Node.js, React and Websockets 📝 ✨",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--JnwQ3IdI--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/wz41ugndktx03dlhq8h4.png"
        },
        {
          "id": "https://dev.to/devteam/our-dear-unicorn-friend-is-going-on-vacation-idm",
          "author": "Ben Halpern, The DEV Team",
          "description": "#meta #design #ux",
          "link": "https://dev.to/devteam/our-dear-unicorn-friend-is-going-on-vacation-idm",
          "publishedOn": "2022-09-26T19:25:35.000Z",
          "wordCount": 4115,
          "title": "Our Dear Unicorn Friend is Going on Vacation",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--T79pAZ2u--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/cfpolhlbdzpvkicgbqa0.png"
        },
        {
          "id": "https://dev.to/wiseai/continue-using-env-files-as-usual-2am5",
          "author": "Mahmoud Harmouch",
          "description": "#javascript #webdev #node",
          "link": "https://dev.to/wiseai/continue-using-env-files-as-usual-2am5",
          "publishedOn": "2022-09-24T13:46:35.000Z",
          "wordCount": 17165,
          "title": "Continue Using .env Files As Usual.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--xUCEWzk_--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/3ivon50sdm1h96tluxpr.jpg"
        },
        {
          "id": "https://dev.to/dboatengx/javascript-local-storage-explained-1di6",
          "author": "Boateng Dickson",
          "description": "#javascript #beginners #webdev",
          "link": "https://dev.to/dboatengx/javascript-local-storage-explained-1di6",
          "publishedOn": "2022-09-24T09:50:58.000Z",
          "wordCount": 3287,
          "title": "JavaScript Local Storage Explained!",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7EkQoo08--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/8bjw43edlrffo5jsfw4v.png"
        },
        {
          "id": "https://dev.to/surajondev/free-awesome-notion-templates-for-developers-43mh",
          "author": "Suraj Vishwakarma",
          "description": "#javascript #webdev #beginners #react",
          "link": "https://dev.to/surajondev/free-awesome-notion-templates-for-developers-43mh",
          "publishedOn": "2022-09-22T11:34:35.000Z",
          "wordCount": 3458,
          "title": "Free Awesome Notion Templates for Developers",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--AOu5DsZ6--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/g92u94fwpd1rqighuwvm.png"
        },
        {
          "id": "https://dev.to/jamieswift90/boost-your-productivity-best-software-for-dev-teams-476g",
          "author": "Jamie Swift",
          "description": "#webdev #programming #productivity #devops",
          "link": "https://dev.to/jamieswift90/boost-your-productivity-best-software-for-dev-teams-476g",
          "publishedOn": "2022-09-22T08:24:47.000Z",
          "wordCount": 2864,
          "title": "Boost Your Productivity: Best Software For Dev Teams",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--_08PegJt--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vixsld9i4yrqr05l27nh.png"
        },
        {
          "id": "https://dev.to/karanpratapsingh/system-design-netflix-3d9g",
          "author": "Karan Pratap Singh",
          "description": "#distributedsystems #architecture #tutorial",
          "link": "https://dev.to/karanpratapsingh/system-design-netflix-3d9g",
          "publishedOn": "2022-09-22T02:51:27.000Z",
          "wordCount": 4837,
          "title": "System Design: Netflix",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--EFXEDOeJ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://raw.githubusercontent.com/karanpratapsingh/portfolio/master/public/static/courses/system-design/chapter-V/netflix/banner.png"
        },
        {
          "id": "https://dev.to/karanpratapsingh/system-design-twitter-865",
          "author": "Karan Pratap Singh",
          "description": "#distributedsystems #architecture #tutorial",
          "link": "https://dev.to/karanpratapsingh/system-design-twitter-865",
          "publishedOn": "2022-09-22T02:50:33.000Z",
          "wordCount": 4987,
          "title": "System Design: Twitter",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--OnZzZxnk--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://raw.githubusercontent.com/karanpratapsingh/portfolio/master/public/static/courses/system-design/chapter-V/twitter/banner.png"
        },
        {
          "id": "https://dev.to/karanpratapsingh/system-design-whatsapp-fld",
          "author": "Karan Pratap Singh",
          "description": "#distributedsystems #architecture #tutorial",
          "link": "https://dev.to/karanpratapsingh/system-design-whatsapp-fld",
          "publishedOn": "2022-09-21T05:44:12.000Z",
          "wordCount": 5628,
          "title": "System Design: WhatsApp",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--nFT8wguM--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://raw.githubusercontent.com/karanpratapsingh/portfolio/master/public/static/courses/system-design/chapter-V/whatsapp/banner.png"
        },
        {
          "id": "https://dev.to/fredysandoval/ill-teach-you-7-array-methods-with-animations-549c",
          "author": "Fredy Sandoval",
          "description": "#javascript #array #beginners #programming",
          "link": "https://dev.to/fredysandoval/ill-teach-you-7-array-methods-with-animations-549c",
          "publishedOn": "2022-09-20T21:22:04.000Z",
          "wordCount": 2333,
          "title": "I'll teach you 7 Array methods. (with animations!)",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--PWnz6Dwd--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ns0b5yfpwzpkbeli3ftn.png"
        },
        {
          "id": "https://dev.to/hr21don/every-blogger-should-save-these-10-insanely-useful-websites-44ad",
          "author": "Helitha Rupasinghe",
          "description": "#productivity #programming #webdev #beginners",
          "link": "https://dev.to/hr21don/every-blogger-should-save-these-10-insanely-useful-websites-44ad",
          "publishedOn": "2022-09-20T09:02:11.000Z",
          "wordCount": 1768,
          "title": "Every Blogger Should Save These 10 Insanely Useful Websites 👇",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--oFECoplV--/c_imagga_scale,f_auto,fl_progressive,h_500,q_66,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/7591d0exk4j5y0vdjg94.gif"
        },
        {
          "id": "https://dev.to/gregorygaines/stop-using-env-files-now-kp0",
          "author": "Gregory Gaines",
          "description": "#javascript #webdev #node #productivity",
          "link": "https://dev.to/gregorygaines/stop-using-env-files-now-kp0",
          "publishedOn": "2022-09-19T21:04:49.000Z",
          "wordCount": 26643,
          "title": "Stop Using .env Files Now!",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--aVrIfj2y--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/e9c0wazzsnbjuewf4vvl.png"
        },
        {
          "id": "https://dev.to/enterspeed/making-a-fast-website-is-super-easy-9lb",
          "author": "Kasper Andreassen, Enterspeed",
          "description": "#webdev #performance #programming #tutorial",
          "link": "https://dev.to/enterspeed/making-a-fast-website-is-super-easy-9lb",
          "publishedOn": "2022-09-19T07:26:18.000Z",
          "wordCount": 9157,
          "title": "Making a fast website is SUPER EASY 😏",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--eHs2p1NQ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rkzv3rk0qwdgoer7ipg9.jpg"
        },
        {
          "id": "https://dev.to/wiseai/9-figma-alternatives-for-a-blazingly-fast-increase-in-your-productivity-3g40",
          "author": "Mahmoud Harmouch",
          "description": "#design #uiweekly #productivity #ux",
          "link": "https://dev.to/wiseai/9-figma-alternatives-for-a-blazingly-fast-increase-in-your-productivity-3g40",
          "publishedOn": "2022-09-18T07:35:48.000Z",
          "wordCount": 3422,
          "title": "9 Figma Alternatives For A Blazingly Fast Increase In Your Productivity.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--1LshbYpi--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://cdn.pixabay.com/photo/2018/07/30/23/20/editor-3573850_960_720.jpg"
        },
        {
          "id": "https://dev.to/aviyel/top-9-best-ui-component-librariesframeworks-in-2022-for-frontend-developers-b48",
          "author": "Pramit Marattha, Aviyel Inc",
          "description": "#webdev #css #tailwindcss #opensource",
          "link": "https://dev.to/aviyel/top-9-best-ui-component-librariesframeworks-in-2022-for-frontend-developers-b48",
          "publishedOn": "2022-09-18T07:02:36.000Z",
          "wordCount": 4894,
          "title": "9 Best UI Component Libraries/Frameworks in 2022 for Frontend Developers🔥",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--RH2DIWnx--/c_imagga_scale,f_auto,fl_progressive,h_500,q_66,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/p9jbpewbrgkcp3lkjv6d.gif"
        },
        {
          "id": "https://dev.to/saeedmosavat/stop-writing-api-functions-3693",
          "author": "Saeed Mosavat",
          "description": "#javascript #webdev #codequality #productivity",
          "link": "https://dev.to/saeedmosavat/stop-writing-api-functions-3693",
          "publishedOn": "2022-09-17T23:22:15.000Z",
          "wordCount": 4790,
          "title": "Stop writing API functions",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---uE2Eyti--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/3yt73lpk3jwfok2vea0u.jpg"
        },
        {
          "id": "https://dev.to/marodevv/built-a-devto-replica-with-the-mern-stack-and-more-fbd",
          "author": "Marwan mostafa",
          "description": "#showdev #javascript #react #node",
          "link": "https://dev.to/marodevv/built-a-devto-replica-with-the-mern-stack-and-more-fbd",
          "publishedOn": "2022-09-17T12:43:50.000Z",
          "wordCount": 3311,
          "title": "💁‍♂️ Built a Dev.to replica with The MERN stack and more",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--dBsq-zrn--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/hjqt4ea0poro5tmprvmz.png"
        },
        {
          "id": "https://dev.to/wadecodez/the-git-commands-i-use-every-day-5g17",
          "author": "Wade Zimmerman",
          "description": "#git #beginners #programming #javascript",
          "link": "https://dev.to/wadecodez/the-git-commands-i-use-every-day-5g17",
          "publishedOn": "2022-09-17T12:34:13.000Z",
          "wordCount": 3647,
          "title": "The Git Commands I Use Every Day",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--maqcEdLv--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qpmt6qdjaxbxw9h0labn.png"
        },
        {
          "id": "https://dev.to/shreyvijayvargiya/why-our-websites-are-slow-importance-of-bundle-size-1le4",
          "author": "shrey vijayvargiya",
          "description": "#programming #react #javascript #webdev",
          "link": "https://dev.to/shreyvijayvargiya/why-our-websites-are-slow-importance-of-bundle-size-1le4",
          "publishedOn": "2022-09-17T11:31:19.000Z",
          "wordCount": 4481,
          "title": "Why our websites are slow — Importance of bundle size",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--xSJS3Y_w--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/y53ptgcsw8i30dipa0t8.png"
        },
        {
          "id": "https://dev.to/profydev/how-to-debug-react-apps-with-vs-code-boost-your-debugging-productivity-1k05",
          "author": "Johannes Kettmann, Profy.dev",
          "description": "#react #javascript #webdev #vscode",
          "link": "https://dev.to/profydev/how-to-debug-react-apps-with-vs-code-boost-your-debugging-productivity-1k05",
          "publishedOn": "2022-09-16T12:09:50.000Z",
          "wordCount": 3428,
          "title": "How To Debug React Apps With VS Code - Boost Your Debugging Productivity",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--ivQHK2GP--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/b4bjg33oiq261p11ask1.png"
        },
        {
          "id": "https://dev.to/madza/19-practical-es6-snippets-to-solve-common-js-problems-31o9",
          "author": "Madza",
          "description": "#webdev #javascript #frontend #productivity",
          "link": "https://dev.to/madza/19-practical-es6-snippets-to-solve-common-js-problems-31o9",
          "publishedOn": "2022-09-15T15:47:21.000Z",
          "wordCount": 3248,
          "title": "19 Practical ES6 Snippets to Solve Common JS Problems 🚀💯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--3165AlXi--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/tzncjvbqvq8jkw7l1v9w.png"
        },
        {
          "id": "https://dev.to/dcodeyt/7-must-know-javascript-tips-tricks-2m8f",
          "author": "Dom (dcode)",
          "description": "#javascript #webdev #beginners #tutorial",
          "link": "https://dev.to/dcodeyt/7-must-know-javascript-tips-tricks-2m8f",
          "publishedOn": "2022-09-15T12:49:53.000Z",
          "wordCount": 3078,
          "title": "7 Must Know JavaScript Tips & Tricks 🎈",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Ejpaz6KH--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vgad7ph4dihcbqw45kl3.jpg"
        },
        {
          "id": "https://dev.to/stripe/designing-apis-for-humans-error-messages-94p",
          "author": "Paul Asjes, Stripe",
          "description": "#api #webdev #programming #stripe",
          "link": "https://dev.to/stripe/designing-apis-for-humans-error-messages-94p",
          "publishedOn": "2022-09-14T11:36:49.000Z",
          "wordCount": 5725,
          "title": "Designing APIs for humans: Error messages",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--8NfiYBul--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/pfxrwzebqa64bcyj3bow.png"
        },
        {
          "id": "https://dev.to/jainilprajapati/7-fantastic-heroku-alternatives-4jf8",
          "author": "Jainil Prajapati",
          "description": "#heroku #javascript #webdev #programming",
          "link": "https://dev.to/jainilprajapati/7-fantastic-heroku-alternatives-4jf8",
          "publishedOn": "2022-09-12T18:26:06.000Z",
          "wordCount": 3270,
          "title": "7 Fantastic Heroku Alternatives",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---aKLwteS--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qnauthgy32x1bsrnd1d4.png"
        },
        {
          "id": "https://dev.to/novu/building-an-interactive-screen-sharing-app-with-puppeteer-and-react-12h7",
          "author": "Nevo David, novu",
          "description": "#react #webdev #javascript #opensource",
          "link": "https://dev.to/novu/building-an-interactive-screen-sharing-app-with-puppeteer-and-react-12h7",
          "publishedOn": "2022-09-12T15:05:19.000Z",
          "wordCount": 5270,
          "title": "Building an interactive screen-sharing app with Puppeteer and React 🤯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7WhDhNPC--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/z19zh12b5yiuggqevbgr.jpg"
        },
        {
          "id": "https://dev.to/k_ivanow/finding-remote-work-in-2022-26j",
          "author": "Kristian Ivanov",
          "description": "#remote #interview #career #jobs",
          "link": "https://dev.to/k_ivanow/finding-remote-work-in-2022-26j",
          "publishedOn": "2022-09-11T15:07:11.000Z",
          "wordCount": 2939,
          "title": "Finding remote work in 2022",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--A-BCBZYT--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/djubpwkd8c3oycq5qpu2.jpeg"
        },
        {
          "id": "https://dev.to/aviavinav/the-making-of-a-react-component-librabry-cep",
          "author": "Avi Avinav",
          "description": "#javascript #react #webdev #beginners",
          "link": "https://dev.to/aviavinav/the-making-of-a-react-component-librabry-cep",
          "publishedOn": "2022-09-11T12:09:24.000Z",
          "wordCount": 4300,
          "title": "The Making of A React Component Library",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--980rloZD--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/iglufrc1hyb2akr4wdhq.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/mastering-these-7-basics-css-skills-will-make-you-a-frontend-wizard-2khn",
          "author": "Tapajyoti Bose",
          "description": "#webdev #programming #css #beginners",
          "link": "https://dev.to/ruppysuppy/mastering-these-7-basics-css-skills-will-make-you-a-frontend-wizard-2khn",
          "publishedOn": "2022-09-11T06:25:06.000Z",
          "wordCount": 2620,
          "title": "Mastering these 7 Basics CSS Skills will make you a Frontend Wizard 🧙✨",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--o3Bv5OAd--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/heca1jzzdzqchb4k2sdl.png"
        },
        {
          "id": "https://dev.to/dabit3/building-full-stack-applications-with-arweave-and-nextjs-28hg",
          "author": "Nader Dabit",
          "description": "#webdev #javascript #nextjs #web3",
          "link": "https://dev.to/dabit3/building-full-stack-applications-with-arweave-and-nextjs-28hg",
          "publishedOn": "2022-09-10T19:12:27.000Z",
          "wordCount": 3997,
          "title": "Building Full Stack Permanent Applications with Arweave, Smartweave, and Next.js",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--yef00i4h--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/r2o66tc2bwbgr07i97o4.png"
        },
        {
          "id": "https://dev.to/github/why-are-people-developing-inside-containers-38o6",
          "author": "Rizèl Scarlett, GitHub",
          "description": "#github #beginners #cloud #docker",
          "link": "https://dev.to/github/why-are-people-developing-inside-containers-38o6",
          "publishedOn": "2022-09-09T20:49:53.000Z",
          "wordCount": 4279,
          "title": "Why are people developing inside containers?",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7lFVUHWD--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/58pr74ygicsvwc84lzko.png"
        },
        {
          "id": "https://dev.to/wiseai/30-pytricks-ive-learned-by-joining-the-real-python-mailing-list-227i",
          "author": "Mahmoud Harmouch",
          "description": "#python #beginners",
          "link": "https://dev.to/wiseai/30-pytricks-ive-learned-by-joining-the-real-python-mailing-list-227i",
          "publishedOn": "2022-09-08T20:16:08.000Z",
          "wordCount": 3875,
          "title": "30 PyTricks I've Learned By Joining the Real Python Mailing List.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---uxRo6-R--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://cdn.pixabay.com/photo/2016/07/13/08/48/mobile-phone-1513945_960_720.jpg"
        },
        {
          "id": "https://dev.to/madza/12-modern-ui-components-to-inspire-your-future-designs-4ni4",
          "author": "Madza",
          "description": "#webdev #design #ui #inspiration",
          "link": "https://dev.to/madza/12-modern-ui-components-to-inspire-your-future-designs-4ni4",
          "publishedOn": "2022-09-08T16:08:58.000Z",
          "wordCount": 2558,
          "title": "12 Modern UI Components to Inspire Your Future Designs 😍✨",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--hbquREjm--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/scnrm2bxol261sqbs5nk.png"
        },
        {
          "id": "https://dev.to/surajondev/50-awesome-tools-for-web-developers-5gan",
          "author": "Suraj Vishwakarma",
          "description": "#javascript #webdev #beginners #react",
          "link": "https://dev.to/surajondev/50-awesome-tools-for-web-developers-5gan",
          "publishedOn": "2022-09-08T11:31:33.000Z",
          "wordCount": 3562,
          "title": "50+ Awesome tools for Web Developers",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--8iFoZSNU--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/584lu1fv3nsoulybolcx.png"
        },
        {
          "id": "https://dev.to/devsyedmohsin/javascript-tips-and-tricks-you-need-to-know-1g2k",
          "author": "Syed Mohsin Raza",
          "description": "#webdev #javascript #programming #beginners",
          "link": "https://dev.to/devsyedmohsin/javascript-tips-and-tricks-you-need-to-know-1g2k",
          "publishedOn": "2022-09-08T11:16:33.000Z",
          "wordCount": 2051,
          "title": "JavaScript Tips And Tricks Every Developer Should know 💯 🚀️",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--ihSk23fE--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/hl22lqwcsrc92kvcap9y.png"
        },
        {
          "id": "https://dev.to/valeriavg/me-react-5-years-in-15-minutes-58od",
          "author": "Valeria",
          "description": "#react #beginners #javascript #webdev",
          "link": "https://dev.to/valeriavg/me-react-5-years-in-15-minutes-58od",
          "publishedOn": "2022-09-08T07:10:08.000Z",
          "wordCount": 6052,
          "title": "Me & React: 5 years in 15 minutes",
          "imageUrl": "https://dev.to/social_previews/article/1182435.png"
        },
        {
          "id": "https://dev.to/anshika_gautam_/build-a-web-paint-application-5f55",
          "author": "Anshika",
          "description": "#javascript #html #css #webdev",
          "link": "https://dev.to/anshika_gautam_/build-a-web-paint-application-5f55",
          "publishedOn": "2022-09-07T14:49:34.000Z",
          "wordCount": 3849,
          "title": "Build a Web Paint Application",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--N0wfHpeN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/61e7ifwm7v7o3ze8cgyx.png"
        },
        {
          "id": "https://dev.to/j471n/detect-when-users-switch-tabs-using-javascript-3mi3",
          "author": "Jatin Sharma",
          "description": "#javascript #webdev #tutorial #beginners",
          "link": "https://dev.to/j471n/detect-when-users-switch-tabs-using-javascript-3mi3",
          "publishedOn": "2022-09-07T04:00:01.000Z",
          "wordCount": 3205,
          "title": "Detect When Users Switch Tabs using JavaScript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--sh7elrYU--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qudvzomd2qg2su4d9a5n.png"
        },
        {
          "id": "https://dev.to/zevir/the-complete-list-of-heroku-alternatives-to-consider-1l8o",
          "author": "Zevi Reinitz",
          "description": "#heroku #webdev #programming #devops",
          "link": "https://dev.to/zevir/the-complete-list-of-heroku-alternatives-to-consider-1l8o",
          "publishedOn": "2022-09-06T15:21:05.000Z",
          "wordCount": 4960,
          "title": "The Complete List of Heroku Alternatives to Consider",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--vhb83Cu9--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ym56sdt5nhkglna6tse8.jpg"
        },
        {
          "id": "https://dev.to/novu/building-a-live-event-alert-system-with-react-socketio-and-push-notifications-2jg5",
          "author": "Nevo David, novu",
          "description": "#javascript #react #programming #webdev",
          "link": "https://dev.to/novu/building-a-live-event-alert-system-with-react-socketio-and-push-notifications-2jg5",
          "publishedOn": "2022-09-05T14:36:26.000Z",
          "wordCount": 5082,
          "title": "Building a live-event alert system with React, Socket.io, and Push Notifications 🚀",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--EHHuJVoh--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/nbmmt0sax2e28wluvsyl.png"
        },
        {
          "id": "https://dev.to/enterspeed/we-measured-the-ssr-performance-of-6-js-frameworks-heres-what-we-found-1ck0",
          "author": "Kasper Andreassen, Enterspeed",
          "description": "#javascript #react #performance #webdev",
          "link": "https://dev.to/enterspeed/we-measured-the-ssr-performance-of-6-js-frameworks-heres-what-we-found-1ck0",
          "publishedOn": "2022-09-05T06:35:44.000Z",
          "wordCount": 4281,
          "title": "We measured the SSR performance of 6 JS frameworks - here's what we found",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--am_cPbMF--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/c1vlghlhjps2toxu0m25.jpg"
        },
        {
          "id": "https://dev.to/codewithtee/15-array-methods-in-javascript-1p1m",
          "author": "Tabassum Khanum",
          "description": "#javascript #webdev #beginners #programming",
          "link": "https://dev.to/codewithtee/15-array-methods-in-javascript-1p1m",
          "publishedOn": "2022-09-04T18:05:05.000Z",
          "wordCount": 4050,
          "title": "15+ Array Methods in Javascript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--E2de0xXe--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vtkz5a0fnln38z578ikg.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/6-must-have-chrome-extensions-for-web-developers-1ma2",
          "author": "Tapajyoti Bose",
          "description": "#webdev #javascript #productivity #programming",
          "link": "https://dev.to/ruppysuppy/6-must-have-chrome-extensions-for-web-developers-1ma2",
          "publishedOn": "2022-09-04T06:15:00.000Z",
          "wordCount": 2381,
          "title": "6 must-have Chrome Extensions for Web Developers 🚀🌐",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--2XIBrsLR--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ba1979d6k9jju5e6ia6p.png"
        },
        {
          "id": "https://dev.to/sarath_pm/git-cheatsheet-414e",
          "author": "Sarath P M",
          "description": "#git #programming #github #codenewbie",
          "link": "https://dev.to/sarath_pm/git-cheatsheet-414e",
          "publishedOn": "2022-09-03T13:35:05.000Z",
          "wordCount": 3473,
          "title": "Git Cheatsheet",
          "imageUrl": "https://dev.to/social_previews/article/1178295.png"
        },
        {
          "id": "https://dev.to/heyjtk/big-o-notation-basics-made-dead-simple-1c9m",
          "author": "JTK",
          "description": "#softwareengineering #algorithms #coding",
          "link": "https://dev.to/heyjtk/big-o-notation-basics-made-dead-simple-1c9m",
          "publishedOn": "2022-09-02T19:06:38.000Z",
          "wordCount": 5187,
          "title": "Big O notation basics made dead simple",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--3OHOMm_M--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ia3qpqezyrd0lyr5j6dg.jpg"
        },
        {
          "id": "https://dev.to/surajondev/awesome-github-repositories-for-web-developer-part-2-1h8b",
          "author": "Suraj Vishwakarma",
          "description": "#github #webdev #javascript #beginners",
          "link": "https://dev.to/surajondev/awesome-github-repositories-for-web-developer-part-2-1h8b",
          "publishedOn": "2022-09-01T11:36:22.000Z",
          "wordCount": 3104,
          "title": "Awesome GitHub Repositories for Web Developer - Part 2",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--HfSsorGN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/n562actscws9k9rfsvpq.png"
        },
        {
          "id": "https://dev.to/whitep4nth3r/whats-the-difference-between-and-in-css-23p4",
          "author": "Salma Alam-Naylor",
          "description": "#css #webdev #beginners",
          "link": "https://dev.to/whitep4nth3r/whats-the-difference-between-and-in-css-23p4",
          "publishedOn": "2022-09-01T09:41:50.000Z",
          "wordCount": 2831,
          "title": "What's the difference between : and :: in CSS?",
          "imageUrl": "https://dev.to/social_previews/article/1181288.png"
        },
        {
          "id": "https://dev.to/francescoxx/how-to-learn-web3-september-2022-3h9h",
          "author": "Francesco Ciulla",
          "description": "#web3 #blockchain #beginners #programming",
          "link": "https://dev.to/francescoxx/how-to-learn-web3-september-2022-3h9h",
          "publishedOn": "2022-09-01T06:03:23.000Z",
          "wordCount": 6273,
          "title": "How to Learn Web3 (September 2022)",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--L7sp3K03--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ir3ojvhv20khaipk7x9l.jpg"
        },
        {
          "id": "https://dev.to/meshvpatel18/top-heroku-alternatives-for-free-46g1",
          "author": "Meshv Patel",
          "description": "#heroku #webdev #programming",
          "link": "https://dev.to/meshvpatel18/top-heroku-alternatives-for-free-46g1",
          "publishedOn": "2022-08-31T13:49:56.000Z",
          "wordCount": 4820,
          "title": "Top Heroku Alternatives for free",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--r_6FrH43--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/6p9g6fa8h6n8w0wfx453.png"
        }
      ]
    },
    {
      "title": "少数派 -- Matrix",
      "feedUrl": "https://rsshub.app/sspai/matrix",
      "siteUrl": "https://sspai.com/matrix",
      "articles": [
        {
          "id": "https://sspai.com/post/75945",
          "author": "大耳Gluebi",
          "description": "Matrix 首页推荐\nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。\n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\n首先，非常开心少数派上婉莹和甜食大大的播客制作栏目《100 小时后请叫我播客主理人》终于上线了，两位都是我很尊敬的播客制作者，之前也和两位有过关于播客和其他领域（比如音乐收藏和泉州故事）的交流，相信这个栏目一定会给到各位对于播客有兴趣的朋友很多帮助。\n关于如何制作播客的相关教程，互联网上已经不少了，我自己之前也和生产力维基的白宦成合作过一期简单教学版本《小白和大耳的播客入门指南》，私下里我也在深圳线下做过几次关于制作播客的心得分享。很多教程和指南往往会集中在技术，设备，内容策划和运营等等方面，是一种「法」或者「术」层面上的描述，对于大多数的个人播客制作者，尤其是以兴趣为出发点的制作者来说，往往看了一些指南以后，就「一时兴起」录制并上传了自己的第一期节目，然后经历了一段时间的「方兴未艾」后，在某个时间突然因为繁忙的工作打断了「周更」的节奏，于是「戛然而止」。我自己的节目《对讲鸡 RadioChicken》也经历过几次这样的过程，曾经我也对诸如断更和订阅数减少（即使现在小宇宙的订阅只有 300 多个，最近几十个还都是各种社交 app 认识的）感到失落甚至焦虑，但经历了一些列佛系的思考后，我发现制作播客对我自己的意义，完全不在于「向外展示性表达」，更多的喜悦和快乐，反而在于「向内探索性成长」。\n所以今天我想就此分享一些关于「向内探索性成长」的心得，希望对于各位对于播客有兴趣，甚至已经开始制作播客的朋友有所启发。\n降低期待\n我给新人播客制作者的第一个建议，是做好「降低期待，甚至不要有期待」的心理建设。我相信可能会有部分朋友开始做播客的原因…",
          "link": "https://sspai.com/post/75945",
          "publishedOn": "2022-09-29T08:30:00.000Z",
          "wordCount": 561,
          "title": "相信对谈的力量，一些播客小心得",
          "imageUrl": "https://cdn.sspai.com/2022/09/27/0576c598538c8f94645b124de0b3ed33.jpg"
        },
        {
          "id": "https://sspai.com/post/75968",
          "author": "NICEPING",
          "description": "我的 AirPods Pro 2 还没发货，我的 AirPods Pro 1 已经吃灰很久。AirPods Pro 的耳塞我越来越戴不稳，再加上比较「白开水」的调音，以及削弱后的主动降噪效果，让我觉得虽然 AirPods Pro 综合体验不错，但总是少了点意思，对我这个 PC 玩家来说使用场景也有些窄。\n在 PC 上玩游戏，我始终不喜欢用头戴耳机，太大一坨挂头上，戴久了累，耳朵闷，还压头发。习惯各种无线 TWS 之后，我也无法再适应回去用有线耳机，有根线扯着，会极大降低我起身活动的频率。所以 TWS 真无线耳塞一直是我的心头好。\n以我常玩的 PUBG 为例，PC 桌面端能用来打游戏的真无线耳塞，至少必须得延迟够低，才有可能听声辨位，这样的耳塞市面上少之又少。所以很自然地，踩中我的喜好和需求的怒喵 CYBERBLADE 在发售后，我第一时间就上手并主力用了一段时间。所以这篇文章，我想分享一些我的体验感受。内容比较主观，没有受任一方干涉。\n先说结论：抛开前期我也不喜欢的营销方式不谈，上手后的 CYBERBLADE 本身没有让我失望。它主打的桌面端体验不错，实物的质感挺好，佩戴舒适度和音质也有超出我预期，虽然缺点短板都有，但它确实可以称得上是我用过的最好的 PC 桌面端 TWS，而且，没有之一。\n我是不是说得太满？请注意定语——「PC 桌面端 TWS」。就像我刚说的，PC 桌面端、能低延迟打游戏的真无线耳塞，市面上的可选项就没两个，这个垂直细分品类太小众，愿意像怒喵这样认真做一个偏高端定位好产品的厂商，更是没有。\n你可以说怒喵只是在讨巧，从成熟的音频市场，挑了个没什么竞争的品类来做，没啥了不起；但对我这种目标受众来说，有人做了我需要的东西，并且除了核心的桌面低延迟游戏体验 OK 之外，还做出了别家没有的特色，就很棒。\n\nCYBERBLADE 到底是个怎样的 TWS 耳机？\n它是一…",
          "link": "https://sspai.com/post/75968",
          "publishedOn": "2022-09-28T07:53:35.000Z",
          "wordCount": 799,
          "title": "更小众的 CYBERBLADE，何必去跟 AirPods Pro 比",
          "imageUrl": "https://cdn.sspai.com/article/24653ccc-14fb-88ce-5adf-9859858c632b.jpeg"
        },
        {
          "id": "https://sspai.com/post/75842",
          "author": "GiraffeB1ues",
          "description": "Matrix 首页推荐 \nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。 \n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\n这篇文章将介绍，我为什么以及如何将自动化数据处理应用到 Notion 当中。并通过我实际的案例，介绍自动化工具 Zapier 的用法，分享我的使用体验。\n数据更新和维护的不智能，让 Notion 的使用体验变得糟糕\n随着 Notion 功能的不断完善，越来越多的人会选择使用 Notion 作为自己的第二大脑。无论是构建个人的知识网络、保存整理数据信息、还是展示自己的数字世界的成就，这些场景中，Notion 提供的功能都显得游刃有余。此外，得益于 Notion 可以高度个人定制化以及提供在线编辑的特性，用 Notion 管理待办事项，规划日程，同步团队信息，乃至于记账、写博客这种更进阶的用法，使用 Notion 都可以让数据为用户服务，一切变得井井有条。\n操作的不便\n但是，所谓凡事有一利就有一弊。在 Notion 当中构建的精巧且复杂的数据库，不仅意味着数据在展示层面上的美观和应用层面上的便利，同时也意味着需要在数据的更新维护上花更多的时间和精力。\n按照我自己的使用习惯，我在 Notion 当中搭建了任务管理的数据库和财务管理的数据库。这其中有着大量的数字格式的数据存储在其中。但是因为 Notion 当中并不支持直接将数据进行运算得出结果\n例如，数字一栏记录的值是 100，并不能通过直接填写 「+10」得到 110，数字数据的更新是需要删除原有的数据，并把计算好的新结果填入原来的位置。\n图 1 Notion 数据更改的痛点演示\n在 PC 端或网页端，这样的操作还勉强可以接受，但是在手机的 App 上，这样的操作就显得过于麻烦。更…",
          "link": "https://sspai.com/post/75842",
          "publishedOn": "2022-09-28T06:27:19.000Z",
          "wordCount": 760,
          "title": "Notion 的自动化改造之路：Notion x Zapier 初尝试",
          "imageUrl": "https://cdn.sspai.com/2022/09/21/b31a3da678649444a2d6b30f8cc1c256.png"
        },
        {
          "id": "https://sspai.com/post/75964",
          "author": "金聚",
          "description": "提起武汉，你能想到什么呢？是崔颢心中「黄鹤一去不复返，白云千载空悠悠」的感怀，是毛主席笔下「烟雨莽苍苍，龟蛇锁大江」的壮阔，还是李白诗中「一忝青云客，三登黄鹤楼」的悲叹？武汉一直被称作为「江城」。它之所以有着如此的称呼，自然是因为它坐落在中国最大的河流长江之滨，中国四大河流「江淮河汉」中的江、汉两条大河将武汉这座城市分为三大块并融为一体。其实将武汉称做「湖城」也是不错的，那些大大小小的城中湖泊，如同明珠挂在武汉的身上，发出别样耀眼的光芒，下面请跟随我的脚步，一起去感受这属于大江大湖的浪漫吧。\n武汉水系图\n沿江而行\n如果你来武汉的时间只有一天，那去江边走上一天，便可以心中有谱地说出：我去过武汉了。那些或声势显赫或寂寂无名的景色，许许多多便是散布在长江汉水之畔的。\n汉口江滩\n漫步路线：江汉路-江汉关-武汉科学技术馆-汉口江滩\n江汉路\n每个城市里都有一条名号最响的路，在北京是王府井大街，在上海是南京路，在广州是上下九，在武汉自然就是江汉路了，江汉路很长，它的一头伸到了江边，另一头连着解放大道，被誉为「天下第一步行街」。江汉路在清末时期叫做广利巷，是商人集资修建来往贸易之用的。1861 年，汉口开埠之后，洋人也是看中了这里的临江的交通便利之处，便在广利巷附近的地盘上相继建立租界，江汉路便逐渐形成。现今江汉路著名的建筑，即是当年各个租界遗留的场所。\n江汉路沿路与江汉一、二、三路，黎黄陂路，保成路，水塔街等道路相连。弯弯绕绕，一转身，便可以看到不同风景。黎黄陂路是旧时汉口俄租界上的街道改造而成，作为一条拥有百年历史的老路，黎黄陂路见证着滚滚的历史车轮从此经过，漫步在这里，主要体会宁静，在老时光咖啡馆里享受一段悠然时光，在小物商行里欣赏别出心裁的饰件，或是在路上发发呆，看一看那些时不时提着婚纱走过的新人。保成路是承袭了几十年不断演变的夜市，短短几百米的道路上承载了近千家小商贩，漫步在这里…",
          "link": "https://sspai.com/post/75964",
          "publishedOn": "2022-09-28T05:58:16.000Z",
          "wordCount": 524,
          "title": "城市漫步指南：武汉，属于大江大湖的浪漫",
          "imageUrl": "https://cdn.sspai.com/2022/09/28/56be01ea03fbaa6706079b1a6211bbc4.jpg"
        },
        {
          "id": "https://sspai.com/post/75940",
          "author": "Kernel_panic",
          "description": "Matrix 首页推荐 \nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。 \n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\n从这里开始\n目前我在用的笔记系统，用一句很简单的话概括就是：本地 markdown 文件 + Dropbox 网盘同步，同时用 Vscode 项目把整个笔记目录管理起来。\n大概几年前，我正在 Evernote 、有道云笔记、OneNote 之间反复横跳。当时还没有 Notion，也没有 Roam Research，甚至 PKM（个人知识管理）都很少有人提及。\n最后还是选择了本地 markdown 这种「看似不便」的方式，毕竟原生的 markdown有种种缺点（图片管理、没有 Metadata、不支持复杂排版），本地文件的方式摆脱不了树状文件夹的笔记结构……甚至在当时缺少非常顺手的编辑器。但这些年修修补补也一直用下来了，上面提到的种种缺点也都改善或规避，期间也尝试过 Notion、RoamResearch、Logseq，但这种 「基于本地 markdown」的笔记一直都是我的笔记系统基本盘。\n\n \n这种方案的好处是：\n\n数据完全属于自己，Dropbox 网盘 + 自己写的定时脚本备份到 Git ，双重措施可以确保笔记不会丢失，也能通过 Git 的历史追溯修改历史、查看笔记系统的生长过程；\n最好的同步体验（Dropbox） + 最好的现代编辑器（Vscode）：Dropbox 的多设备同步近乎实时，并且增量同步非常适合 markdown 这种轻量文本，如果上网不便可以用坚果等其他同步盘替代，如果你用 苹果全家桶且能忍受 iCloud Drive 的同步1，它也是可以的 。至于最好的编辑器……还是看个人习惯吧，现代的编辑器诸如 Su…",
          "link": "https://sspai.com/post/75940",
          "publishedOn": "2022-09-27T13:59:37.000Z",
          "wordCount": 876,
          "title": "我的笔记系统实践",
          "imageUrl": "https://cdn.sspai.com/article/f9f452bf-98e4-479c-e5ac-c13098d75126.png"
        },
        {
          "id": "https://sspai.com/post/75885",
          "author": "Vacodwave",
          "description": "使用 Obsidian 的过程中发现一些痛点：\n1> 使用插件 annotator 时，引用的文本内不能添加链接\n\n如果强行将关键字改成链接，就会出现格式错乱\n\n我想要的效果如下：引用的文本能够给添加链接\n\n2> 使用简悦剪藏文章时 ，文章内的图片是外链。如果图片是外链，那么如果外链链接失效了就找不回图片了\n\n我想要的效果如下：将外链转为图床的链接\n\n3> Media Extended 虽然能使用链接跳转到视频指定时间点，但是手写链接太麻烦了\n\n我想要的效果：自动生成一个视频的全部字幕和引用，且每句字幕和一点时间点引用呈一一对应的关系\n\n❗❗❗为了节省大家的时间，我在文末写了我常用的 Obsidian 插件的下载链接，这些插件中有部分插件的源码都是被我修改过的，有两个需要注意的事项：\n\n被我修改过源码的插件不全是可以直接用的，比如发送图片到 Picgo 时的 url 要换成你在 Picgo 内设置的 url\n修改过源码的插件不要升级，如果升级了会导致修改失效\n\n❗❗❗再附加一个注意事项：\n\n入门简悦的时候如果运气不好（比如我），会遇到很多问题，如果看了入门文章还是解决不了就到 https://github.com/Kenshin/simpread/issues 提交自己的问题，简悦的开发者回复消息还是挺快的（顺便夸夸开发者很积极，这很难得）\n\n修改 annotator 引用格式\n使用工具\nAnnotator：是一个用于给 pdf 做标注和跳转的开源插件\nLinter：是一个用于格式化笔记的开源插件\n配置 Linter\n目标：修改其源代码，添加将 Annotator 样式修改为 📌\n添加规则分类：\n\n添加具体的规则处理：\n\n代码如下：\nnew Rule('Reform Annotation', '修改 Annotation 链接的样式', RuleType.MINE, (t…",
          "link": "https://sspai.com/post/75885",
          "publishedOn": "2022-09-27T10:34:07.000Z",
          "wordCount": 1269,
          "title": "Obsidian 修改annotator引用格式，外链图片转图床，根据字幕跳转视频",
          "imageUrl": "https://cdn.sspai.com/2022/09/23/4091da83f0d2858ac649170b6acb71b1.jpg"
        },
        {
          "id": "https://sspai.com/post/75934",
          "author": "Spike112",
          "description": "在以前的文章中，我对笔记软件和写作软件按照类别进行了梳理，参见《盘点那些具有特色的笔记软件》、《盘点那些具有特色的写作软件》。今天承接这一系列，介绍《盘点那些具有特色的电子白板软件》。\n在思维导图、概念图之外，白板作为一种强大的思维辅助工具，正在日益流行。为什么很多人喜欢白板呢？\n为什么需要白板？\n\n自由。白板没有过多的束缚。就像在一张白纸一样。你可以在空白页面随心所欲地表达你的思想。\n可视化。只需要使用画笔、文本框等模块以及模版，快速地将你地思维过程和想法以图文组合地方式加以表达。\n\n事实上，白板也并非什么新鲜事务。很多公司一直在使用实体白板进行开会等活动。如今，随着工作方式的改变，人们在远程工作、远程教育等场景中迫切需要电子白板工具。\n那么，如何选择适合自己的电子白板软件呢？我根据对于白板软件的使用需求，依次介绍本地离线的白板软件、免费/好用的在线白板软件、在线协作的白板软件，以满足对白板软件从轻量级到重量级等不同程度的需求。此外，还介绍两种与白板相关、特殊类型的工具：介于白板和笔记之间的可视化知识管理工具、内置白板模块的笔记软件。\n本地离线的白板软件\nMicrosoft Whiteboard 微软出品的免费白板软件\n官网：Microsoft Whiteboard 官网\n\n介绍：协作式数字画布，可实现有效会议和互动学习。\n优点：微软出品，免费、强大。并且，可以与微软 Office 软件生态进行整合。\nApple Freeform 苹果正在开发的白板应用\nFreeform 提供了一个“灵活的画布”，参与者可以在其中将文本、照片、绘图、PDF 和其他内容添加到单个空间中。该应用程序与 Messages 和 FaceTime 密切相关。Freeform 可以在 FaceTime 通话期间启动，并且通过 Messages 反映协作内容。具体发布时间未知，预计首先登录 iPadO…",
          "link": "https://sspai.com/post/75934",
          "publishedOn": "2022-09-26T11:29:45.000Z",
          "wordCount": 601,
          "title": "盘点那些具有特色的电子白板软件",
          "imageUrl": "https://cdn.sspai.com/2022/09/26/37df15efea0cfe02249c8e291a76bd58.png"
        },
        {
          "id": "https://sspai.com/post/75935",
          "author": "1A君",
          "description": "2020年的时候，我开始对「知识管理」产生兴趣，一路寻找适合自己的工具和方法。经过近两年的探索，我终于找到了答案——通过 wolai 平台来实践L先生的「INK-P 管理法」，借此搭建属于自己的知识体系。（注：L先生，即公众号「L先生说」的作者 Lachel李睿秋，也是我的老师。下文统一称呼「L先生」）\n先给大家展示我去年的一个成果——《御赐小仵作》资料整理。大家可以看看下面这几张动图：\n\n页面详情可点击此链接查看：《御赐小仵作》资料整理\n《御赐小仵作》是去年的一部古装悬疑连续剧，算得上是暑期档的最大黑马了。该剧的情节、设定和诸多细节都很讲究，所以我觉得有必要整理一番。一来是出于自己对这部作品的喜爱，二来是想让制作团队的用心能让更多人看到。\n去年6月的时候我开始整理，本以为只需要一两个星期，实则大大低估了它的工作量。我那会每天大概抽出半个小时，磨了整整5个月才完成。不过虽然是挺累的，但整理完还是倍有成就感。这次的整理大致分为5个模块：\n\n每集的剧情脉络\n剧中重要人物的介绍\n相关的历史背景和知识\n唐代的官职制度\n剧中所涉及的知识点\n\n这几部分主要是通过 wolai 的「双向链接」和「嵌入引用」来实现联动。\n比如第一集的剧情这里，红色的部分是双向链接，引用的有人物也有知识点。跳转到人物界面之后，可以看到 ta 的简介，以及相关的经历。人物经历下面通过「嵌入引用」，把剧情里的信息链接过来。因为这部剧的主旋律是验尸和破案，所以几个主角的经历还会分出「工作成果」这一部分。\n\n00 wolai功能简介\nwolai 是国内开发的一个云端协作平台，用来搭建知识体系也很适合。\n2018年的时候我就开始搭建自己的数据库，从最初的印象笔记，到后来的 Onenote 和 Notion，一步步探索，最后在2020年选择了 wolai。\n我之所以会选择它，一是因为它的界面清新简洁，颜值高，二是它采取了…",
          "link": "https://sspai.com/post/75935",
          "publishedOn": "2022-09-26T10:49:36.000Z",
          "wordCount": 683,
          "title": "知识该怎么管理呢？我终于找到答案了",
          "imageUrl": "https://cdn.sspai.com/2022/09/26/7c8f839ab3774a713efd4fe6a4f410fe.jpg"
        },
        {
          "id": "https://sspai.com/post/75869",
          "author": "kokdemo",
          "description": "关于备播集\n掐指一算，试播集 已经暂别我们两个多月了，在没有南哥发车的这些日子里，我攒了不少读书笔记，决定自发的搞一期 “备播集”，大约等同于电视台里没节目可播的时候强行凑数的节目。\n本期车长：@kokdemo\n本期车员：@James_Tu\n如果大家对这样的形式喜闻乐见，也欢迎在各种渠道找到我，大家一起攒读书笔记并发出来，希望能坚持到试播集回来的那一天。最后也感谢南哥对本文头图的大力支持。\n\n@kokdemo 创业者们的自述\n最近看到了巴塔哥尼亚创始人决定把公司“捐给地球1”的新闻，让我感到颇为震撼，在看完新闻之后，我立马去阅读了巴塔哥尼亚创始人伊冯·乔伊纳德所著的《冲浪板上的公司》这本书。\n巴塔哥尼亚官网的公告-地球是我们唯一的股东\n在读完这本书之后，我对这家公司的文化和理念十分敬佩，于是打算将这一段时间读过的一些公司创始人所写的书放在一起，和大家聊一聊。\n\n《Salesforce传奇》：作者是 Salesforce 创始人马克·贝尼奥夫。Salesforce 是软件即服务行业（SaaS）的先驱和佼佼者，创办于1999年，主要产品是客户管理系统（CRM）；Salesforce 在纽约证券交易所上市，目前市值 1470.10 亿美元。\n《发明》：作者是 dyson 创始人詹姆斯戴森。戴森是一家专注家用电器的公司，创办于1991年，其推出的吸尘器、风扇、吹风机等广受好评。戴森仍然是一家私人家族公司，没有上市。\n《小米创业思考》：作者是小米集团创始人雷军。小米集团是一家以手机为核心的消费电子公司，创办于2010年。小米集团于港交所上市，目前市值 2366 亿港币。\n《冲浪板上的公司》：作者是巴塔哥尼亚创始人伊冯·乔伊纳德。巴塔哥尼亚是一家主营户外服装、户外装备的公司，创办于1972年。巴塔哥尼亚仍然是一家私人家族公司，没有上市。\n本文聊到的四家公司\n（哦对了，在之前的试播集中，…",
          "link": "https://sspai.com/post/75869",
          "publishedOn": "2022-09-26T09:46:13.000Z",
          "wordCount": 534,
          "title": "备播集 01 ｜少数派作者最近读了什么",
          "imageUrl": "https://cdn.sspai.com/2022/09/26/2d7e4c7e96a0e9a8cce629781d777f5c.png"
        },
        {
          "id": "https://sspai.com/post/75902",
          "author": "猴猴说话",
          "description": "你有没有想过一个问题：为什么心理学家都喜欢拿老鼠做实验？\n一般来说会找一只涉世未深的小白鼠，然后把它放到一个箱子里，还会给它准备一些食物，但是食物会连上老鼠可操控的开关，并且加上电击、喂食等各种条件变量，然后通过设计不同的机制，来看老鼠最后的反应，最后老鼠会因此习得一些惯性的行为模式。\n实验完成后，心理学家会把老鼠的这些行为反应总结成规律，然后应用和解释人类的行为和心理机制。\n这些实验结论都有一个隐含的前提，那就是老鼠的心智模式在某种情况下，等同于人类的心智模式：都是通过先做一些行为，然后从现实世界获取「反馈」，然后建立对世界的「预测」机制，直到最后形成了一个「稳定」的行为模式。\n为什么我们一定要经过反馈、预测、稳定的路径？因为不管是人类，还是老鼠，我们都会遵循一种固定的模式——心智模式。\n\n心智模式是我们简化世界后的知识结构和认知表征，我们常用它来与世界进行互动。\n——百度百科\n\n人类如果要在现实世界中生存，就需要认识并且适应所处的不断变化的环境。我们能够通过五官觉察身边的环境，通过短时的记忆去存储一段时间已经发生的变化，然后通过思维去归纳和预测还未发生的变化，最后形成一套自己的心智模式。\n可以说，我们只要想在这个世界上好好地活，就离不开我们的心智模式。\n我们可以将现实世界投射在心智之中，但是尽管穷尽一生，我们的心智世界也只能涵盖真实世界的很小一部分。\n很多时候，我们以为的真实世界其实并不真实。\n心智以外的“真实”世界\n楚门望着看起来一望无际的大海，不知道海的对面是一堵天蓝色的墙，墙上的楼梯能够通往现实世界。原来自己不过是一个被设定好的角色，眼前的一切都是人造的虚幻。如果周边的环境都是假的，那“我”还是真的吗？\n\n作为观察楚门的看客，我们知道他身处的世界是假的，但我们怎么知道没有人在观察我们？也许是我们的灵魂？或者有某种更广泛的神秘的存在在操控我们的命运。\n但我这里不想继…",
          "link": "https://sspai.com/post/75902",
          "publishedOn": "2022-09-26T09:44:23.000Z",
          "wordCount": 488,
          "title": "如何“打开心智”，应对“真实”世界？",
          "imageUrl": "https://cdn.sspai.com/2022/09/24/367b95ad339f450cf443ac5067310f5e.png"
        },
        {
          "id": "https://sspai.com/post/75931",
          "author": "GorgeousEdge",
          "description": "在正式开始教程之前首先说明一下目前国行系统的状态：最新版三星云（5.2.00.5）屏蔽了OneDrive备份的入口，直接删除了相关备份软件的服务。因此要在国行系统机器上继续使用OneDrive备份需要降级三星云。如果对Samsung Pay没有需求而对同步有比较大的需求，最简单的方法是刷港版系统。本教程基于One UI 4.1，国行S20。所有需要的安装包均可在教程链接或者apkmirror网站上找到。\n在开始之前需要的准备：一个非大陆地区的三星账号，一个微软账号（需要是个人账号），一个非国行系统的三星手机（也可以是你的国行设备刷港版系统），以及一部国行系统的三星手机（操作对象）。\n第一步，绑定三星账号和微软账户。\n在非国行系统的手机上登录三星账号，然后在相册的设置里，找到云同步，点击按照提示登录微软账户。其中某些步骤容易因为网络原因卡住，不过由于我从来没遇到过，所以有需求的建议在酷安上搜索相关资料，或者全程科学网络。这一步很简单，因此不做过多阐述。\n第二步，降级三星云。\n一般来说，国行系统的三星云会被强制自动更新，因此要想使用备份需要先降级三星云。\n目前在apkmirror上找到能安装也能备份的最新版是5.1.00.13，由于版本号相比国行最新版三星云5.1.05.9更低，需要重新安装。可以现在系统里卸载三星云，再安装此版本的三星云。如果不想重新同步之前的云数据，可以使用ADB直接降级安装。代码我放在下面（为了方便输入，包名我改成了123.apk）\nadb install -r -d D:\\123.apk\n第三步，在国行设备上进行后续操作。\n登录账号之后，下载一个OneDrive，登录之前和三星账户绑定的那个微软账户。登录成功之后就可以暂时忽略这个软件。然后按照链接里的方法在手机上安装lycan，这一步是关键，否则之后的操作都无法进行。\nhttps://www.coolapk.com/feed/32708070?shareKey=YWUwNDI3ZTU5Y2FmNjMzMTVlN2M~&shareUid=964712&shareFrom=com.coolapk.app_5.0.2\n下载「创建快捷方式」这个软件\n【创建快捷方式】 ，打开之后右上角三个点勾选「也显示系统应用」，搜索三星云。点击进入三星云的活动列表，搜索「dashboard」，找到图中这个活动，然后创建一个快捷方式放在桌面。\n\n如果此时打开这个快捷方式，会进入OneDrive同步的那个页面，但是会提示三星云需要更新才能同步，如果不更新就会强制退出。所以我们需要用到lycan屏蔽这个更新提示。\n打开lycan，搜索三星云，在「服务」中将uploadtodrive两项设置成enable\n\n在「接收器」中将下图三项禁用，三项名字均带有update\n\n在「服务」中打开下图两项\n\n此时重新打开刚刚那个快捷方式，就能够正常同步了。\n成功效果如图\n\n如果之后打开三星云又提示更新，可以按照之前的方法降级三星云。不排除之后的系统更新会屏蔽这个接口的可能，只能说且用且珍惜。",
          "link": "https://sspai.com/post/75931",
          "publishedOn": "2022-09-26T08:22:15.000Z",
          "wordCount": 480,
          "title": "国行系统三星手机同步 OneDrive 教程",
          "imageUrl": ""
        },
        {
          "id": "https://sspai.com/post/75909",
          "author": "JuniperPhoton",
          "description": "时间切片 Time Slice 是延时摄影的静态表现形式：你通过固定机位并在特定的时间间隔内拍摄一系列照片，得到一组静态照片，然后在后期的时候按照时间顺序，取每一张照片的局部，然后拼接起来，便得到一个名为时间切片的照片。\n2022 年 7 月份在梧桐山顶拍摄了一组日落时分的延时照片，并在后期导入电脑并使用 DaVinci Resolve 合成延时视频的时候，我突然想起一个朋友在 2013 年输出的一个时间切片照片。于是也想给我这组照片制作一个时间切片。\n后期制作时间切片是一道很复杂的工程（比如，可以参考这里），随着照片数目的增多，操作步骤会越多。在正式使用 Photoshop 尝试制作时间切片之前，我就直接有个想法，要不自己实现一把？\n事实上，使用程序来实现一点都不难：给一组照片排好序后，在一个大的画布上，依次取该照片特定的区域，然后绘制到该画布的同样的区域就能实现这种效果。最开始我是在 Android 上进行这块的测试，后来很快就完成并验证了效果的可用性。后来想了下，MyerTidy 虽然目前的功能只有「整理文件」，但它实际上是可以定位为一个「批量处理」的 app。\n最后便有了 MyerTidy v1.1.1 的更新（暂时只有 macOS 版本）。\n此版本带来以下的变化：\n\n重新设计的带响应式布局的首页，为未来支持更多批量操作进行前置的支持\n新增各个模式的功能介绍以及效果图\n支持「延时切片」功能，正如上文所说的，可以为你制作时间切片照片。在下文会做更详细的介绍\n进行了小部分重构和性能优化\n\n在首页选择了「延时切片」后，你便可以选择一个文件夹或者一组照片了，之后会自动进行预览渲染：\n\n \n默认的效果是，根据你的文件名升序排序，从左到右，不对图片进行采样来进行绘制。\n比如你有文件名为 TIMELAPSE_001.jpg 到 TIMELAPSE_100.jpg 的 100 张图片，会使用以下顺序从左到右来绘制：\n\n绘制 TIMELAPSE_001.jpg\n绘制 TIMELAPSE_002.jpg\n…\n绘制 TIMELAPSE_100.jpg\n\n效果如上。\n \n你可以点击「倒序处理」，来使用倒序的方式来从左到右绘制：\n\n绘制 TIMELAPSE_100.jpg\n绘制 TIMELAPSE_099.jpg\n…\n绘制 TIMELAPSE_001.jpg\n\n效果如下：\n\n \n如果你觉得你的图片太多了，想以固定的间隔来取一部分来绘制，那么可以在「跳过合成的数目」来输入你要跳过的数目 X。也就是，每隔 X 张，只会取一张来绘制。\n\n跳过的数目为 5 的情况下，每 5 张会选择第一张来绘制。\n对于上述图片，跳过数目设定为 50 的时候（原图片总数目为 654 张）效果如下：\n\n \n最后，上述的布局方式都是「水平布局」：图片以水平方向来进行绘制。\n你可以点击「垂直布局」，来开启从上到下的绘制模式，效果如下：\n\n此外特别注意的一点是，MyerTidy 目前不支持图片自动对齐。因此如果你的图片组因为前期拍摄的原因有部分图片对不齐，那么需要你先使用 Photoshop 等工具来前期做对齐（当然，相比做时间切片来说，应该不算太困难）。如果需求强烈，那么可能会调研并加入这块的支持。\n以上便是 MyerTidy v1.1.1 的更新。未来会专注 macOS 下对文件和图片的「批处理」的实现，目前期望会做的下一个大功能便是对文件按照特定的规则批量重命名（比如整理番剧之类的，会很有用），也在思考是否可以加入类似「星轨合成」这样的功能。\n你可以通过 App Store 搜索 MyerTidy 来进行下载。如果你有什么想法和反馈，欢迎留言。",
          "link": "https://sspai.com/post/75909",
          "publishedOn": "2022-09-25T08:13:58.000Z",
          "wordCount": 532,
          "title": "MyerTidy 新版本上新：支持合成「延时切片」功能",
          "imageUrl": "https://cdn.sspai.com/2022/09/25/6e4b56b8da216b716126800b3746ada0.jpg"
        },
        {
          "id": "https://sspai.com/post/75897",
          "author": "善宝橘",
          "description": "1. 两个让我困惑的迷思\n在双链笔记兴起后，PKM 领域一直热衷于谈论知识与知识间的联系构建。于是我们经常听到一种流行的讲法：我们的思维方式是网状的，笔记也应如此，传统的文件夹与目录分类已是旧时代的产物。\n这种讲法忽视了两个前提：\n并不是所有人都有能力在知识间构建联系，尤其对于一个领域的初学者来说；\n大脑神经元虽然以网状的形式呈现，但人类的思考方式本质上仍然是结构化的；\n20 世纪 50 年代，芝加哥大学教授布鲁姆提出教育目标分类理论，该理论将人类对于知识的认知分为了六个层次：\n\n记忆：对具体事实、概念、术语的回忆；\n理解：能够对知识进行转换、解释和推断；\n应用：在实际情景中运用知识；\n分析：将所学材料分解，明白各部分间的联系；\n评价：基于对知识的理解，对知识的价值进行有效判断；\n创造：将组成知识的各部分要素重新加工，产生新的模式或结构；\n\n按照布鲁姆的分类理论，知识间如果要产生关联，对于知识的认知必须要达到分析的层次。在实际应用中，我们也许可以跳过记忆和应用，将认知过程的前四步简化为理解->分析，然而这仍然要求我们对知识有充分的吸收和了解。\n以语法为例，若我们想要厘清中、英文之间的差异，则必先以其中一种语言作为理解的锚点。对一方的语法有所了解后，才可借此反思与另一方语言的相同、区别。\n如此，作为一个初学者，若对两种语言皆不通晓，自然很难有相互关联的能力。再者，一个领域本身有其自身的框架，初学者面对新知尚且招架不住，更遑论还要再负担额外的功夫去思考相关性。\n更令人困惑的迷思在于，当我们谈论联系时，我们总是通过网的比喻来形容知识的关联性。\n\n                                    you never know what is the meaning of this picture\n发轫于 Roam Research 的页面图谱，如今成了一部分人…",
          "link": "https://sspai.com/post/75897",
          "publishedOn": "2022-09-24T07:11:00.000Z",
          "wordCount": 605,
          "title": "PKM 又一年，我的困惑与心得",
          "imageUrl": "https://cdn.sspai.com/2022/09/24/41621528b4cca6ad0d73e2acca45918f.png"
        },
        {
          "id": "https://sspai.com/post/75858",
          "author": "Theia在路上",
          "description": "在这个大众觉醒的时代，我们常常听到「我们需要探索自我，了解自己」。但是，假设我们很粗暴地把人分为三种：认为不需要寻找自我的人（或不知道「寻找自我」重要性的人）、正在寻找自我的人、以及找到了自我的人，第一类人是绝大多数，第二类是少数，第三类是少数中的少数。\n这其实也对应了我们认识自我的三个阶段。\n第一阶段是我们需要觉醒，意识到探索自我的重要性。\n为什么探索自我对每个人都很重要？\n人是需要意义驱动的动物，我们天生有实现自身价值的冲动。但每个人的价值、优势是不同的。我的性格是怎样的？我想做的事情是什么？对我来说，什么最重要？我未来的方向是什么？我想过上怎么样的生活？我的价值实现在哪？这些问题如果得不到解答，短短一生很容易忙忙碌碌、随着大流就这样过去了，实在可惜。\n项飙在《把自己作为方法》中说：\n\n（瓶颈的问题）是回到自己作为一个边缘者、回到我是谁的问题。想清楚究竟我能做什么，我跟世界的关系是什么。我认为世界上所有的人都有这个问题，都得搞清楚自己是谁，否则都会有这种危机，除非完全盲目地被主流裹挟进去。\n\n当我们意识到探索自我的需求之后，我们还需要方法，这就来到了第二阶段——开始寻找自我。但我感觉，很多人对于探索自我的方法却没有什么头绪。\n困难之处，在于「自我」是非常复杂的，我们之所以是今天这样，受到了童年经历、社交媒体、朋友亲人、国家文化等等各种因素的影响，这些影响之中大部分更是在日常不知不觉之中就成为了我们的一部分，所以无论是从横向（各种因素的复杂性）和纵向（性格和价值观形成过程的复杂性）看，自我都是极其复杂的。\n但好在，这几年通过各种各样的渠道和自证，我积累了一些有用的、可执行的方法，想在这里分享给你。\n再多读几本书\n阅读有什么用呢？学习知识肯定是好处之一，可是看完可能就忘了；拓展眼界也是的，可是没去亲身经历还是差了一点。\n那最大的用处是什么呢？我认为， 是读自己。\n在《活下去…",
          "link": "https://sspai.com/post/75858",
          "publishedOn": "2022-09-23T02:15:33.000Z",
          "wordCount": 528,
          "title": "探索自我是一条漫长的路",
          "imageUrl": "https://cdn.sspai.com/2022/09/21/eb77593e76fd2723f1289768ee243036.png"
        },
        {
          "id": "https://sspai.com/post/75709",
          "author": "hkoch24",
          "description": "个人日程管理的需求\n在选择日程管理的形式或者app的时候，我的要求很简单：即先确定需求，再按照需求探索日程管理方式。我对日程管理的需求有几点：\n\n任务与日程要在同一个页面；\n尽可能随手拿起就能使用；\n有较大的自由度，即可以根据个人需求添加备注等；\n要能够自上而下地「俯视」整个日程管理过程；\n随时可以逃离。\n\n根据这几点需求，我开始了自己的日程管理尝试1。\n日程管理尝试\n1. 纸质日程本\n本科时期，还在用着黑莓9790、z10等一些「非主流」手机，他们没办法与电脑形成一个良好的生态系统，所以没有习惯用他们来做日程管理，而是使用传统的纸质日程本。\n当时，已经在用Moleskine的单行笔记本做日记本，对M家的本子很有好感，尤其是口袋本，非常便携。出于一种仪式感的传承，我开始尝试M家的周记本：本子摊开，左边是一周的日程记录，可以记录有确定时间的日程，也可以记录只固定日期的日程；右边是一整面的横线页面，可以写下一些备忘事项，例如可能需要本周或者下周要做的事情等，也可以记录本周的一些打卡事项。\n\n后来尝试了M家特有的400页超厚日程本，一天一页，每一页都是当天从8点到22点的日程记录。本子非常厚，携带有点不方便；记录是方便许多，能写的位置也多了很多，但因为不是每天都有排满的日程，一些琐事写进去也没意思，最终本子留了许多空，总感觉有点浪费，尤其是年终总结的时候觉得似乎是虚度了时光一样。\n\n后来也尝试过MUJI的月记本，但是总感觉没有周记本好用，我便回归Moleskine的周记本，直到我后来舍弃它。\n2. 手机自带日程管理工具\n舍弃纸质日程本的原因有两个：\n\n设备和系统升级了，从「非主流」机升级到了带有安卓系统的Blackberry Keyone，自带的日历强大了很多；\n当时正在读研究生，我们的课比谁都多，每天都被课程排满，而这些课程都写进纸质笔记本里不太可能，只把课程外的待办事项写进本…",
          "link": "https://sspai.com/post/75709",
          "publishedOn": "2022-09-22T05:26:19.000Z",
          "wordCount": 532,
          "title": "日程管理 with Firstseed Calendar",
          "imageUrl": "https://cdn.sspai.com/2022/09/21/e34a123795319a6d562d3dcad16b2a1a.jpg"
        },
        {
          "id": "https://sspai.com/post/75841",
          "author": "CLU",
          "description": "上一篇《exping：一个地图创作工具是怎么诞生的？》 和大家分享了 exping 的诞生故事后。感谢大家的支持与建议，也感谢少数派的推荐，让更多的人认识了 exping ，其中也有投资人、媒体关注到了我们。这是意料之外的收获。时隔3个月，我们有了许多的变化与提升。在这段时间里，也有更多的机会去接触用户，进行深入的交流，从中也更清晰我们的产品定位，以及我们的使命。\n「地图」就像一张画布，是另类的创作载体\n从地图诞生以来，大家对地图的认识，更多是作为「导航指引」用途。其中涉及了不少的学科，如「地图学」、「地理学」、「测绘学」、「遥感技术」等等。根据地图的应用场景，结合这些学科专业，绘制不同的专用地图。\n因此，地图创作对大家来说似乎需要有一定的专业要求。而 exping 的诞生始于让每个人可以轻松、容易地呈现自己的品味地图。地图就像一幅画的画布，一个另类的创作载体。（欢迎看看小编写的文章《emoji + 地图 = exping》）在此之上以标记「点」，绘制「路线」，表达基于地理位置上的故事。「地图」作为重要的画布，重点在于可塑性，如何帮助创作者对地点进行多样性的表达。那或许一般的地图不足以满足这些需求，借此，这次我们和设计师聊聊，exping 专属地图的一些设计心路历程。\n \n\n作为 exping 的设计师，你怎么理解 exping？\n当大家还在以图文的方式分享一个好地方的时候，exping 开始将地图作为主视角。 Explorer 可以方便快捷地添加去过、计划要去的地方以及设计路线，简单或隆重地补充对该地点的评价，上传相关照片。\n通过这种更直接的方式，将你的数据传递给你的观众，大幅度减少了“这是哪里？”，“我也想去”，“环境怎么样？”等问答游戏。\n在这之前，exping 的地图风格是怎样的？\n在 exping v0.1~0.3 的地图风格从 Light （简约）到 Stree…",
          "link": "https://sspai.com/post/75841",
          "publishedOn": "2022-09-21T04:36:13.000Z",
          "wordCount": 582,
          "title": "和设计师聊聊，exping 专属地图是如何设计？",
          "imageUrl": "https://cdn.sspai.com/2022/09/21/614d44f49dd37dfe145e8ff4c2999411.jpg"
        },
        {
          "id": "https://sspai.com/post/75833",
          "author": "一克",
          "description": "阅读初衷\n平时一无聊下来，偶尔会通过消费购物，来提起自己的生活兴致，买东西从挑选，到想象自身使用场景，再到下单盼望着快递，最后拆封这个过程，能在很长一段日子里给自己提供着生活的兴致。而有些时候，反省下觉得单纯是无聊想买买买，而不是使用需求强烈促使我去购物。自觉这种动机是不健康的，同时也很好奇为什么有这种心理，于是便在网络推荐下接触到了这本书——《超市里的原始人》，想借此机会，弄清楚什么是消费主义，对我这种自以为不健康的消费行为如何解剖。\n从看到书名中的「原始人」开始，我就期待着书中内容将追根到底消费的欲望最原始的动机是什么。首先需要引用一下在生物学中对人作为社会性灵长类动物特点的描述：\n\n人类在进化过程中形成了许多小范围的社会集体，身在其中，你的形象和地位就是至关重要的，这已经不仅仅是为了满足生存的需求，还是为了吸引伴侣、娱乐朋友和抚育后代。\n\n消费这件事情之所以扯到这么遥远和深层的角度呢，是因为作者主张需要从进化心理学的角度才能透彻地了解消费主义的根源，消费者虽然会半自觉地设法炫耀出财富、地位和品味，但真正想要展现的是更深层次的心理特质（比如善良、智慧和创意）和生理特质（比如生育能力、强壮、美貌）。\n《超市里的原始人》中的三个关键论点：\n\n人试图展示自身特质的本能与消费主义关系紧密。\n我们用于识别关键人类特质和情感的社交感知系统经过漫长的进化历程变得准确高效，能将所有能收集到的不同暗示聚集起来，察觉出一个人的身体、脸部、语言和行为。\n消费主义在很大程度上就是一种画蛇添足的行为。我们得到了有惊人适应力的人类自我展示的能力，即语言、智慧、善良、创造力和美丽，然后却忘记了如何用它们来结交朋友、吸引配偶和获取声望。相反，我们却依赖通过教育、工作、消费获得的商品 和服务来向他人展示自己的个人特质。这些高成本信号大都是多余的或是误导性的， 所以别人通常都会对其视而不见。\n\n消费主义中…",
          "link": "https://sspai.com/post/75833",
          "publishedOn": "2022-09-20T06:03:03.000Z",
          "wordCount": 518,
          "title": "当隐约感觉我的消费行为不对劲时——《超市里的原始人》札记",
          "imageUrl": "https://cdn.sspai.com/2022/09/20/bb8cfd48fe8d7ca5fdde06fc80fb3edb.jpg"
        },
        {
          "id": "https://sspai.com/post/75803",
          "author": "猴猴说话",
          "description": "你用过人工智能写作工具吗？前两个月，我看到了一些AI写作工具推出了文章续写功能。\n\n只要你写上一篇文章的开头和结尾，智能系统就能自动生成一篇完整的文章。虽然现在技术还不成熟，积累的样本数据还不够完善，写出的内容还是会被挑剔，但是我总感觉排布好内容逻辑是迟早的事情。\n在那个时候，AI就能代替我们写作吗？\n作为内容创作者，我们还有活路吗？现在能帮人进行AI写作的工具有很多，从媒体报道、工作汇报这些角度看，人工智能会逐步替代人工写作。它只追求客观报道和逻辑推导，但无法完成偏主观价值判断的内容生产，因为AI不能代替的是我们对内容的「审美」。\n人工智能与审美\n前段时间AI绘画掀起了一阵火热，只要输入一些文字和句子，表达画的风格和内容，AI就能自动生产出一副艺术作品。有的画真的能与大神媲美，吊打国内外大部分艺术工作者。但是，这里的问题是，这个作品从「点子」到「作品」之间，完全忽略了过程。\n怎么判断一个作品已经做到最好了？还能不能更好？这一笔触能不能再调一调？那一个色块能不能再深一些？如果单独抠几个细节，那是调整，如果从头开始就抠细节，那就是「创作」。\nAI写作能根据你前面写的一个词、一段话，自动生成出后面的句子和篇章，但是它对于一个真正想表达的人来说，生产出的段落总会让人差强人意，甚至因为一个字的误用就导致表达结果与表达目的南辕北辙。\n说到底，AI写作只能成为我们的工具，是基于创作者的审美的工具。倘若作者的审美和沉淀不够，反而会出现被工具主导，甚至被代替的困境。如同普通人去使用AI绘画一样，对绘画细节失控，除了标题能自己把控，后面的笔触、构图、用色等细节都和自己无关。如果我们本身就懂绘画，那么还可以去微调，但当我们什么都不懂的时候，剩下的只有无尽的赞叹。通过AI生产出了一个远超自己能力范畴的作品，或者说，它远远超出了我们对作品的审美极限。所以，无法对它进行细节的判定。\n就如同我们在写作…",
          "link": "https://sspai.com/post/75803",
          "publishedOn": "2022-09-20T03:09:38.000Z",
          "wordCount": 496,
          "title": "当 AI 能代替我们写作，我们还有什么？",
          "imageUrl": ""
        },
        {
          "id": "https://sspai.com/post/75822",
          "author": "人形睿",
          "description": "与其说双链是笔记软件，不如说他们是知识管理软件或思维工具。而这个认知上的错位便是导致目前双链饱受争议的原因之一。\n\n双链是个伪概念？\n双链笔记软件目前的争议不少，大家对其的批判也非常实际，可谓是针针见血：\n\n双链的底层逻辑尚未普及，用户无所适从。链接有什么用？哪些应该链接？\nnotion、语雀、印象笔记都能一定程度上双向链接各种文章。虽然稍微简化了一些，但好像也能用啊。\n界面太“硬核”了，不优雅，不美观，基本没有办法给别人看。\n没有办法共享和协作。\n导出十分麻烦，有时候还要靠插件。\n各种命令、快捷键、插件，学习成本高。\n代码程度较高，没有代码基础的人被劝退。\n知识图谱功能基本只是用来装逼，东西一多基本没法看。\n\n可以发现，当我们以“笔记软件”的角度来看待双链，它和目前各种成熟的笔记软件相比差太多了。看着甚至像尚未完成就拿出来给人用的Alpha版本软件，非常粗糙，体验极差。\n但是，如果我们换一个视角，以“知识管理软件”和“思维工具”的角度来看待双链，结果可能会完全不同。而我认为这才是双链的核心优势。\n双链的核心优势——知识管理和思维辅助工具\n1、信息颗粒度更细，便于细化和延展\n个人认为，信息粒度是双链笔记最核心的优势。比起印象笔记以\"篇\"为单位、notion以“块”为单位，双链笔记是以“点”为单位。这就以为着，我们可以将大块的知识细化为一个个相对独立的知识点。同时，在细化的过程中，我们逐渐把各个知识点从原有的语境中解放（抽象）出来，进而形成能够在长时间的考验下保留下来的知识。这样，当日后遇到新的情景的时候，我们也能迅速知识结构，以支持新的目标。\n\n具体而言，以roam research为例，在使用过程中，你任何时候都可以用 [[]] 来关联另一个概念或者页面，或用 (()) 来关联一个句子或一个块。\n2、记录成本低\n大部分双链笔记都是基于大纲笔记的，即整体的框架类似于bull…",
          "link": "https://sspai.com/post/75822",
          "publishedOn": "2022-09-20T03:03:18.000Z",
          "wordCount": 490,
          "title": "双链笔记是伪概念？聊聊双链的核心优势——知识管理",
          "imageUrl": "https://cdn.sspai.com/2022/09/19/94f4c9326acaa41dccd8faa88b7bbaa4.png"
        },
        {
          "id": "https://sspai.com/post/75828",
          "author": "John",
          "description": "在正式开始说体验前，先谈谈索尼在 9 月初正式发布的全新真·小屏旗舰——Xperia 5 IV，在设计上融合了 Xperia 1 系列的特点，总算是更换了硬朗的边框以及磨砂质感的后盖玻璃，可以说完全契合个人的审美爱好，更不用说破天荒加入了无线充电，我对 Xperia 5 III 最不满意的两点都解决了，还有什么理由不买呢？加上最近在各种视频网站看到关于 Xperia 1 IV、5 III 等机器的吐槽，于是就想在 5 IV 到手前，和大家分享一下我的使用体验。\n为何购买 Xperia 5 III\n说起来在今年入手 5 III 之前，我在用的是三星 Galaxy S22 Ultra，S22U 真的什么都好，拍照、系统啥的我都挺满意，而且外观更是延续了曾经最爱的 Xperia XZ Premium 的神韵，当时一发售就冲了。只是在实际使用时，总会觉得这机器实在是太大了，单手用太累，可我又不像当年用黑莓 Passport 那样充满喜爱，对其体积无下限容忍，于是乎就又考虑换台趁手的小屏旗舰机器。\n然后说起现在的小屏机器，基本上没得选，iPhone 就只有 SE 和 12、13 mini，Android 这边能看上眼的就是魅族 18、Galaxy S22 和 Xperia 5 III。综合来看，12、13 mini 因为刘海直接 pass，SE 电量实在担忧，魅族 18 不防水也 pass，只能让 5 III PK S22。作为一个曾经的 Xperia 5 用户，对于 5 III 可以说是完全不担心，唯一的问题就是臭名昭著的火龙 888，但 S22 用的是 8 Gen1，这对卧龙凤雏就随便吧，毕竟我都能接受 S22U 的 8 Gen1 了。最后特意跑去三星官方店实际上手体验 S22 的感觉，由于 S22 70.6mm 的宽度握持时有点撑手不舒服，于是乎 68mm 宽度的 Xperia…",
          "link": "https://sspai.com/post/75828",
          "publishedOn": "2022-09-19T16:31:19.000Z",
          "wordCount": 751,
          "title": "写在 Xperia 5 IV 到手前，我的 Xperia 5 III 体验",
          "imageUrl": "https://cdn.sspai.com/2022/09/20/1528338ded5332b25ded04ff431aa921.jpg"
        }
      ]
    },
    {
      "title": "Opensource.com",
      "feedUrl": "https://opensource.com/feed",
      "siteUrl": "https://opensource.com/",
      "articles": [
        {
          "id": "70211 at https://opensource.com",
          "author": "Lokesh Mandvekar",
          "description": "How Podman packaging works on Linux\nLokesh Mandvekar\nThu, 09/29/2022 - 03:00\n\n            \nOver the past few months, the Podman project has been reworking its process for generating Debian and Ubuntu packages. This article outlines the past and present of the Debian packaging work done by the Podman project team. Please note that this article does not refer to the official Debian and Ubuntu packages that Reinhard Tartler and team created and maintain.\nDebian build process\nLong story short, the typical Debian build process involves \"Debianizing\" an upstream repository. First, a debian subdirectory containing packaging metadata and any necessary patches is added to the upstream repo. Then the dpkg-buildpackage command is run to generate the .deb packages.\nOlder Debian build process for Podma…",
          "link": "https://opensource.com/article/22/9/podman-packages-linux",
          "publishedOn": "2022-09-29T07:00:00.000Z",
          "wordCount": 1936,
          "title": "How Podman packaging works on Linux",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/OSDC_gift_giveaway_box_520x292.png"
        },
        {
          "id": "70216 at https://opensource.com",
          "author": "Bolaji Ayodeji",
          "description": "Build an open source project using this essential advice\nBolaji Ayodeji\nWed, 09/28/2022 - 03:00\n\n            \nOpen source is a flourishing and beneficial ecosystem that publicly solves problems in communities and industries using software developed through a decentralized model and community contributions. Over the years, this ecosystem has grown in number and strength among hobbyists and professionals alike. It's mainstream now—even proprietary companies use open source to build software.\nWith the ecosystem booming, many developers want to get in and build new open source projects. The question is: How do you achieve that successfully?\nThis article will demystify the lifecycle and structure of open source projects. I want to give you an overview of what goes on inside an open source proje…",
          "link": "https://opensource.com/article/22/9/build-open-source-project",
          "publishedOn": "2022-09-28T07:00:00.000Z",
          "wordCount": 2560,
          "title": "Build an open source project using this essential advice",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/BUSINESS_buildtogether.png"
        },
        {
          "id": "70209 at https://opensource.com",
          "author": "Sachin Samal",
          "description": "165+ JavaScript terms you need to know\nSachin Samal\nTue, 09/27/2022 - 03:00\n\n            \nJavaScript is a rich language, with sometimes a seemingly overwhelming number of libraries and frameworks. With so many options available, it's sometimes useful to just look at the language itself and keep in mind its core components. This glossary covers the core JavaScript language, syntax, and functions.\nJavaScript variables\nvar: The most used variable. Can be reassigned but only accessed within a function, meaning function scope. Variables defined with var move to the top when code is executed.\nconst: Cannot be reassigned and not accessible before they appear within the code, meaning block scope.\nlet: Similar to const with block scope, however, the let variable can be reassigned but not re-declare…",
          "link": "https://opensource.com/article/22/9/javascript-glossary",
          "publishedOn": "2022-09-27T07:00:00.000Z",
          "wordCount": 2875,
          "title": "165+ JavaScript terms you need to know",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/code_javascript.jpg"
        },
        {
          "id": "70203 at https://opensource.com",
          "author": "Leigh Morresi",
          "description": "Get change alerts from any website with this open source tool\nLeigh Morresi\nTue, 09/27/2022 - 03:00\n\n            \nThe year was 2020, and news about COVID-19 came flooding in so quickly that everyone felt completely overwhelmed with similar news articles providing updates with varying degrees of accuracy.\nBut all I needed to know was when my official government guidelines changed. In the end, that's all that mattered to me.\nWhether the concern is a pandemic or just the latest tech news, keeping ahead of changes in website content can be critical.\nThe changedetection.io project provides a simple yet highly capable, open source solution for website change detection and notification. It's easy to set up, and it can notify over 70 (and counting) different notification systems, such as Matrix, M…",
          "link": "https://opensource.com/article/22/9/changedetection-io-open-source-website-changes",
          "publishedOn": "2022-09-27T07:00:00.000Z",
          "wordCount": 1716,
          "title": "Get change alerts from any website with this open source tool",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/browser_desktop_website_checklist_metrics.png"
        },
        {
          "id": "70212 at https://opensource.com",
          "author": "Gaurav Kamathe",
          "description": "OpenSSF: on a mission to improve security of open source software\nGaurav Kamathe\nMon, 09/26/2022 - 03:00\n\n            \nOpen source software (OSS), once a niche segment of the development landscape, is now ubiquitous. This growth is fantastic for the open source community. However, as the usage of OSS increases, so do concerns about security. Especially in mission-critical applications— think medical devices, automobiles, space flight, and nuclear facilities—securing open source technology is of the utmost priority. No individual entity, whether developers, organizations, or governments, can single-handedly solve this problem. The best outcome is possible when all of them come together to collaborate.\nThe Open Source Security Foundation (OpenSSF) formed to facilitate this collaboration. Ope…",
          "link": "https://opensource.com/article/22/9/openssf-open-source-software-security",
          "publishedOn": "2022-09-26T07:00:00.000Z",
          "wordCount": 1678,
          "title": "OpenSSF: on a mission to improve security of open source software",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/security-lock-cloud-safe.png"
        },
        {
          "id": "70208 at https://opensource.com",
          "author": "Richard Chambers",
          "description": "The story behind Joplin, the open source note-taking app\nRichard Chambers\nMon, 09/26/2022 - 03:00\n\n            \nIn this interview, I met up with Laurent Cozic, creator of the note-taking app, Joplin. Joplin was a winner of the 20i rewards, so I wanted to find out what makes it such a success, and how he achieved it.\nCould you summarize what Joplin does?\nJoplin is an open source note-taking app. It allows you to capture your thoughts and securely access them from any device.\nObviously, there are other note-taking apps out there—but apart from it being free to use, what makes it different?\nThe fact that it is open source is an important aspect for many of our users, because it means there is no vendor locking on the data, and that data can be easily exported and accessed in various ways.\nWe …",
          "link": "https://opensource.com/article/22/9/joplin-interview",
          "publishedOn": "2022-09-26T07:00:00.000Z",
          "wordCount": 2237,
          "title": "The story behind Joplin, the open source note-taking app",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/wfh_work_home_laptop_work.png"
        },
        {
          "id": "70199 at https://opensource.com",
          "author": "Seth Kenlon",
          "description": "Drop your database for PostgreSQL\nSeth Kenlon\nSat, 09/24/2022 - 03:00\n\n            \nDatabases are tools to store information in an organized but flexible way. A spreadsheet is essentially a database, but the constraints of a graphical application render most spreadsheet applications useless to programmers. With Edge and IoT devices becoming significant target platforms, developers need powerful but lightweight solutions for storing, processing, and querying large amounts of data. One of my favourite combinations is the PostgreSQL database and Lua bindings, but the possibilities are endless. Whatever language you use, Postgres is a great choice for a database, but you need to know some basics before adopting it.\nInstall Postgres\nTo install PostgreSQL on Linux, use your software repository. …",
          "link": "https://opensource.com/article/22/9/drop-your-database-for-postgresql",
          "publishedOn": "2022-09-24T07:00:00.000Z",
          "wordCount": 2681,
          "title": "Drop your database for PostgreSQL",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/lenovo-thinkpad-laptop-concentration-focus-windows-office.png"
        },
        {
          "id": "70205 at https://opensource.com",
          "author": "Raigor Jiang",
          "description": "How to build a dynamic distributed database with DistSQL\nRaigor Jiang\nFri, 09/23/2022 - 03:00\n\n            \nDistributed databases are common for many reasons. They increase reliability, redundancy, and performance. Apache ShardingSphere is an open source framework that enables you to transform any database into a distributed database. Since the release of ShardingSphere 5.0.0, DistSQL (Distributed SQL) has provided dynamic management for the ShardingSphere ecosystem.\nIn this article, I demonstrate a data sharding scenario in which DistSQL's flexibility allows you to create a distributed database. At the same time, I show some syntax sugar to simplify operating procedures, allowing your potential users to choose their preferred syntax.\nA series of DistSQL statements are run through practica…",
          "link": "https://opensource.com/article/22/9/dynamic-distributed-database-distsql",
          "publishedOn": "2022-09-23T07:00:00.000Z",
          "wordCount": 3731,
          "title": "How to build a dynamic distributed database with DistSQL",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/BIZ_darwincloud_520x292_0311LL.png"
        },
        {
          "id": "70200 at https://opensource.com",
          "author": "Seth Kenlon",
          "description": "Install JDBC on Linux in 3 steps\nSeth Kenlon\nFri, 09/23/2022 - 03:00\n\n            \nWhen you write an application, it's common to require data storage. Sometimes you're storing assets your application needs to function, and other times you're storing user data, including preferences and save data. One way to store data is in a database, and in order to communicate between your code and a database, you need a database binding or connector for your language. For Java, a common database connector is JDBC (Java database connectivity.)\n1. Install Java\nOf course, to develop with Java you must also have Java installed. I recommend SDKman for Linux, macOS, and WSL or Cygwin. For Windows, you can download OpenJDK from developers.redhat.com.\n\nMore on Java\nWhat is enterprise Java programming?\nAn open …",
          "link": "https://opensource.com/article/22/9/install-jdbc-linux",
          "publishedOn": "2022-09-23T07:00:00.000Z",
          "wordCount": 1398,
          "title": "Install JDBC on Linux in 3 steps",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/java-coffee-mug.jpg"
        },
        {
          "id": "70204 at https://opensource.com",
          "author": "Alan Formy-Duval",
          "description": "5 Git configurations I make on Linux\nAlan Formy-Duval\nThu, 09/22/2022 - 03:00\n\n            \nSetting up Git on Linux is simple, but here are the five things I do to get the perfect configuration:\nCreate global configuration\nSet default name\nSet default email address\nSet default branch name\nSet default editor\nI manage my code, shell scripts, and documentation versioning using Git. This means that for each new project I start, the first step is to create a directory for its content and make it into a Git repository:\n$ mkdir newproject\ncd newproject\ngit init\n\n\n\n            \nMore on Git\nWhat is Git?\nGit cheat sheet\nMarkdown cheat sheet\nNew Git articles\nThere are certain general settings that I always want. Not many, but enough that I don't want to have to repeat the configuration each time. I l…",
          "link": "https://opensource.com/article/22/9/git-configuration-linux",
          "publishedOn": "2022-09-22T07:00:00.000Z",
          "wordCount": 2050,
          "title": "5 Git configurations I make on Linux",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/linux_keyboard_desktop.png"
        }
      ]
    },
    {
      "title": "The Verge -  All Posts",
      "feedUrl": "https://www.theverge.com/rss/index.xml",
      "siteUrl": "https://www.theverge.com/",
      "articles": [
        {
          "id": "https://www.theverge.com/2022/9/29/23378228/twitch-bot-error-restriction-browser-support-chrome-edge-firefox",
          "author": null,
          "description": "Twitch has caused confusion among its users by restricting browser support to just Chrome, Edge and Firefox. | Nick Barclay / The Verge\n    \n\n  \nPoor communications from Twitch have led to confusion following the service announcing that Chrome, Edge, and Firefox are currently the only web browsers officially supported by the popular streaming platform. No context was provided within the announcement, though it appears the restrictions are temporary and have been placed on alternative browsers so that Twitch can locate and shut down access points being used to create masses of bot accounts.\nThe issues started when users started experiencing errors when logging into the service. Twitch Support then addressed the situation by asking users to login from an up-to-date version of the three supported web browsers, and announced that a help article to address troubleshooting the issues...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/29/23378228/twitch-bot-error-restriction-browser-support-chrome-edge-firefox",
          "publishedOn": "2022-09-29T10:36:56.000Z",
          "wordCount": 8211,
          "title": "Twitch is temporarily restricting browser support to just Chrome, Edge, and Firefox",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/DlQ0aWsCKa_hIGORWL7hl5PLvsE=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23951421/STK044_VRG_Illo_N_Barclay_1_twitch.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/29/23378221/microsoft-outlook-windows-new-design-office-insiders",
          "author": null,
          "description": "The new Outlook for Windows design. | Image: Microsoft\n    \n\n  \nMicrosoft is making its new version of Outlook for Windows available to all Office testers this week. The new Outlook for Windows app will make the desktop email client a lot more like the web version. Microsoft has been working on this redesign for months, and originally released a semi-public beta earlier this year. \n“Since then, we’ve received valuable feedback from Office Insiders on Beta Channel about how to create a more consistent, feature-rich experience,” explains Margie Clinton, group product manager on the Outlook team. “We’ve been listening to feedback since May and our team has been working diligently to improve the new Outlook for Windows.”\nImage: Microsoft\n      Office testers can try the new Outlook for...\n  \nContinue reading…",
          "link": "https://www.theverge.com/2022/9/29/23378221/microsoft-outlook-windows-new-design-office-insiders",
          "publishedOn": "2022-09-29T10:07:35.000Z",
          "wordCount": 7216,
          "title": "Microsoft’s new Outlook for Windows now available to all Office testers",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/tziCMmRBATdBo_4R6GzdDbPErTk=/0x0:2992x1796/1200x628/filters:focal(1496x898:1497x899)/cdn.vox-cdn.com/uploads/chorus_asset/file/24063984/outlook_new.jpeg"
        },
        {
          "id": "https://www.theverge.com/2022/9/29/23378174/sackboy-a-big-adventure-pc-release-date",
          "author": null,
          "description": "Sony is bringing another PlayStation exclusive to PC. Sackboy: A Big Adventure is set to release on PC on October 27th, according to a trailer that was posted early to Sony’s PlayStation Latin America YouTube account. Spotted by Nibel on Twitter, the trailer confirms the PC port of Sackboy: A Big Adventure will be full of improvements.\n4K and 120fps support is listed, alongside support for ultrawide 21:9 aspect ratio monitors, Nvidia’s DLSS, and Variable Refresh Rate (VRR). These are the best improvements to Sackboy: A Big Adventure yet, following a resolution and visuals boost on the PS5 version.\nSackboy is the latest in a line of PlayStation games on PC\nSackboy: A Big Adventure is the latest in a growing line of PlayStation exclusive...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/29/23378174/sackboy-a-big-adventure-pc-release-date",
          "publishedOn": "2022-09-29T07:19:48.000Z",
          "wordCount": 7756,
          "title": "Sackboy: A Big Adventure arrives on PC next month",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/nvkZWk8uoE2BlnBseHxwh2b9afE=/0x0:3840x2160/1200x628/filters:focal(1920x1080:1921x1081)/cdn.vox-cdn.com/uploads/chorus_asset/file/24063933/F3WT1i11qaAoJjAErwUywN4x.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/29/23377376/automatic-emergency-braking-average-speed-study-aaa",
          "author": null,
          "description": "Automatic emergency braking (AEB) is pretty good at preventing low-speed rear-end crashes but kind of sucks when vehicles are traveling at more average speeds, according to new research from the American Automobile Association (AAA).\nStarting September 2022, all new cars sold in the US are required to come standard with AEB, which uses forward-facing cameras and other sensors to automatically apply the brakes when a crash is imminent. The Insurance Institute for Highway Safety estimates that AEB may help prevent 28,000 crashes and 12,000 injuries by 2025.\nUsing four common vehicles, AAA wanted to put AEB to the test to see how it’s progressed since first rolling out to production vehicles nearly 20 years ago. What they found was not that...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/29/23377376/automatic-emergency-braking-average-speed-study-aaa",
          "publishedOn": "2022-09-29T04:01:00.000Z",
          "wordCount": 7508,
          "title": "Automatic emergency braking is not great at preventing crashes at normal speeds",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/2bREd552Whz5po00xrzjtHo20gk=/0x0:1136x760/1200x628/filters:focal(568x380:569x381)/cdn.vox-cdn.com/uploads/chorus_asset/file/24042158/Screen_Shot_2022_09_21_at_2.19.43_PM.png"
        },
        {
          "id": "https://www.theverge.com/2022/9/28/23377732/amazon-prime-video-yankees-cable-baseball-yes-network",
          "author": null,
          "description": "Its last exclusive game of the season won’t be quite as exclusive. | Photo by Cole Burston/Getty Images\n    \n\n  \nThis Friday’s Yankees game against the Orioles will no longer be exclusively available on Amazon Prime Video, like 20 games before it: the game will also be airing on the Yankee Entertainment and Sports (YES) network, according to a tweet from the cable network. It’s a big change, and it’s something that Apple didn’t do last week, despite pleas from New York’s Attorney General.\nMany Yankees fans will likely want to tune in to the game, as outfielder Aaron Judge could beat a record for home runs that’s stood for over 60 years (he matched it on Wednesday after this article was originally published). But the ability to watch the Yankees on YES has been a bit contentious lately; last Friday, New York’s attorney general Letitia James called...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/28/23377732/amazon-prime-video-yankees-cable-baseball-yes-network",
          "publishedOn": "2022-09-29T00:15:54.000Z",
          "wordCount": 8299,
          "title": "Amazon says YES to putting the Yankees on cable",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/Toe80sSmZoLFYfgFUJ1NCiHZ3To=/0x0:4429x2953/1200x628/filters:focal(2215x1477:2216x1478)/cdn.vox-cdn.com/uploads/chorus_asset/file/24063189/1243579837.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/28/23373094/dbrand-project-killswitch-steam-deck-case-magnet-stand",
          "author": null,
          "description": "The Killswitch case keeps your Steam Deck safe and is currently available on the Dbrand site. | Photo by Alice Newcome-Beill / The Verge\n    \n\n  \nIn high school, I’d keep my CD player from getting crushed in my bookbag by wrapping it in a wool sock. Considering that the CD player was probably the most expensive thing I owned at the time, I probably could’ve done better. This is how I felt with the first case I bought for my Steam Deck. It was definitely a step up from mismatched footwear, but I knew a device like this demands a little more respect without keeping it constantly locked away inside the case that it was packaged with.\n\n\nDbrand, maker of accessories for your phone, AirPods, and even your PS5, shares this sentiment and made “Project Killswitch.” Killswitch is designed to be a better protective skin for the Steam Deck and started development shortly following Valve’s...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/28/23373094/dbrand-project-killswitch-steam-deck-case-magnet-stand",
          "publishedOn": "2022-09-29T00:06:34.000Z",
          "wordCount": 9166,
          "title": "Dbrand’s Steam Deck case is so good it almost makes you forget its big flaw",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/IlI8i3nNfm9GCQPVewCdXfkXBrw=/0x0:5509x3099/1200x628/filters:focal(2762x1358:2763x1359)/cdn.vox-cdn.com/uploads/chorus_asset/file/24059120/DSC_0245.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/28/23377115/oura-horizon-smart-ring-rose-gold-announcement",
          "author": null,
          "description": "The really round Oura Horizon comes in five colors, including the new rose gold finish. | Image: Oura\n    \n\n  \nIf you were intrigued by previous Oura smart rings but were turned off by a design that didn’t let you spin it on your desk, then you’re in luck. Oura is releasing a rounder version of its health and fitness tracking smart ring line called Horizon, though it’ll cost you $50 more than the version not matching that preference. (via Gizmodo).\nThe Oura Horizon is largely identical to the last year’s Oura Ring (Gen 3) in terms of functionality, including the blood oxygen monitoring abilities that were just activated this year. This means the Horizon is just a cosmetic change accompanying the old “heritage” design, and it comes in the same original gold, stealth, black, and silver finishes, plus a brand new rose gold color you could totally...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/28/23377115/oura-horizon-smart-ring-rose-gold-announcement",
          "publishedOn": "2022-09-28T22:26:02.000Z",
          "wordCount": 8761,
          "title": "Now you can get a really round Oura smart ring",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/d5VPuavvWuoP6TwjBhNT5uDCSl8=/0x0:1280x854/1200x628/filters:focal(640x427:641x428)/cdn.vox-cdn.com/uploads/chorus_asset/file/24062894/HERO_Oura_Gen3_Horizon___Group_Shot.jpeg"
        }
      ]
    },
    {
      "title": "Ars Technica",
      "feedUrl": "https://arstechnica.com/feed/",
      "siteUrl": "https://arstechnica.com",
      "articles": [
        {
          "id": "https://arstechnica.com/?p=1885478",
          "author": "Dan Goodin",
          "description": "Small office routers? FreeBSD machines? Enterprise servers? Chaos infects them all.",
          "link": "https://arstechnica.com/?p=1885478",
          "publishedOn": "2022-09-28T23:48:03.000Z",
          "wordCount": 1866,
          "title": "Never-before-seen malware has infected hundreds of Linux and Windows devices",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2020/10/malware-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885472",
          "author": "Beth Mole",
          "description": "The outbreak mirrored a nationwide surge in norovirus outbreaks.",
          "link": "https://arstechnica.com/?p=1885472",
          "publishedOn": "2022-09-28T22:31:38.000Z",
          "wordCount": 1787,
          "title": "Grand Canyon’s explosive gastroenteritis was a 3-month, multisource outbreak",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/06/GettyImages-1196055092-760x380.jpeg"
        },
        {
          "id": "https://arstechnica.com/?p=1885434",
          "author": "Kyle Orland",
          "description": "Android-based Razer Edge 5G is based on last year's Qualcomm reference design.",
          "link": "https://arstechnica.com/?p=1885434",
          "publishedOn": "2022-09-28T20:45:34.000Z",
          "wordCount": 1599,
          "title": "Razer joins the “handheld streaming console” wars, which are now a thing somehow",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/razer-nc-1230x690-760x380.jpeg"
        },
        {
          "id": "https://arstechnica.com/?p=1884969",
          "author": "Corey Gaskin",
          "description": "Dealmaster also has PC components, charging gear, and gift card deals.",
          "link": "https://arstechnica.com/?p=1884969",
          "publishedOn": "2022-09-28T20:35:38.000Z",
          "wordCount": 2290,
          "title": "Today’s best deals: Apple MacBook Air, Sony and LG 4K TVs, Nintendo Switch, and more",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/dm928-1-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885349",
          "author": "Kevin Purdy",
          "description": "Cloud giant says its verification tool doesn't challenge or profile users.",
          "link": "https://arstechnica.com/?p=1885349",
          "publishedOn": "2022-09-28T20:00:18.000Z",
          "wordCount": 1579,
          "title": "Cloudflare’s CAPTCHA replacement lacks crosswalks, checkboxes, Google",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-156899969-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885357",
          "author": "Ashley Belanger",
          "description": "Access to 500,000 chargers could lay the groundwork to convert Americans to EVs.",
          "link": "https://arstechnica.com/?p=1885357",
          "publishedOn": "2022-09-28T19:11:00.000Z",
          "wordCount": 1898,
          "title": "More EV charging stations coming nationwide, electrifying 75K miles of highways",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1243220502-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885207",
          "author": "Scharon Harding",
          "description": "A year after its announcement, it's unclear when Astro will be ready.",
          "link": "https://arstechnica.com/?p=1885207",
          "publishedOn": "2022-09-28T18:54:39.000Z",
          "wordCount": 1932,
          "title": "Amazon’s Astro robot still isn’t ready for prime time",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/Amazon-Astro-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885245",
          "author": "Sam Machkovech",
          "description": "Other delays out of 2022 leave Ubisoft with an unusually quiet holiday season.",
          "link": "https://arstechnica.com/?p=1885245",
          "publishedOn": "2022-09-28T18:08:07.000Z",
          "wordCount": 1984,
          "title": "Ubisoft’s biggest 2022 game delayed for sixth time in five years",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/skull-and-bones-listing-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885259",
          "author": "Benj Edwards",
          "description": "DALL-E launched frenzy of image synthesis development but was invitation-only until now.",
          "link": "https://arstechnica.com/?p=1885259",
          "publishedOn": "2022-09-28T17:33:13.000Z",
          "wordCount": 1487,
          "title": "DALL-E image generator is now open to everyone",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/dalle_hero_1-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1884560",
          "author": "Ron Amadeo",
          "description": "Search for an ATM or restaurant and Maps can point the way via your camera feed.",
          "link": "https://arstechnica.com/?p=1884560",
          "publishedOn": "2022-09-28T17:31:42.000Z",
          "wordCount": 1333,
          "title": "Google Maps gets augmented reality search results",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/Google-Maps-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885247",
          "author": "Jon Brodkin",
          "description": "Google Fiber test delivered 20.2Gbps downloads to exec's home in Kansas City.",
          "link": "https://arstechnica.com/?p=1885247",
          "publishedOn": "2022-09-28T17:25:19.000Z",
          "wordCount": 1565,
          "title": "Google Fiber touts 20Gbps download speed in test, promises eventual 100Gbps",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2020/07/getty-fiber-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885221",
          "author": "Andrew Cunningham",
          "description": "It will also be Amazon's largest Kindle e-reader, with a 10.2-inch display.",
          "link": "https://arstechnica.com/?p=1885221",
          "publishedOn": "2022-09-28T17:14:23.000Z",
          "wordCount": 1620,
          "title": "Amazon’s $340 Kindle Scribe is its first e-reader with handwriting and pen support",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/Kindle-Scribe_1920x1080_302-760x380.jpeg"
        },
        {
          "id": "https://arstechnica.com/?p=1885190",
          "author": "Jennifer Ouellette",
          "description": "The SS Mesaba was torpedoed by a German sub six years after Titanic's sinking.",
          "link": "https://arstechnica.com/?p=1885190",
          "publishedOn": "2022-09-28T17:13:51.000Z",
          "wordCount": 1975,
          "title": "Ship that warned Titanic of icebergs has been found at bottom of Irish Sea",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/mesaba1CROP-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885142",
          "author": "Kevin Purdy",
          "description": "Also adding hotspot fallback during outages, plus company's first PoE products.",
          "link": "https://arstechnica.com/?p=1885142",
          "publishedOn": "2022-09-28T16:50:27.000Z",
          "wordCount": 1610,
          "title": "Eero can now extend your mesh network with Echo devices",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/eero-PoE-6-Lifestyle-760x380.png"
        },
        {
          "id": "https://arstechnica.com/?p=1885222",
          "author": "Kyle Orland",
          "description": "\"Disaffirmation\" defense may open cheating defendant to serious copyright claims.",
          "link": "https://arstechnica.com/?p=1885222",
          "publishedOn": "2022-09-28T16:48:37.000Z",
          "wordCount": 2194,
          "title": "No, minors can’t just “opt out” of Destiny 2’s anti-cheating provisions",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/d2cheat-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885194",
          "author": "Ron Amadeo",
          "description": "Base model design changes bring the phone more in line with the Ultra model.",
          "link": "https://arstechnica.com/?p=1885194",
          "publishedOn": "2022-09-28T16:08:11.000Z",
          "wordCount": 1338,
          "title": "Early renders show the Galaxy S23 ditching the camera bump",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/SAMSUNG-GALAXY-S23-5K2-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885111",
          "author": "Dan Goodin",
          "description": "Previously overlooked flaws allow malicious homeservers to decrypt and spoof messages.",
          "link": "https://arstechnica.com/?p=1885111",
          "publishedOn": "2022-09-28T16:00:27.000Z",
          "wordCount": 1520,
          "title": "Serious vulnerabilities in Matrix’s end-to-end encryption have been patched",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/matrix-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885151",
          "author": "Financial Times",
          "description": "Social media group seeks sanctions as billionaire attempts to pull out of acquisition.",
          "link": "https://arstechnica.com/?p=1885151",
          "publishedOn": "2022-09-28T13:34:51.000Z",
          "wordCount": 1504,
          "title": "Twitter says Elon Musk’s own data scientists did not back up bots claims",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/04/GettyImages-1239071958-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885129",
          "author": "Eric Berger",
          "description": "This is the kind of storm that destroys a community forever.",
          "link": "https://arstechnica.com/?p=1885129",
          "publishedOn": "2022-09-28T13:34:47.000Z",
          "wordCount": 1844,
          "title": "As a meteorologist, Hurricane Ian is the nightmare storm I worry about most",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/ian-2-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1885144",
          "author": "Inside Climate News",
          "description": "Extreme 2020 wildfires affected the water cycle in key mountain forests.",
          "link": "https://arstechnica.com/?p=1885144",
          "publishedOn": "2022-09-28T13:30:04.000Z",
          "wordCount": 1544,
          "title": "Western forests, snowpack, and wildfires appear trapped in vicious climate cycle",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/snowmelt-760x380.jpg"
        }
      ]
    },
    {
      "title": "Business Latest",
      "feedUrl": "https://www.wired.com/feed/category/business/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "6331df25977791160bfcd3a6",
          "author": "Khari Johnson",
          "description": "Younger people seek answers on TikTok and Instagram—Google hopes to lure them back with more visual, infinite scrolling search results.",
          "link": "https://www.wired.com/story/google-borrows-from-tiktok-to-keep-gen-z-searching/",
          "publishedOn": "2022-09-28T17:23:13.000Z",
          "wordCount": 19243,
          "title": "Google Borrows From TikTok to Keep Gen Z Searching",
          "imageUrl": "https://media.wired.com/photos/63339c7636c33c0247a2f108/191:100/w_1280,c_limit/Neighborhood-Vibe-Google-Search-Updates-Business.jpg"
        },
        {
          "id": "63332a5d00704d14b5ffba08",
          "author": "Steven Levy",
          "description": "The company’s new smart gadget uses radar to track your breathing while you sleep. It’s part of Amazon’s plan to weave its products invisibly into your life.",
          "link": "https://www.wired.com/story/amazon-wants-to-cocoon-you-with-ambient-intelligence/",
          "publishedOn": "2022-09-28T17:15:00.000Z",
          "wordCount": 24040,
          "title": "Amazon Wants to Cocoon You With ‘Ambient Intelligence’",
          "imageUrl": "https://media.wired.com/photos/633481ccc4d3ebc9237bc77d/191:100/w_1280,c_limit/Halo_Rise_Pull-apart_01_RGB_science.jpg"
        },
        {
          "id": "63332c6f40fe1e8870aa3bc3",
          "author": "Will Knight",
          "description": "The cutesy robot called Astro doesn’t do much now, but the company says it’s a step toward machines that understand your habits.",
          "link": "https://www.wired.com/story/amazon-wants-its-home-robot-astro-to-anticipate-your-every-need/",
          "publishedOn": "2022-09-28T16:45:00.000Z",
          "wordCount": 22749,
          "title": "Amazon Wants Its Home Robot to Anticipate Your Every Need",
          "imageUrl": "https://media.wired.com/photos/6333a06b74ce5b82a68ef382/191:100/w_1280,c_limit/Astro-Robot-Pet-Detection-Amazon-Business.jpg"
        },
        {
          "id": "632e504974ce5b82a68ef370",
          "author": "Morgan Meaker",
          "description": "The social media platform’s process for moderating spam, including bots, has been mired in secrecy—until now.",
          "link": "https://www.wired.com/story/the-quest-to-find-twitters-elusive-bot-team/",
          "publishedOn": "2022-09-28T15:42:43.000Z",
          "wordCount": 24207,
          "title": "The Quest to Find Twitter’s Elusive Bot Team",
          "imageUrl": "https://media.wired.com/photos/632e5049c9bb1af7ef24988c/191:100/w_1280,c_limit/Bot_BotsSupportTwitter.jpg"
        },
        {
          "id": "632e50c862435d269fdbdbf9",
          "author": "Morgan Meaker",
          "description": "In the battle over Twitter’s future, the number of bots on the platform is a key issue. Problem is, nobody knows how to count them.",
          "link": "https://www.wired.com/story/musk-twitter-botometer/",
          "publishedOn": "2022-09-27T11:00:00.000Z",
          "wordCount": 20983,
          "title": "This Student’s Side Project Will Help Decide Musk vs. Twitter",
          "imageUrl": "https://media.wired.com/photos/632e50c874ce5b82a68ef371/191:100/w_1280,c_limit/Bot_Botometer.jpg"
        },
        {
          "id": "632afbcbc9bb1af7ef249867",
          "author": "Vittoria Elliott",
          "description": "Extreme content is spreading rapidly on social networks in Brazil, sparking fears of a violent uprising.",
          "link": "https://www.wired.com/story/brazils-far-right-plots-its-own-january-6-insurrection/",
          "publishedOn": "2022-09-27T11:00:00.000Z",
          "wordCount": 19434,
          "title": "Brazil's Far Right Plots Its Own January 6",
          "imageUrl": "https://media.wired.com/photos/632cb76c8990652479ff399c/191:100/w_1280,c_limit/Bolsenero_biz_GettyImages-1243428750.jpg"
        },
        {
          "id": "6329ea4d40fe1e8870aa3b51",
          "author": "Vittoria Elliott",
          "description": "An orchestrated attack went after an independent news website and harvested swathes of Facebook user data. And nobody can stop it.",
          "link": "https://www.wired.com/story/facebook-bots-ddos-attack/",
          "publishedOn": "2022-09-26T15:04:54.000Z",
          "wordCount": 20637,
          "title": "A Sprawling Bot Network Used Fake Porn to Fool Facebook",
          "imageUrl": "https://media.wired.com/photos/632b595aeecde8c117e7f5ae/191:100/w_1280,c_limit/Bot_Vietnam-(1).jpg"
        },
        {
          "id": "632ded1600704d14b5ffb9b4",
          "author": "Lauren Goode, Gideon Lichfield",
          "description": "The blockchain project’s cofounder Vitalik Buterin says its recent big upgrade lays a path for more technical changes, and greater adoption.",
          "link": "https://www.wired.com/story/whats-next-for-ethereum-after-the-merge/",
          "publishedOn": "2022-09-26T12:00:00.000Z",
          "wordCount": 26735,
          "title": "What’s Next for Ethereum After the Merge",
          "imageUrl": "https://media.wired.com/photos/632ea7cf8990652479ff39d3/191:100/w_1280,c_limit/BUTERIN_BIZ_GettyImages-1238606759.jpg"
        },
        {
          "id": "632e4ebbf2203b5586fac020",
          "author": "Chris Stokel-Walker",
          "description": "Automated accounts are the target of ire and the linchpin of Elon Musk’s attempt to break his deal with the platform. But some are benign—or even helpful.",
          "link": "https://www.wired.com/story/twitter-bots-elon-musk-trial/",
          "publishedOn": "2022-09-26T11:00:00.000Z",
          "wordCount": 21364,
          "title": "Not All Bots Are Bad, and Twitter Knows It",
          "imageUrl": "https://media.wired.com/photos/632e4eba20bc56769c4131ed/191:100/w_1280,c_limit/Bot_GoodBot.jpg"
        },
        {
          "id": "632ca371995b6da54b57efe1",
          "author": "Megan Farokhmanesh",
          "description": "The company is going after cryptocurrency gambling—but will that be enough to satisfy concerned streamers?",
          "link": "https://www.wired.com/story/twitch-crypto-gambling-sliker-pokimane-devin-nash-boycott/",
          "publishedOn": "2022-09-23T15:25:18.000Z",
          "wordCount": 18910,
          "title": "Twitch's Crypto Casino Ban Ignores the Bigger Play",
          "imageUrl": "https://media.wired.com/photos/632cee9d8990652479ff39bf/191:100/w_1280,c_limit/Twitch-Gambling-Business-GettyImages-1395854967.jpg"
        },
        {
          "id": "632caf9920bc56769c4131cc",
          "author": "Steven Levy",
          "description": "Plus: The Supreme Court in cyberspace, what’s up with Web3, and ghost town resurrections.",
          "link": "https://www.wired.com/story/plaintext-bogus-fears-of-censorship-could-spell-the-end-of-content-moderation/",
          "publishedOn": "2022-09-23T13:00:00.000Z",
          "wordCount": 24952,
          "title": "Bogus Fears of Censorship Could Spell the End of Content Moderation",
          "imageUrl": "https://media.wired.com/photos/632ce98ac4d3ebc9237bc689/191:100/w_1280,c_limit/plaintext_texas_biz_GettyImages-656427940.jpg"
        },
        {
          "id": "632cf64c977791160bfcd395",
          "author": "Morgan Meaker",
          "description": "An 8-year-old’s YouTube snafu—and one unlikely parent activist—sparked a nationwide debate on the tech giant’s ubiquity and handling of children’s data.",
          "link": "https://www.wired.com/story/denmark-google-schools-data/",
          "publishedOn": "2022-09-23T11:00:00.000Z",
          "wordCount": 22454,
          "title": "A Danish City Built Google Into Its Schools—Then Banned It",
          "imageUrl": "https://media.wired.com/photos/632cf64cd884b4dcc9416570/191:100/w_1280,c_limit/Denmark_google_GettyImages-1213059825.jpg"
        },
        {
          "id": "632c79038990652479ff398c",
          "author": "Caitlin Harrington",
          "description": "Elizabeth Warren and Cori Bush led over two dozen congressional Democrats in urging Amazon, Lyft, Uber, and others to reclassify contractors as employees.",
          "link": "https://www.wired.com/story/lawmakers-pressure-tech-companies-over-abortion-benefits-for-gig-workers/",
          "publishedOn": "2022-09-22T16:15:05.000Z",
          "wordCount": 19472,
          "title": "US Lawmakers Push Tech Firms on Abortion Benefits for Gig Workers",
          "imageUrl": "https://media.wired.com/photos/632ba9c640fe1e8870aa3b5c/191:100/w_1280,c_limit/Warren-Abortion-Gig-Employers-Business-1233338537.jpg"
        },
        {
          "id": "62fd21627072d2c1f58788c0",
          "author": "Steven Levy",
          "description": "Steve Case, founder of AOL, predicts the dominance of tech companies on the coasts will give way to a flourishing of startups from smaller cities.",
          "link": "https://www.wired.com/story/the-next-silicon-valley-will-be-in-the-us-heartlands/",
          "publishedOn": "2022-09-22T16:00:00.000Z",
          "wordCount": 23353,
          "title": "The Next Silicon Valley Will Be in the US Heartland",
          "imageUrl": "https://media.wired.com/photos/632ba570f2203b5586fabfec/191:100/w_1280,c_limit/Business-Next-Silicon-Valley-US-Heartlands-1399265458.jpg"
        },
        {
          "id": "6328f8e440fe1e8870aa3b4e",
          "author": "Jennifer Conrad",
          "description": "The EU’s chief antitrust enforcer Margrethe Vestager says that US tech companies are changing their behavior as global regulators question their dominance.",
          "link": "https://www.wired.com/story/the-us-and-eu-are-teaming-up-to-contain-big-tech/",
          "publishedOn": "2022-09-22T12:00:00.000Z",
          "wordCount": 21312,
          "title": "The US and EU are Teaming Up to Contain Big Tech",
          "imageUrl": "https://media.wired.com/photos/632b962cc4d3ebc9237bc67d/191:100/w_1280,c_limit/QA_biz_GettyImages-1232706719.jpg"
        },
        {
          "id": "6328b71020bc56769c413195",
          "author": "Aarian Marshall",
          "description": "Uber and Lyft spent millions promoting a controversial ballot measure. A new study suggests it has lowered driver wages.",
          "link": "https://www.wired.com/story/california-voted-for-cheaper-uber-rides-it-may-have-hurt-drivers/",
          "publishedOn": "2022-09-21T16:00:00.000Z",
          "wordCount": 21605,
          "title": "California Voted for Cheaper Uber Rides. It May Have Hurt Drivers",
          "imageUrl": "https://media.wired.com/photos/632a31898990652479ff393d/191:100/w_1280,c_limit/prop22-uber-lyft-biz-GettyImages-1167514356.jpg"
        },
        {
          "id": "632a4d3440fe1e8870aa3b57",
          "author": "William Ralston",
          "description": "A new study shows that cycling packages the final few miles to their recipients isn’t just greener than using a van, but often quicker too.",
          "link": "https://www.wired.com/story/cargo-bikes-greener-quicker/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 21227,
          "title": "It’s Time for Cities to Ditch Delivery Trucks—for Cargo Bikes",
          "imageUrl": "https://media.wired.com/photos/632ab26d00704d14b5ffb99d/191:100/w_1280,c_limit/Cargo-Bike-Delivery-Science-455162274.jpg"
        },
        {
          "id": "6328ed95977791160bfcd2ea",
          "author": "Will Knight",
          "description": "Artists are free to create fantasies or nightmares with unrestricted image generator Stable Diffusion, but some fear a flood of AI-made horrors.",
          "link": "https://www.wired.com/story/the-joy-and-dread-of-ai-image-generators-without-limits/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 22327,
          "title": "The Joy and Dread of AI Image Generators Without Limits",
          "imageUrl": "https://media.wired.com/photos/632a20908990652479ff393a/191:100/w_1280,c_limit/lede_Corruption-of-a-Dark-mage.jpg"
        },
        {
          "id": "6329c23beecde8c117e7f4ea",
          "author": "Peter Guest",
          "description": "The encrypted messaging app is a haven for politically motivated vitriol, but users are increasingly bringing threats to targets’ doorsteps.",
          "link": "https://www.wired.com/story/telegrams-doxing-problem/",
          "publishedOn": "2022-09-20T13:39:51.000Z",
          "wordCount": 21286,
          "title": "Telegram Has a Serious Doxing Problem",
          "imageUrl": "https://media.wired.com/photos/6329c23b00704d14b5ffb995/191:100/w_1280,c_limit/Doxing_telgram_biz_GettyImages-1173158197-(1).jpg"
        },
        {
          "id": "6328ff5574ce5b82a68ef2e9",
          "author": "Chris Baraniuk",
          "description": "From stamps and cash to passports and postboxes, the minting of the United Kingdom’s new royal iconography will take years.",
          "link": "https://www.wired.com/story/updating-british-royal-iconography/",
          "publishedOn": "2022-09-20T11:00:00.000Z",
          "wordCount": 21356,
          "title": "What Happens to Everything With Queen Elizabeth II’s Image?",
          "imageUrl": "https://media.wired.com/photos/6328ff5536c33c0247a2f0ac/191:100/w_1280,c_limit/queen_elizabeth_biz_GettyImages-163212621.jpg"
        }
      ]
    },
    {
      "title": "Feed: Artificial Intelligence Latest",
      "feedUrl": "https://www.wired.com/feed/tag/ai/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "6331df25977791160bfcd3a6",
          "author": "Khari Johnson",
          "description": "Younger people seek answers on TikTok and Instagram—Google hopes to lure them back with more visual, infinite scrolling search results.",
          "link": "https://www.wired.com/story/google-borrows-from-tiktok-to-keep-gen-z-searching/",
          "publishedOn": "2022-09-28T17:23:13.000Z",
          "wordCount": 19243,
          "title": "Google Borrows From TikTok to Keep Gen Z Searching",
          "imageUrl": "https://media.wired.com/photos/63339c7636c33c0247a2f108/191:100/w_1280,c_limit/Neighborhood-Vibe-Google-Search-Updates-Business.jpg"
        },
        {
          "id": "63332c6f40fe1e8870aa3bc3",
          "author": "Will Knight",
          "description": "The cutesy robot called Astro doesn’t do much now, but the company says it’s a step toward machines that understand your habits.",
          "link": "https://www.wired.com/story/amazon-wants-its-home-robot-astro-to-anticipate-your-every-need/",
          "publishedOn": "2022-09-28T16:45:00.000Z",
          "wordCount": 22749,
          "title": "Amazon Wants Its Home Robot to Anticipate Your Every Need",
          "imageUrl": "https://media.wired.com/photos/6333a06b74ce5b82a68ef382/191:100/w_1280,c_limit/Astro-Robot-Pet-Detection-Amazon-Business.jpg"
        },
        {
          "id": "632aefbdc9bb1af7ef249866",
          "author": "Caroline Sinders",
          "description": "Don’t judge a bot by the troll farms—some make the internet a weirder and more wonderful place.",
          "link": "https://www.wired.com/story/bots-twitter-art-social-media/",
          "publishedOn": "2022-09-28T11:00:00.000Z",
          "wordCount": 22917,
          "title": "I Love Twitter Bots and I Cannot Lie",
          "imageUrl": "https://media.wired.com/photos/632e24af62435d269fdbdbf2/191:100/w_1280,c_limit/Bot_Elon.jpg"
        },
        {
          "id": "63338f1d62435d269fdbdc3d",
          "author": "Matt Burgess",
          "description": "Pornhub is trialing a new automated tool that pushes CSAM-searchers to seek help for their online behavior. Will it work?",
          "link": "https://www.wired.com/story/pornhub-search-child-abuse-chatbot/",
          "publishedOn": "2022-09-28T06:00:00.000Z",
          "wordCount": 20755,
          "title": "This Chatbot Aims to Steer People Away From Child Abuse Material",
          "imageUrl": "https://media.wired.com/photos/63338f1d8990652479ff3a52/191:100/w_1280,c_limit/Pornhub-Chatbot-Security-GettyImages-888275148.png"
        },
        {
          "id": "632e4ebbf2203b5586fac020",
          "author": "Chris Stokel-Walker",
          "description": "Automated accounts are the target of ire and the linchpin of Elon Musk’s attempt to break his deal with the platform. But some are benign—or even helpful.",
          "link": "https://www.wired.com/story/twitter-bots-elon-musk-trial/",
          "publishedOn": "2022-09-26T11:00:00.000Z",
          "wordCount": 21364,
          "title": "Not All Bots Are Bad, and Twitter Knows It",
          "imageUrl": "https://media.wired.com/photos/632e4eba20bc56769c4131ed/191:100/w_1280,c_limit/Bot_GoodBot.jpg"
        },
        {
          "id": "6328ed95977791160bfcd2ea",
          "author": "Will Knight",
          "description": "Artists are free to create fantasies or nightmares with unrestricted image generator Stable Diffusion, but some fear a flood of AI-made horrors.",
          "link": "https://www.wired.com/story/the-joy-and-dread-of-ai-image-generators-without-limits/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 22327,
          "title": "The Joy and Dread of AI Image Generators Without Limits",
          "imageUrl": "https://media.wired.com/photos/632a20908990652479ff393a/191:100/w_1280,c_limit/lede_Corruption-of-a-Dark-mage.jpg"
        },
        {
          "id": "6320a9edc9bb1af7ef249735",
          "author": "Vittoria Elliott",
          "description": "The Russian blockade and bombardments are cutting off thousands of tons of grain, threatening the food supply in countries that rely on wheat exports.",
          "link": "https://www.wired.com/story/satellites-ukraine-russia-grain/",
          "publishedOn": "2022-09-15T18:53:09.000Z",
          "wordCount": 19320,
          "title": "Satellite Data Shows How Russia Has Destroyed Ukrainian Grain",
          "imageUrl": "https://media.wired.com/photos/632235fcc4d3ebc9237bc5c6/191:100/w_1280,c_limit/Satellite-Images-Reveal-Scale-of-Russian-Grain-Blockades-Business-1241878175.jpg"
        },
        {
          "id": "6315e68a44c07c3774c4cba0",
          "author": "Khari Johnson",
          "description": "The US regulator is eager to end unfair use of artificial intelligence and commercial surveillance, but experts remain skeptical.",
          "link": "https://www.wired.com/story/ftc-ai-regulation/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 21198,
          "title": "The FTC Is Closing in on Runaway AI",
          "imageUrl": "https://media.wired.com/photos/631a70b320bc56769c413043/191:100/w_1280,c_limit/business-ftc-ai.jpg"
        },
        {
          "id": "631134165d32e4cad34d6f3b",
          "author": "Amit Katwala",
          "description": "The Alphabet-backed AI firm is using virtual games to help its digital creations move more like humans.",
          "link": "https://www.wired.com/story/alphabet-deepmind-ai-humanoids-soccer-camp/",
          "publishedOn": "2022-09-02T11:00:00.000Z",
          "wordCount": 20849,
          "title": "Why DeepMind Is Sending AI Humanoids to Soccer Camp",
          "imageUrl": "https://media.wired.com/photos/631134163dfe1372fb611162/191:100/w_1280,c_limit/soccer_HZ_science_GettyImages-520264154.jpg"
        },
        {
          "id": "630506f9cea7c0581e825d21",
          "author": "Khari Johnson",
          "description": "The academic search engine’s policy on name changes is out of step with other search tools and publishers.",
          "link": "https://www.wired.com/story/trans-researchers-want-google-scholar-to-stop-deadnaming-them/",
          "publishedOn": "2022-09-01T11:00:00.000Z",
          "wordCount": 24085,
          "title": "Trans Researchers Want Google Scholar to Stop Deadnaming Them",
          "imageUrl": "https://media.wired.com/photos/630fe159567860ab6c66c667/191:100/w_1280,c_limit/business-deadnames-google.jpg"
        }
      ]
    },
    {
      "title": "Gear Latest",
      "feedUrl": "https://www.wired.com/feed/category/gear/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "63338e69977791160bfcd465",
          "author": "Gear Team",
          "description": "Yes, we saw the usual spate of Echo speakers, but there’s also a brand-new stylus-powered Kindle you can doodle on.",
          "link": "https://www.wired.com/story/everything-amazon-announced-september-2022/",
          "publishedOn": "2022-09-28T17:18:49.000Z",
          "wordCount": 25680,
          "title": "Everything Amazon Announced at Its Annual Hardware Event",
          "imageUrl": "https://media.wired.com/photos/633480871941bcb482834cf3/191:100/w_1280,c_limit/Everything-Amazon-Announced-Featured-Gear.jpg"
        },
        {
          "id": "5c9126abe48fae1a55ed4ea6",
          "author": "Medea Giordano",
          "description": "Here’s how Amazon’s ebook readers stack up—and which one might be right for you.",
          "link": "https://www.wired.com/gallery/best-kindle/",
          "publishedOn": "2022-09-28T14:00:00.000Z",
          "wordCount": 19975,
          "title": "The Best Kindles to Take Your Library Anywhere",
          "imageUrl": "https://media.wired.com/photos/61551589a28af156d45214f0/191:100/w_2580,c_limit/Gear-Amazon-Kindle-Paperwhite.jpg"
        },
        {
          "id": "632ca646036b54662b5105e6",
          "author": "Stephanie Pearson",
          "description": "Track your mileage, keep tabs on your heart rate, or map a ride from here to eternity with these handlebar-mounted cycling companions.",
          "link": "https://www.wired.com/gallery/bike-computers-buying-guide/",
          "publishedOn": "2022-09-28T13:00:00.000Z",
          "wordCount": 24083,
          "title": "The Best Bike Computers for Every Type of Cyclist",
          "imageUrl": "https://media.wired.com/photos/63335b0200704d14b5ffba0b/191:100/w_2580,c_limit/Best-Bike-Computers-Featured-Gear.jpg"
        },
        {
          "id": "632ce2f420bc56769c4131d3",
          "author": "Joe Ray",
          "description": "The Aarke Carbonator Pro is an excellent countertop pick for fizzy-water aficionados.",
          "link": "https://www.wired.com/review/aarke-carbonator-pro/",
          "publishedOn": "2022-09-28T12:00:00.000Z",
          "wordCount": 11851,
          "title": "This Soda Maker Is the Ultimate Sparkling Water Upgrade",
          "imageUrl": "https://media.wired.com/photos/63335cb0036b54662b510648/191:100/w_1280,c_limit/Aarke-Carbonator-Pro-Gear.jpg"
        },
        {
          "id": "63243c17036b54662b510564",
          "author": "Simon Hill",
          "description": "E-waste, conflict minerals, and poor labor conditions are just a few issues blighting the tech industry. Here's how to shop more sustainably.",
          "link": "https://www.wired.com/story/how-to-buy-ethical-and-eco-friendly-electronics/",
          "publishedOn": "2022-09-28T11:00:00.000Z",
          "wordCount": 22647,
          "title": "How to Buy Ethical and Eco-Friendly Electronics",
          "imageUrl": "https://media.wired.com/photos/63338ed940fe1e8870aa3bc7/191:100/w_1280,c_limit/How-to-Shop-Eco-Friendly-Gear-GettyImages-1297576738.png"
        },
        {
          "id": "6333050620bc56769c4131f4",
          "author": "Julian Chokkattu",
          "description": "Whether you’re typing from coffee shops or a hybrid work setup, you need a screen you can grab and go.",
          "link": "https://www.wired.com/story/portable-oled-monitor-sale-september-2022/",
          "publishedOn": "2022-09-27T16:49:35.000Z",
          "wordCount": 18467,
          "title": "This 15-Inch Portable OLED Monitor Is on Sale Right Now",
          "imageUrl": "https://media.wired.com/photos/63331ad0c4d3ebc9237bc76d/191:100/w_1280,c_limit/Innocn-Portable-OLED-Monitor-SOURCE-Innocn_gear.jpg"
        },
        {
          "id": "632c54fb20bc56769c4131bf",
          "author": "Jeremy White",
          "description": "It's a great handset, but the improvements are so iterative that most of you will hardly notice what's new.",
          "link": "https://www.wired.com/review/apple-iphone-14/",
          "publishedOn": "2022-09-27T14:36:00.000Z",
          "wordCount": 16473,
          "title": "You'll Need a Magnifying Glass to Find the iPhone 14's Upgrades",
          "imageUrl": "https://media.wired.com/photos/6332360740fe1e8870aa3bc0/191:100/w_1280,c_limit/iPhone-14-Review-Gear.jpg"
        },
        {
          "id": "5a9720a9086151385ac8524e",
          "author": "Parker Hall",
          "description": "Chatty assistants from Amazon, Apple, and Google are popular. But which one is right for you?",
          "link": "https://www.wired.com/story/best-smart-speakers/",
          "publishedOn": "2022-09-27T14:00:00.000Z",
          "wordCount": 27145,
          "title": "The Best Smart Speakers With Voice Assistants",
          "imageUrl": "https://media.wired.com/photos/5cc32089c6a1822e416ba407/191:100/w_1280,c_limit/Smart-Speakers-Guide-Top-Art-WIRED.jpg"
        },
        {
          "id": "5f5fd35f470e71528f4f882b",
          "author": "Medea Giordano",
          "description": "Aunt Flo doesn’t have to suck (that much). These menstrual cups, absorbent underwear, and reusable pads are ecofriendly and comfortable.",
          "link": "https://www.wired.com/story/best-menstrual-products/",
          "publishedOn": "2022-09-27T13:00:00.000Z",
          "wordCount": 30970,
          "title": "The Best Period Products",
          "imageUrl": "https://media.wired.com/photos/61e0c6d8418ddba38e293c55/191:100/w_1280,c_limit/Gear-Knix-Highrise-Sweet-Fig-front-SOURCE-Knix.jpg"
        },
        {
          "id": "5dbc37c9774e4900082099bf",
          "author": "Scott Gilbertson, Jaina Grey",
          "description": "Whether you prefer an AeroPress or a French press, we’ve found the best ways to make a great cup of joe anywhere.",
          "link": "https://www.wired.com/gallery/best-portable-coffee-makers/",
          "publishedOn": "2022-09-27T12:00:00.000Z",
          "wordCount": 21989,
          "title": "The Best Portable Coffee Makers",
          "imageUrl": "https://media.wired.com/photos/5deaa7e00be1890009364e99/191:100/w_2580,c_limit/Gear-Primula-Moka-Pot-SOURCE-Amazon.jpg"
        },
        {
          "id": "6323876af1e5c40d2b1bc653",
          "author": "Omar L. Gallaga",
          "description": "Want to speak up against Big Tech, unjust data collection, and surveillance? Here's how to be an activist in your community and beyond.",
          "link": "https://www.wired.com/story/how-to-advocate-your-tech-privacy/",
          "publishedOn": "2022-09-27T12:00:00.000Z",
          "wordCount": 19309,
          "title": "How to Advocate for Data Privacy and Users' Rights",
          "imageUrl": "https://media.wired.com/photos/6332328740fe1e8870aa3bbe/191:100/w_1280,c_limit/Advocate-for-Online-Privacy-Gear-GettyImages-1248994811.jpg"
        },
        {
          "id": "5e456c576fd0760009425826",
          "author": "Scott Gilbertson",
          "description": "It won’t solve all of your privacy problems, but a virtual private network can make you a less tempting target for hackers.",
          "link": "https://www.wired.com/story/best-vpn/",
          "publishedOn": "2022-09-26T13:00:00.000Z",
          "wordCount": 26495,
          "title": "The Best VPNs to Protect Yourself Online",
          "imageUrl": "https://media.wired.com/photos/5e586f50ffd9380009895d8d/191:100/w_1280,c_limit/feature_art-best_vpn.jpg"
        },
        {
          "id": "5df1238e4a6a5900092a0c89",
          "author": "Parker Hall",
          "description": "We’ve rounded up our favorites, including third-party devices like the Sonos Roam and a voice-enabled Yamaha soundbar.",
          "link": "https://www.wired.com/gallery/best-alexa-and-amazon-echo-speakers/",
          "publishedOn": "2022-09-26T13:00:00.000Z",
          "wordCount": 20817,
          "title": "Which Amazon Echo or Alexa Speaker Is Best for You?",
          "imageUrl": "https://media.wired.com/photos/5e20f2a09fdee10008c4ce6d/191:100/w_2580,c_limit/Gear-Amazon-Echo-Studio-SOURCE-Amazon.jpg"
        },
        {
          "id": "6318a8cc40fe1e8870aa39b1",
          "author": "Medea Giordano",
          "description": "Cleaning sucks. The Lupe Pure makes it a little easier and has replaceable parts in case they ever break.",
          "link": "https://www.wired.com/review/lupe-pure-cordless-vacuum/",
          "publishedOn": "2022-09-26T12:00:00.000Z",
          "wordCount": 13277,
          "title": "I Like This Cordless Vacuum More Than Most Stick Vacs",
          "imageUrl": "https://media.wired.com/photos/632e143336c33c0247a2f0f2/191:100/w_1280,c_limit/Lupe-Cordless-Vacuum-Featured-Gear.jpg"
        },
        {
          "id": "632e550f00704d14b5ffb9bf",
          "author": "Chris Stokel-Walker",
          "description": "Vollebak believes its thermal camouflage jacket with graphene proves that invisibility could happen in the future.",
          "link": "https://www.wired.com/story/vollebak-invisibility-cloak/",
          "publishedOn": "2022-09-26T11:00:00.000Z",
          "wordCount": 22124,
          "title": "This Company Says It’s One Step Closer to an Invisibility Cloak",
          "imageUrl": "https://media.wired.com/photos/632e550c36c33c0247a2f0f6/191:100/w_1280,c_limit/Invisibility-Cloak-Featured-Gear.jpg"
        },
        {
          "id": "5f0f5970012dd1e0a3b492ab",
          "author": "Scott Gilbertson",
          "description": "Backups are boring, but they’ll save your bacon. Here’s how to make sure your data lives on, even when your PC doesn’t.",
          "link": "https://www.wired.com/story/how-to-back-up-your-digital-life/",
          "publishedOn": "2022-09-25T13:00:00.000Z",
          "wordCount": 23490,
          "title": "How to Back Up Your Digital Life",
          "imageUrl": "https://media.wired.com/photos/62312e348c5ef7962d4053ce/191:100/w_1280,c_limit/How-To-Back-Up-Your-Digital-Life-Gear-1068111110.jpg"
        },
        {
          "id": "6317ca0a62435d269fdbda6e",
          "author": "Justin Pot",
          "description": "Joined a new community and discovered—to your horror—that there are no party parrots? Let's fix that.",
          "link": "https://www.wired.com/story/how-to-upload-custom-emoji-slack/",
          "publishedOn": "2022-09-25T12:00:00.000Z",
          "wordCount": 17755,
          "title": "How to Upload Custom Emoji in Slack",
          "imageUrl": "https://media.wired.com/photos/632e1a82f2203b5586fac01b/191:100/w_1280,c_limit/How-to-Bulk-Load-Emoji-Slack-Gear-Alamy-2G1B158.jpg"
        },
        {
          "id": "5ec4483c2c63f8293fcb906b",
          "author": "Simon Hill",
          "description": "Everything you need to know to successfully transfer your contacts, music, photos, and apps from one iOS device to another.",
          "link": "https://www.wired.com/story/how-to-switch-iphones-or-ipad/",
          "publishedOn": "2022-09-25T12:00:00.000Z",
          "wordCount": 21902,
          "title": "How to Switch iPhones Without Losing a Thing",
          "imageUrl": "https://media.wired.com/photos/632e0ee5d884b4dcc9416575/191:100/w_1280,c_limit/How-to-Switch-iPhones-2022-Gear-GettyImages-1236366611.jpg"
        },
        {
          "id": "62f3de3d54d910713ee4f254",
          "author": "Eric Ravenscraft",
          "description": "I never knew what these charging blocks were for until my Nintendo Switch started to die in the living room.",
          "link": "https://www.wired.com/story/a-little-power-cube/",
          "publishedOn": "2022-09-25T11:00:00.000Z",
          "wordCount": 18979,
          "title": "Put a Little Power Cube Under Your Couch",
          "imageUrl": "https://media.wired.com/photos/632e0bc620bc56769c4131dd/191:100/w_1280,c_limit/Put-a-Power-Cube-Under-Your-Couch-SOURCE-Anker-Gear.jpg"
        },
        {
          "id": "63124126a4a22698f6d24ab0",
          "author": "David Nield",
          "description": "You don’t have to pay full price for downloads, subscriptions, or even in-app purchases. Here’s how.",
          "link": "https://www.wired.com/story/how-to-save-money-on-apps/",
          "publishedOn": "2022-09-25T11:00:00.000Z",
          "wordCount": 18777,
          "title": "How to Save Money on the Apps You Use",
          "imageUrl": "https://media.wired.com/photos/632e1e7ac4d3ebc9237bc69a/191:100/w_1280,c_limit/Save-Money-on-Apps-Gear-GettyImages-1363978377.jpg"
        }
      ]
    },
    {
      "title": "Ideas Latest",
      "feedUrl": "https://www.wired.com/feed/category/ideas/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "632db7bff2203b5586fac00d",
          "author": "Yasmin Green",
          "description": "Nobody likes being asked to wait, but recent political history has shown that a completely frictionless internet has its own dangers.",
          "link": "https://www.wired.com/story/friction-social-media-moderation/",
          "publishedOn": "2022-09-28T12:00:00.000Z",
          "wordCount": 20043,
          "title": "Tech Companies Are Reconsidering an Old Enemy",
          "imageUrl": "https://media.wired.com/photos/6333bc0cc4d3ebc9237bc776/191:100/w_1280,c_limit/tech-reconsidering-friction.jpg"
        },
        {
          "id": "632aefbdc9bb1af7ef249866",
          "author": "Caroline Sinders",
          "description": "Don’t judge a bot by the troll farms—some make the internet a weirder and more wonderful place.",
          "link": "https://www.wired.com/story/bots-twitter-art-social-media/",
          "publishedOn": "2022-09-28T11:00:00.000Z",
          "wordCount": 22917,
          "title": "I Love Twitter Bots and I Cannot Lie",
          "imageUrl": "https://media.wired.com/photos/632e24af62435d269fdbdbf2/191:100/w_1280,c_limit/Bot_Elon.jpg"
        },
        {
          "id": "63221a4d036b54662b5104d5",
          "author": "Fadeke Adegbuyi",
          "description": "“Overemployment” sounds like more of the same old grind, but its underlying philosophy is critical of work.",
          "link": "https://www.wired.com/story/overemployment-work/",
          "publishedOn": "2022-09-27T13:00:00.000Z",
          "wordCount": 23070,
          "title": "The Unlikely Cure for Burnout? A Second Job",
          "imageUrl": "https://media.wired.com/photos/63323e8feecde8c117e7f61f/191:100/w_1280,c_limit/burnout-second-job.jpg"
        },
        {
          "id": "6328a9f4d884b4dcc941652d",
          "author": "Eleanor Cummins",
          "description": "Everyone is telling one another to “get help,” but few acknowledge that the practice is often flawed.",
          "link": "https://www.wired.com/story/therapy-broken-mental-health-challenges/",
          "publishedOn": "2022-09-26T12:00:00.000Z",
          "wordCount": 24041,
          "title": "Why Therapy Is Broken",
          "imageUrl": "https://media.wired.com/photos/632c983862435d269fdbdbe3/191:100/w_1280,c_limit/therapy-flawed.jpg"
        },
        {
          "id": "632a559feecde8c117e7f4f0",
          "author": "Helena Fitzgerald",
          "description": "Millennials, the first generation to be online as kids, are starting to feel like we’ve aged out. Is there a way to age gracefully on the internet?",
          "link": "https://www.wired.com/story/growing-old-online/",
          "publishedOn": "2022-09-25T13:00:00.000Z",
          "wordCount": 29874,
          "title": "Growing Old Online",
          "imageUrl": "https://media.wired.com/photos/632e4cf720bc56769c4131ec/191:100/w_1280,c_limit/aging-online.jpg"
        },
        {
          "id": "632b3054d884b4dcc941655d",
          "author": "Albert Fox Cahn",
          "description": "When “if you see something, say something” becomes “we see everything,” everyone loses.",
          "link": "https://www.wired.com/story/the-surveillance-solutionism-of-putting-cameras-in-nyc-subways/",
          "publishedOn": "2022-09-22T12:00:00.000Z",
          "wordCount": 19633,
          "title": "The ‘Surveillance Solutionism’ of Putting Cameras in NYC Subways",
          "imageUrl": "https://media.wired.com/photos/632bad8e36c33c0247a2f0be/191:100/w_1280,c_limit/cameras-nyc-subway.jpg"
        },
        {
          "id": "6328bee136c33c0247a2f0ab",
          "author": "WIRED Ideas",
          "description": "Many associate the “America First” movement with Trump, but its origins—and rebirth—are more complicated.",
          "link": "https://www.wired.com/story/america-first-meme-politics/",
          "publishedOn": "2022-09-21T12:00:00.000Z",
          "wordCount": 23449,
          "title": "This Dangerous Meme in US Politics Is Over a Century Old",
          "imageUrl": "https://media.wired.com/photos/632a55bc3c360bac53306190/191:100/w_1280,c_limit/dangerous-meme-america-first.jpg"
        },
        {
          "id": "63288cb640fe1e8870aa3b0e",
          "author": "Adrian Hon",
          "description": "What do puzzles, video games, and conspiracy theories have in common?",
          "link": "https://www.wired.com/story/qanon-games-alternate-reality-conspiracy-theories/",
          "publishedOn": "2022-09-20T12:00:00.000Z",
          "wordCount": 24577,
          "title": "Games, Mysteries, and the Lure of QAnon",
          "imageUrl": "https://media.wired.com/photos/63291007c9bb1af7ef24985e/191:100/w_1280,c_limit/games-mysteries-qanon.jpg"
        },
        {
          "id": "630fa634333af8e1504c49a1",
          "author": "Paul Ford",
          "description": "Retrocomputing is about more than nostalgic nerdery. It’s also a way to keep your tech in perspective.",
          "link": "https://www.wired.com/story/modern-humans-learn-ancient-software-retrocomputing/",
          "publishedOn": "2022-09-15T13:00:00.000Z",
          "wordCount": 19699,
          "title": "What Modern Humans Can Learn From Ancient Software",
          "imageUrl": "https://media.wired.com/photos/630fa99379f10149f7bb9e38/191:100/w_1280,c_limit/WI100122_ST_Ford_01.jpg"
        },
        {
          "id": "63208fea20bc56769c4130dc",
          "author": "Matt Perault",
          "description": "New privacy and expression laws that vary state to state will be a nightmare for platforms, and for users’ rights.",
          "link": "https://www.wired.com/story/the-end-of-roe-will-spark-a-digital-civil-war/",
          "publishedOn": "2022-09-14T12:00:00.000Z",
          "wordCount": 20384,
          "title": "The End of Roe Will Spark a Digital Civil War",
          "imageUrl": "https://media.wired.com/photos/63212a43c9bb1af7ef2497c0/191:100/w_1280,c_limit/roe-digital-civil-war.jpg"
        },
        {
          "id": "630fb1b9dbc9ebd1c95a7469",
          "author": "Virginia Heffernan",
          "description": "When TV came online in the aughts, it was exciting. Then Facebook took over.",
          "link": "https://www.wired.com/story/i-want-the-internet-tv-we-were-all-promised/",
          "publishedOn": "2022-09-13T13:00:00.000Z",
          "wordCount": 19613,
          "title": "The Vast Wasteland of Internet Television",
          "imageUrl": "https://media.wired.com/photos/631f6121f1e5c40d2b1bc632/191:100/w_1280,c_limit/Heffernan_TV_Internet_Backchannel_IMG_3692_horizontal.jpg"
        },
        {
          "id": "630f9ec45d32e4cad34d6f24",
          "author": "Meghan O'Gieblyn",
          "description": "WIRED’s spiritual advice columnist reassures a literary reader that it’s OK to communicate with images.",
          "link": "https://www.wired.com/story/am-i-wrong-to-judge-talking-in-emoji/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 21758,
          "title": "Am I Wrong to Judge People for Talking to Me in Emoji?",
          "imageUrl": "https://media.wired.com/photos/630fa20cf89e2120665181db/191:100/w_1280,c_limit/WI100122_ST_CloudSupport_LO_01.jpg"
        },
        {
          "id": "62fd1fe9b07577beee1be7f9",
          "author": "Charlotte Kent",
          "description": "Jennifer Lyn Morone became a corporation in hopes of protecting her data privacy. Her experience shows the downfalls of treating data like property.",
          "link": "https://www.wired.com/story/art-data-property-roe/",
          "publishedOn": "2022-09-08T13:00:00.000Z",
          "wordCount": 25750,
          "title": "The Woman Who Became a Company Has Lessons for a Post-Roe World",
          "imageUrl": "https://media.wired.com/photos/63192414977791160bfcd0ac/191:100/w_1280,c_limit/woman-became-company.jpg"
        },
        {
          "id": "6303a03afd602ff2f11e6ffa",
          "author": "Erica Berry",
          "description": "Tech dependence is following many students back to school—but waging a war against devices helps no one.",
          "link": "https://www.wired.com/story/cell-phone-bans-school/",
          "publishedOn": "2022-09-07T11:00:00.000Z",
          "wordCount": 24458,
          "title": "Banning Phones in Class? Not So Fast",
          "imageUrl": "https://media.wired.com/photos/6317e88a00704d14b5ffb7ca/191:100/w_1280,c_limit/phones-in-class.jpg"
        },
        {
          "id": "6306003d1814a994d3a63460",
          "author": "Katherine Cross",
          "description": "Telling people to quit the platform is less effective than stopping influential elites from using the site in harmful ways.",
          "link": "https://www.wired.com/story/twitter-democracy-harm-reduction/",
          "publishedOn": "2022-09-06T13:00:00.000Z",
          "wordCount": 25670,
          "title": "So, You Want Twitter to Stop Destroying Democracy",
          "imageUrl": "https://media.wired.com/photos/631296005d32e4cad34d6f9b/191:100/w_1280,c_limit/twitter-stop-destroying-democracy.jpg"
        },
        {
          "id": "63122b60a4a22698f6d24aae",
          "author": "Kate Knibbs",
          "description": "It’s more than an unproven medical treatment—it’s a view into the antiabortion movement’s larger project.",
          "link": "https://www.wired.com/story/abortion-pill-reversal-essay/",
          "publishedOn": "2022-09-05T13:00:00.000Z",
          "wordCount": 27694,
          "title": "What Abortion Pill ‘Reversal’ Really Accomplishes",
          "imageUrl": "https://media.wired.com/photos/631276b8a4a22698f6d24aba/191:100/w_1280,c_limit/abortion-pill-reversal.jpg"
        },
        {
          "id": "630629f0fd602ff2f11e70a4",
          "author": "Jennifer Conrad",
          "description": "Johns Hopkins' long history with student-spies suggests this most recent incident will not lead to much change—but maybe that's OK.",
          "link": "https://www.wired.com/story/national-security-spies-johns-hopkins/",
          "publishedOn": "2022-09-01T12:00:00.000Z",
          "wordCount": 25310,
          "title": "The Russian Spy in My Econ Class",
          "imageUrl": "https://media.wired.com/photos/63100b03f89e2120665181e1/191:100/w_1280,c_limit/russian-spy-econ-class.jpg"
        },
        {
          "id": "630e23a9567860ab6c66c659",
          "author": "Justin Sherman",
          "description": "The agency’s lawsuit against Kochava should squash the industry’s core defense—and help keep sensitive info off the open market.",
          "link": "https://www.wired.com/story/the-ftc-may-finally-protect-americans-from-data-brokers/",
          "publishedOn": "2022-08-31T12:00:00.000Z",
          "wordCount": 19853,
          "title": "The FTC May (Finally) Protect Americans From Data Brokers",
          "imageUrl": "https://media.wired.com/photos/630ec0bb9fbbe8d3536bfa07/191:100/w_1280,c_limit/ftc-data-brokers.jpg"
        }
      ]
    },
    {
      "title": "Science Latest",
      "feedUrl": "https://www.wired.com/feed/category/science/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "6334cb28a546819a4885f450",
          "author": "Gregory Barber",
          "description": "At RE:WIRED Green, technologists, hackers, and activists explained how green tech must be combined with bold policy and bring people together.",
          "link": "https://www.wired.com/story/rewired-2022-technology-climate-justice-community-policy/",
          "publishedOn": "2022-09-29T04:06:08.000Z",
          "wordCount": 19511,
          "title": "Climate Justice Is Possible—Just Look Beyond Technology",
          "imageUrl": "https://media.wired.com/photos/63350edbdd4bc612fd8df15e/191:100/w_1280,c_limit/Jim-McBride-RE-WIRED-Green-2022-Science.jpg"
        },
        {
          "id": "6334d8e1e0fe4cc825d3a4d1",
          "author": "Max G. Levy",
          "description": "At this year’s RE:WIRED Green event, food scientists and environmental justice activists mapped out how we can end world hunger and preserve our planet.",
          "link": "https://www.wired.com/story/rewired-2022-food-insecurity-sustainability/",
          "publishedOn": "2022-09-29T03:08:00.000Z",
          "wordCount": 20346,
          "title": "The Sustainable Future of Food Must Bring Everyone to the Table",
          "imageUrl": "https://media.wired.com/photos/63350767c554667379f2da38/191:100/w_1280,c_limit/Sandra-Upson-Isha-Datar-Magi-Richani-Beth-Zotter-RE-WIRED-2022-Science.jpg"
        },
        {
          "id": "6334ba05ae9b082f81054142",
          "author": "Justin Pot",
          "description": "During the first session of Re:WIRED GREEN, experts laid out their vision for maintaining hope in the face of unprecedented challenges to our planet.",
          "link": "https://www.wired.com/story/rewired-2022-climate-action-hope/",
          "publishedOn": "2022-09-29T00:39:14.000Z",
          "wordCount": 21354,
          "title": "‘We Are the Asteroid’: The Case for Hope Amid Climate Fears",
          "imageUrl": "https://media.wired.com/photos/6334d71ea546819a4885f452/191:100/w_1280,c_limit/Kenneth-Lacovara-RE-WIRED-2022-Overview-Science.jpg"
        },
        {
          "id": "63322dc036c33c0247a2f101",
          "author": "Alan Henry",
          "description": "Our San Francisco event brings together scientists, entrepreneurs, and more to spotlight ways that human ingenuity can save the planet.",
          "link": "https://www.wired.com/story/re-wired-green-2022/",
          "publishedOn": "2022-09-28T11:00:00.000Z",
          "wordCount": 22508,
          "title": "At RE:WIRED Green, We’re Innovating to Fight the Climate Crisis",
          "imageUrl": "https://media.wired.com/photos/6334b08fac1e13577068c07f/191:100/w_1280,c_limit/RE-WIRED-GREEN-2022.jpg"
        },
        {
          "id": "63330e4bcf619ab4a0433bfd",
          "author": "Maryn McKenna",
          "description": "Everyone wants to be done with Covid. But no single milestone will signal the end of the virus.",
          "link": "https://www.wired.com/story/when-will-the-pandemic-truly-be-over/",
          "publishedOn": "2022-09-28T11:00:00.000Z",
          "wordCount": 20488,
          "title": "When Will the Pandemic Truly Be ‘Over’?",
          "imageUrl": "https://media.wired.com/photos/63337f96995b6da54b57f051/191:100/w_1280,c_limit/pandemic_over_science_GettyImages-1407190435-(1).jpg"
        },
        {
          "id": "6329044e40fe1e8870aa3b4f",
          "author": "Gregory Barber",
          "description": "As the Supreme Court considers the fate of American wetlands, Annie Proulx’s Fen, Bog, and Swamp offers an elegiac love letter to overlooked ecosystems.",
          "link": "https://www.wired.com/story/what-is-a-wetland-worth/",
          "publishedOn": "2022-09-27T11:00:00.000Z",
          "wordCount": 25790,
          "title": "What Is a Wetland Worth?",
          "imageUrl": "https://media.wired.com/photos/63320dbfeecde8c117e7f5e1/191:100/w_1280,c_limit/wetland_science_GettyImages-1231291458.jpg"
        },
        {
          "id": "632b67a7036b54662b5105e0",
          "author": "Cody Cassidy",
          "description": "How a Dutch fabric seller made the most powerful magnifying lens of his time—and of the next 150 years—and became the first person ever to see a microorganism.",
          "link": "https://www.wired.com/story/secret-microscope-sparked-scientific-revolution/",
          "publishedOn": "2022-09-27T10:00:00.000Z",
          "wordCount": 28988,
          "title": "The Secret Microscope That Sparked a Scientific Revolution",
          "imageUrl": "https://media.wired.com/photos/632e3b6d903a8608f4dcb743/191:100/w_1280,c_limit/backchannel_microscope.jpg"
        },
        {
          "id": "632a013eeecde8c117e7f4ed",
          "author": "Ramin Skibba",
          "description": "The mission was designed to test whether a probe could knock a hazardous space rock away from a crash course with Earth.",
          "link": "https://www.wired.com/story/nasas-dart-spacecraft-smashes-into-an-asteroid-on-purpose/",
          "publishedOn": "2022-09-26T23:28:58.000Z",
          "wordCount": 22311,
          "title": "NASA’s DART Spacecraft Smashes Into an Asteroid—on Purpose",
          "imageUrl": "https://media.wired.com/photos/63324d5ac9bb1af7ef2498cd/191:100/w_1280,c_limit/Dimorphos-Science.jpg"
        },
        {
          "id": "632b8de2c4d3ebc9237bc67b",
          "author": "Ramin Skibba",
          "description": "Bad weather forced a third delay for the space agency’s SLS rocket plans—another setback for the uncrewed back-to-the-moon mission.",
          "link": "https://www.wired.com/story/hurricane-ian-blows-back-nasas-artemis-launch/",
          "publishedOn": "2022-09-26T19:15:14.000Z",
          "wordCount": 18730,
          "title": "Hurricane Ian Blows Back NASA’s Artemis Launch",
          "imageUrl": "https://media.wired.com/photos/6331c4fb036b54662b510639/191:100/w_1280,c_limit/Artemis_delay_Science_GettyImages-1243484045.jpg"
        },
        {
          "id": "632e463c977791160bfcd39d",
          "author": "Victoria Turk",
          "description": "Phages may help fight drug-resistant infections—but finding the right ones for each bacterium is no mean feat.",
          "link": "https://www.wired.com/story/phage-viruses-fighting-drug-resistant-bacteria/",
          "publishedOn": "2022-09-26T11:00:00.000Z",
          "wordCount": 27437,
          "title": "Viruses to Fight Superbugs? Scientists Are Working on It",
          "imageUrl": "https://media.wired.com/photos/632e463cd884b4dcc941657a/191:100/w_1280,c_limit/Superbugs_Phages_science_ScienceSource_SS2477568.jpg"
        },
        {
          "id": "6328b2df995b6da54b57ef8c",
          "author": "Ben Brubaker",
          "description": "Physicists have solved a key problem of robotic locomotion by revising the usual rules of interaction between simple component parts.",
          "link": "https://www.wired.com/story/a-wheel-made-of-odd-matter-spontaneously-rolls-uphill/",
          "publishedOn": "2022-09-25T12:00:00.000Z",
          "wordCount": 24524,
          "title": "A Wheel Made of ‘Odd Matter’ Spontaneously Rolls Uphill",
          "imageUrl": "https://media.wired.com/photos/632e2a6540fe1e8870aa3bad/191:100/w_1280,c_limit/quanta_Odd-wheels-2880x1620_Lede.jpg"
        },
        {
          "id": "6328b09e995b6da54b57ef8b",
          "author": "Jack Tamisiea",
          "description": "A cache of phytoplankton at the Academy of Natural Sciences of Drexel University is helping researchers reconstruct historical coastlines.",
          "link": "https://www.wired.com/story/philadelphias-diatom-archive-is-a-way-way-wayback-machine/",
          "publishedOn": "2022-09-24T12:00:00.000Z",
          "wordCount": 25457,
          "title": "Philadelphia’s Diatom Archive Is a Way, Way, Wayback Machine",
          "imageUrl": "https://media.wired.com/photos/632e2876d884b4dcc9416577/191:100/w_1280,c_limit/CLimateDesk_Science_microscopy-diatom-archive.jpg"
        },
        {
          "id": "631a40d4995b6da54b57ee1e",
          "author": "Carol Milberger",
          "description": "Worries about polio, monkeypox, and Covid-19 are rising. Here’s how to gather your health information, even if you’ve lost the paper records.",
          "link": "https://www.wired.com/story/how-to-find-vaccine-history-store-it-safely/",
          "publishedOn": "2022-09-24T11:00:00.000Z",
          "wordCount": 21488,
          "title": "How to Find Your Vaccine History—and Store It Safely",
          "imageUrl": "https://media.wired.com/photos/632e170df2203b5586fac019/191:100/w_1280,c_limit/vaccine_history_science_GettyImages-1230181903.jpg"
        },
        {
          "id": "631bae99d884b4dcc94164e1",
          "author": "Rhett Allain",
          "description": "If you want to attain high speeds without getting airborne, it helps to know a little something about friction.",
          "link": "https://www.wired.com/story/the-physics-of-going-fast-but-not-too-fast-on-a-giant-slide/",
          "publishedOn": "2022-09-23T13:00:00.000Z",
          "wordCount": 25024,
          "title": "The Physics of Going Fast—but Not Too Fast—on a Giant Slide",
          "imageUrl": "https://media.wired.com/photos/632c9d0c00704d14b5ffb9a9/191:100/w_1280,c_limit/friction_slide_Science_GettyImages-1272469804-(1).jpg"
        },
        {
          "id": "632ccb63d884b4dcc941656f",
          "author": "Jonathan O'Callaghan",
          "description": "Virgin Orbit will launch satellites from the country for the first time, bringing orbital flight capability to Europe.",
          "link": "https://www.wired.com/story/first-british-satellite-launch/",
          "publishedOn": "2022-09-23T11:00:00.000Z",
          "wordCount": 21084,
          "title": "The UK Is Rejoining the Space Race",
          "imageUrl": "https://media.wired.com/photos/632ccb6236c33c0247a2f0c3/191:100/w_1280,c_limit/Virgin-Orbit-87_science.jpg"
        },
        {
          "id": "632cddeea8bb66572c8c044e",
          "author": "Charlie Metcalfe",
          "description": "An ambitious cable project aims to power thousands of homes with renewable energy by 2030.",
          "link": "https://www.wired.com/story/the-uks-wild-plan-to-use-a-giant-cable-to-catch-sun-from-the-sahara/",
          "publishedOn": "2022-09-23T11:00:00.000Z",
          "wordCount": 20989,
          "title": "The Wild Plan to Export Sun From the Sahara to the UK",
          "imageUrl": "https://media.wired.com/photos/632cddee977791160bfcd393/191:100/w_1280,c_limit/Grid_UK_Biz_GettyImages-1368441144.jpg"
        },
        {
          "id": "632a125774ce5b82a68ef2f9",
          "author": "Emily Mullin",
          "description": "The technique had largely been limited to editing patients’ cells in the lab. New research shows promise for treating diseases more directly.",
          "link": "https://www.wired.com/story/theres-new-proof-crispr-can-edit-genes-inside-human-bodies/",
          "publishedOn": "2022-09-22T13:00:00.000Z",
          "wordCount": 19945,
          "title": "There’s New Proof Crispr Can Edit Genes Inside Human Bodies",
          "imageUrl": "https://media.wired.com/photos/632b96bef1e5c40d2b1bc708/191:100/w_1280,c_limit/dna_crispr_science_GettyImages-498187798.jpg"
        },
        {
          "id": "6329fa9874ce5b82a68ef2f8",
          "author": "Matt Simon",
          "description": "Meticulous turf is environmentally terrible. Yet grass does have one charm: It “sweats,” helping cool the local area.",
          "link": "https://www.wired.com/story/lawns-are-dumb-but-ripping-them-out-may-come-with-a-catch/",
          "publishedOn": "2022-09-22T12:00:00.000Z",
          "wordCount": 20573,
          "title": "Lawns Are Dumb. But Ripping Them Out May Come With a Catch",
          "imageUrl": "https://media.wired.com/photos/632b9524c9bb1af7ef24986e/191:100/w_1280,c_limit/lawn_science_GettyImages-557383651.jpg"
        },
        {
          "id": "632b748b8990652479ff394a",
          "author": "April Reese",
          "description": "Extreme temperatures are the direct result of climate change, which means more intense heat events, wildfires, and droughts to come.",
          "link": "https://www.wired.com/story/europe-heat-wave-limits/",
          "publishedOn": "2022-09-22T11:00:00.000Z",
          "wordCount": 20782,
          "title": "Europe’s Heat Waves Offer a Grim Vision of the Future",
          "imageUrl": "https://media.wired.com/photos/632b748b74ce5b82a68ef31b/191:100/w_1280,c_limit/Spain_Wildfire_Science_GettyImages-1409603369.jpg"
        },
        {
          "id": "631f7fcfd884b4dcc94164f3",
          "author": "Ruha Benjamin",
          "description": "As a young Black woman, I saw my pregnancy treated like a problem. So I ditched the doctors for home delivery and found an alternative model for health care.",
          "link": "https://www.wired.com/story/ruha-benjamin-pregnancy-black-maternal-mortality/",
          "publishedOn": "2022-09-22T10:00:00.000Z",
          "wordCount": 30991,
          "title": "A Better Birth Is Possible",
          "imageUrl": "https://media.wired.com/photos/632a2e6f74ce5b82a68ef2fd/191:100/w_1280,c_limit/Backchannel_Alanna-Fields_RuhaBenjamin.jpg"
        }
      ]
    },
    {
      "title": "Security Latest",
      "feedUrl": "https://www.wired.com/feed/category/security/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "6334a719dd4bc612fd8df151",
          "author": "Matt Burgess",
          "description": "Damage to the pipeline that runs between Russia and Germany is being treated as deliberate. Finding out what happened may not be straightforward.",
          "link": "https://www.wired.com/story/nord-stream-pipeline-sabotage-explosion-russia-gas/",
          "publishedOn": "2022-09-28T20:00:26.000Z",
          "wordCount": 20891,
          "title": "The Race to Find the Nord Stream Saboteurs",
          "imageUrl": "https://media.wired.com/photos/6334a71977d6e939e5938aa4/191:100/w_1280,c_limit/GasLeak_Science_GettyImages-1243544531.jpg"
        },
        {
          "id": "63332e18eecde8c117e7f622",
          "author": "Lily Hay Newman",
          "description": "The internet infrastructure company has an alternative tool to check whether you’re human—and it doesn’t force you to pick out buses in tiny boxes.",
          "link": "https://www.wired.com/story/cloudflare-captcha-turnstile/",
          "publishedOn": "2022-09-28T13:05:42.000Z",
          "wordCount": 19624,
          "title": "Cloudflare Takes a Stab at a Captcha That Doesn’t Suck",
          "imageUrl": "https://media.wired.com/photos/6333880b62435d269fdbdc3c/191:100/w_1280,c_limit/Cloudflare-Takes-a-Stab-at-a-Captcha-That-Doesn%E2%80%99t-Suck-Security-GettyImages-1415014574.png"
        },
        {
          "id": "63338f1d62435d269fdbdc3d",
          "author": "Matt Burgess",
          "description": "Pornhub is trialing a new automated tool that pushes CSAM-searchers to seek help for their online behavior. Will it work?",
          "link": "https://www.wired.com/story/pornhub-search-child-abuse-chatbot/",
          "publishedOn": "2022-09-28T06:00:00.000Z",
          "wordCount": 20755,
          "title": "This Chatbot Aims to Steer People Away From Child Abuse Material",
          "imageUrl": "https://media.wired.com/photos/63338f1d8990652479ff3a52/191:100/w_1280,c_limit/Pornhub-Chatbot-Security-GettyImages-888275148.png"
        },
        {
          "id": "6323876af1e5c40d2b1bc653",
          "author": "Omar L. Gallaga",
          "description": "Want to speak up against Big Tech, unjust data collection, and surveillance? Here's how to be an activist in your community and beyond.",
          "link": "https://www.wired.com/story/how-to-advocate-your-tech-privacy/",
          "publishedOn": "2022-09-27T12:00:00.000Z",
          "wordCount": 19309,
          "title": "How to Advocate for Data Privacy and Users' Rights",
          "imageUrl": "https://media.wired.com/photos/6332328740fe1e8870aa3bbe/191:100/w_1280,c_limit/Advocate-for-Online-Privacy-Gear-GettyImages-1248994811.jpg"
        },
        {
          "id": "632a09f320bc56769c4131aa",
          "author": "Lily Hay Newman",
          "description": "The fun-loving cybercriminals blamed for breaches of Uber and Rockstar are exposing weaknesses in ways others aren't.",
          "link": "https://www.wired.com/story/lapsusdollar-uber-rockstar-breach-multifactor-authentication-weaknesses/",
          "publishedOn": "2022-09-27T11:00:00.000Z",
          "wordCount": 19959,
          "title": "The Dire Warnings in the Lapsus$ Hacker Joyride",
          "imageUrl": "https://media.wired.com/photos/632cf155eecde8c117e7f5cc/191:100/w_1280,c_limit/Uber-Slack-Hack-Cautiounary-Tale-Security-GettyImages-1418158773.jpg"
        },
        {
          "id": "5e456c576fd0760009425826",
          "author": "Scott Gilbertson",
          "description": "It won’t solve all of your privacy problems, but a virtual private network can make you a less tempting target for hackers.",
          "link": "https://www.wired.com/story/best-vpn/",
          "publishedOn": "2022-09-26T13:00:00.000Z",
          "wordCount": 26495,
          "title": "The Best VPNs to Protect Yourself Online",
          "imageUrl": "https://media.wired.com/photos/5e586f50ffd9380009895d8d/191:100/w_1280,c_limit/feature_art-best_vpn.jpg"
        },
        {
          "id": "632e50ef40fe1e8870aa3bb0",
          "author": "Justin Ling",
          "description": "UN countries are preparing to pick a new head of the International Telecommunications Union. Who wins could shape the open web's future.",
          "link": "https://www.wired.com/story/2022-itu-secretary-general-election/",
          "publishedOn": "2022-09-26T11:00:00.000Z",
          "wordCount": 25638,
          "title": "This Vote Could Change the Course of Internet History",
          "imageUrl": "https://media.wired.com/photos/632e50efc9bb1af7ef24988d/191:100/w_1280,c_limit/UN-Vote-ITU-Security-GettyImages-1335882101.jpg"
        },
        {
          "id": "632e4a7640fe1e8870aa3baf",
          "author": "Varsha Bansal",
          "description": "Many companies have pulled physical servers from the country as a mandate to collect customer data goes into effect.",
          "link": "https://www.wired.com/story/vpn-firms-flee-india-data-collection-law/",
          "publishedOn": "2022-09-25T11:00:00.000Z",
          "wordCount": 18759,
          "title": "VPN Providers Flee India as a New Data Law Takes Hold",
          "imageUrl": "https://media.wired.com/photos/632e4a76f2203b5586fac01f/191:100/w_1280,c_limit/VPNs-Flee-India-Security-GettyImages-1217160311.jpg"
        },
        {
          "id": "632e4525c9bb1af7ef24988b",
          "author": "Lily Hay Newman, Matt Burgess",
          "description": "Plus: A leaked trove illuminates Russia’s internet regulator, a report finds Facebook and Instagram violated Palestinian rights, and more.",
          "link": "https://www.wired.com/story/child-predators-twitch-russia-internet-regulator-security-roundup/",
          "publishedOn": "2022-09-24T13:00:00.000Z",
          "wordCount": 19780,
          "title": "Child Predators Mine Twitch to Prey on Kids",
          "imageUrl": "https://media.wired.com/photos/632e452520bc56769c4131e8/191:100/w_1280,c_limit/Twitch-Child-Predators-Security-GettyImages-1320999349.jpg"
        },
        {
          "id": "632b349f00704d14b5ffb9a1",
          "author": "Andy Greenberg",
          "description": "New research shows how third-party apps could be exploited to infiltrate these sensitive workplace tools.",
          "link": "https://www.wired.com/story/slack-microsoft-teams-app-security/",
          "publishedOn": "2022-09-23T16:52:52.000Z",
          "wordCount": 21953,
          "title": "Slack’s and Teams’ Lax App Security Raises Alarms",
          "imageUrl": "https://media.wired.com/photos/632d0df220bc56769c4131d5/191:100/w_1280,c_limit/security-slack-teams.jpg"
        },
        {
          "id": "632dcedd20bc56769c4131d7",
          "author": "Matt Burgess",
          "description": "Amid protests against the killing of Mahsa Amini, authorities have cut off mobile internet, WhatsApp, and Instagram. The death toll continues to rise.",
          "link": "https://www.wired.com/story/iran-protests-2022-internet-shutdown-whatsapp/",
          "publishedOn": "2022-09-23T15:23:24.000Z",
          "wordCount": 20545,
          "title": "Iran’s Internet Shutdown Hides a Deadly Crackdown",
          "imageUrl": "https://media.wired.com/photos/632dcedd36c33c0247a2f0ee/191:100/w_1280,c_limit/Iran-Internet-Shutdown-Security-AP_22264589595157.jpg"
        },
        {
          "id": "632a29ecc9bb1af7ef249865",
          "author": "Dhruv Mehrotra",
          "description": "Churches are using invasive phone-monitoring tech to discourage “sinful” behavior. Some software is seeing more than congregants realize.",
          "link": "https://www.wired.com/story/covenant-eyes-anti-porn-accountability-monitoring-apps/",
          "publishedOn": "2022-09-22T17:00:00.000Z",
          "wordCount": 27017,
          "title": "The Ungodly Surveillance of Anti-Porn ‘Shameware’ Apps",
          "imageUrl": "https://media.wired.com/photos/632ba19662435d269fdbdba4/191:100/w_1280,c_limit/security-shameware.jpg"
        },
        {
          "id": "632b295b00704d14b5ffb9a0",
          "author": "Lily Hay Newman",
          "description": "Security firm Chainguard has created a simple, open source way for organizations to defend the cloud against some of the most insidious attacks.",
          "link": "https://www.wired.com/story/chainguard-wolfi-linux-distribution/",
          "publishedOn": "2022-09-22T14:46:02.000Z",
          "wordCount": 19982,
          "title": "A New Linux Tool Aims to Guard Against Supply Chain Attacks",
          "imageUrl": "https://media.wired.com/photos/632bbd9cd884b4dcc941656d/191:100/w_1280,c_limit/Security-Open-Source-Linux-1403599186.jpg"
        },
        {
          "id": "632a4347c4d3ebc9237bc61c",
          "author": "Matt Burgess",
          "description": "But as Ukrainians retake ground, some of the firms are erasing their online presence.",
          "link": "https://www.wired.com/story/ukraine-war-mobile-networks-russia/",
          "publishedOn": "2022-09-21T11:00:00.000Z",
          "wordCount": 21074,
          "title": "Shadowy Russian Cell Phone Companies Are Cropping Up in Ukraine",
          "imageUrl": "https://media.wired.com/photos/632a4347995b6da54b57efd7/191:100/w_1280,c_limit/Shadowy-Russian-Cell-Companies-Security-GettyImages-713877183.jpg"
        },
        {
          "id": "6329c23beecde8c117e7f4ea",
          "author": "Peter Guest",
          "description": "The encrypted messaging app is a haven for politically motivated vitriol, but users are increasingly bringing threats to targets’ doorsteps.",
          "link": "https://www.wired.com/story/telegrams-doxing-problem/",
          "publishedOn": "2022-09-20T13:39:51.000Z",
          "wordCount": 21286,
          "title": "Telegram Has a Serious Doxing Problem",
          "imageUrl": "https://media.wired.com/photos/6329c23b00704d14b5ffb995/191:100/w_1280,c_limit/Doxing_telgram_biz_GettyImages-1173158197-(1).jpg"
        },
        {
          "id": "63238b91d884b4dcc941650e",
          "author": "Olatunji Olaigbe",
          "description": "Despite having one of the strongest data-protection policies in Africa, the country’s enforcement and disclosure practices remain dangerously broken.",
          "link": "https://www.wired.com/story/nigeria-cybersecurity-issues/",
          "publishedOn": "2022-09-19T11:00:00.000Z",
          "wordCount": 21907,
          "title": "The Deep Roots of Nigeria’s Cybersecurity Problem",
          "imageUrl": "https://media.wired.com/photos/6325236a036b54662b51058f/191:100/w_1280,c_limit/Nigeria-Cybersecurity-Security-GettyImages-1193599505.jpg"
        },
        {
          "id": "6309107c567860ab6c66c64f",
          "author": "David Nield",
          "description": "Tired of advertisers spying on your private communications? This beta promises to kick tracking technology to the curb.",
          "link": "https://www.wired.com/story/how-to-use-duckduckgo-privacy-first-email/",
          "publishedOn": "2022-09-18T12:00:00.000Z",
          "wordCount": 18685,
          "title": "How to Use DuckDuckGo’s Privacy-First Email Service",
          "imageUrl": "https://media.wired.com/photos/6324febb20bc56769c41311a/191:100/w_1280,c_limit/How-to-Use-DuckDuckGo-Email-Privacy-Gear.jpg"
        },
        {
          "id": "63250dc8f2203b5586fabfbb",
          "author": "Matt Burgess",
          "description": "Snipers on buildings. Drone no-fly zones. Temporary CCTV. The security plan is even more complex than it was for the London 2012 Olympics.",
          "link": "https://www.wired.com/story/queen-elizabeth-ii-funeral-details-security/",
          "publishedOn": "2022-09-18T11:00:00.000Z",
          "wordCount": 21706,
          "title": "The Queen’s Funeral Sets Off the Biggest UK Police Operation Ever",
          "imageUrl": "https://media.wired.com/photos/63250dc8eecde8c117e7f4a4/191:100/w_1280,c_limit/Queen-Queues-London-Security-GettyImages-1243218331.jpg"
        },
        {
          "id": "6324bae4c9bb1af7ef2497d2",
          "author": "Andrew Couts",
          "description": "Plus: An AI artist exposes surveillance of Instagram users, the US charges Iranians over a ransomware campaign, and more.",
          "link": "https://www.wired.com/story/cbp-phone-database-ai-instagram-surveillance/",
          "publishedOn": "2022-09-17T13:00:00.000Z",
          "wordCount": 18551,
          "title": "US Border Agents May Have a Copy of Your Text Messages",
          "imageUrl": "https://media.wired.com/photos/6324fc19c9bb1af7ef2497da/191:100/w_1280,c_limit/US-Border-Patrol-Data-Security-GettyImages-1083178844.jpg"
        },
        {
          "id": "632496798990652479ff3877",
          "author": "Lily Hay Newman",
          "description": "An alleged teen hacker claims to have gained deep access to the company’s systems, but the full picture of the breach is still coming into focus.",
          "link": "https://www.wired.com/story/uber-hack-mfa-phishing/",
          "publishedOn": "2022-09-16T21:35:11.000Z",
          "wordCount": 19427,
          "title": "The Uber Hack’s Devastation Is Just Starting to Reveal Itself",
          "imageUrl": "https://media.wired.com/photos/6324bd9ac4d3ebc9237bc60e/191:100/w_1280,c_limit/Uber-Hack-Security-GettyImages-1238322525.jpg"
        }
      ]
    },
    {
      "title": "WIRED Guides Latest",
      "feedUrl": "https://www.wired.com/feed/tag/wired-guide/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": []
    },
    {
      "title": "Product Hunt — The best new products, every day",
      "feedUrl": "https://www.producthunt.com/feed",
      "siteUrl": "https://www.producthunt.com",
      "articles": [
        {
          "id": "https://www.producthunt.com/posts/decideon",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/decideon",
          "publishedOn": "2022-09-29T07:15:13.000Z",
          "wordCount": 991,
          "title": "DecideOn — Who goes first?",
          "imageUrl": "https://ph-files.imgix.net/dafa37b9-4c98-40a9-ab1a-866c47eb63c7.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/moments-by-storyly",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/moments-by-storyly",
          "publishedOn": "2022-09-29T07:11:58.000Z",
          "wordCount": 988,
          "title": "Moments by Storyly — Turn individual users into long-lasting communities",
          "imageUrl": "https://ph-files.imgix.net/fe776f8c-fa69-47be-aec0-61e08c0c189b.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/appblock",
          "author": null,
          "description": "Hello everyone,\nit is my great honor to introduce you to the brand new AppBlock for iOS.\n\nThe all-new AppBlock is bringing completely revolutionary app-blocking capabilities to iOS 16 users, giving them control over their free time. Thanks to the new use of the Screen Time API, AppBlock puts a previously unseen ability to control app usage in the hands of the user, helping to get rid of phone dependency, improve the ability to focus and improve overall digital well-being. \n\nWhat is new in AppBlock for iOS 16?\n1️⃣ A more efficient way to block apps with the Screen Time API\n2️⃣ Ability to select entire categories of apps\n3️⃣ Improved user experience\n4️⃣ New blocking screen and usage statistics\n\n1️⃣ A new way to block selected apps\nWithout the Screen Time API, we had to block apps from connec…",
          "link": "https://www.producthunt.com/posts/appblock",
          "publishedOn": "2022-09-29T07:02:16.000Z",
          "wordCount": 1099,
          "title": "AppBlock — Block apps with one tap and stay focused when it matters",
          "imageUrl": "https://ph-files.imgix.net/6e8036c9-afc6-4cd2-b494-2b6142060bca.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/logocorn",
          "author": null,
          "description": "creating a logo\n\nSure, indie hacker products are supposed to be scrappy, but I just LOVE that first step when you have a new idea.\n\nIt’s a fun thing to do but still time-consuming.\n\nSo I made a text logo generator for indie hackers with a tight budget.\n\nAnd we’re talking real tight budget.\n\nThe logo maker is on a pay-what-you-want basis*\n\n*$1 minimum\n\nCheck it out at https://LogoCorn.com 🌽\n\nWould love to hear your feedback 🙏\n\nFeatures ⬇️\n\nInfinite scroll of logos\n\n\nGenerate new colors for each logo\n\n\n\nPick your own color for a logo\n\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/logocorn",
          "publishedOn": "2022-09-29T07:01:39.000Z",
          "wordCount": 1068,
          "title": "LogoCorn — The most affordable way to get a text logo",
          "imageUrl": "https://ph-files.imgix.net/e336cd8e-959c-47c2-b988-3bc41b5a312c.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/jota",
          "author": null,
          "description": "https://www.producthunt.com/@noa... \n\nJota is a simple little ios app that allows you to store those links, recommendations and more forever in an easy to scan interface. \n\nCurrently released just as an MVP on iOS we are hoping to release to Android and Chrome extensions soon! We also have a tonne of easy social sharing features too on the backlog. Let us know your thoughts!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/jota",
          "publishedOn": "2022-09-29T07:01:37.000Z",
          "wordCount": 1043,
          "title": "Jota — Simple iOS app that is better than bookmarks",
          "imageUrl": "https://ph-files.imgix.net/55f23753-f741-422f-b8a0-5f1fc88f5463.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/magnetiq",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/magnetiq",
          "publishedOn": "2022-09-29T06:53:45.000Z",
          "wordCount": 1059,
          "title": "Magnetiq — Create beautiful ads with 100+ templates, publish in minutes",
          "imageUrl": "https://ph-files.imgix.net/8d7f4e46-d647-4f4a-950f-8db3fee2518c.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/text-to-image-editor",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/text-to-image-editor",
          "publishedOn": "2022-09-29T06:50:44.000Z",
          "wordCount": 1008,
          "title": "Text to Image Editor — 'Photoshop' using only text",
          "imageUrl": "https://ph-files.imgix.net/713c5a28-2981-4a4a-9d9e-c5061f8a8d41.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/wordpress-for-adobe-xd",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/wordpress-for-adobe-xd",
          "publishedOn": "2022-09-29T06:16:37.000Z",
          "wordCount": 1089,
          "title": "WordPress for Adobe XD — Adobe XD to WordPress, no code required",
          "imageUrl": "https://ph-files.imgix.net/5092a3bc-87a9-42c8-b15e-15f569428a24.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/cmercury-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/cmercury-2",
          "publishedOn": "2022-09-29T04:21:04.000Z",
          "wordCount": 932,
          "title": "cmercury — Verify, create, automate and analyse your email campaigns",
          "imageUrl": "https://ph-files.imgix.net/40680175-dba1-486c-8036-6e708aba010c.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/ask-command",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/ask-command",
          "publishedOn": "2022-09-29T04:04:58.000Z",
          "wordCount": 1112,
          "title": "Ask Command — AI-powered app to remember those commands you always forget",
          "imageUrl": "https://ph-files.imgix.net/5d98632d-9be9-4999-9bba-2e3fec45efea.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/jiter",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/jiter",
          "publishedOn": "2022-09-29T03:48:44.000Z",
          "wordCount": 981,
          "title": "Jiter — Make cron jobs history with Just In Time (JIT) webhooks",
          "imageUrl": "https://ph-files.imgix.net/50b58051-e490-49df-9da5-ec82632b1c3a.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/wp-dark-mode-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/wp-dark-mode-2",
          "publishedOn": "2022-09-29T03:20:16.000Z",
          "wordCount": 1092,
          "title": "WP Dark Mode — 1 click dark mode for WordPress, now with social share",
          "imageUrl": "https://ph-files.imgix.net/1dbb2583-ce72-4f2b-913a-7e7a41fa793a.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/tailwind-startup-essentials-kit",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/tailwind-startup-essentials-kit",
          "publishedOn": "2022-09-29T02:00:42.000Z",
          "wordCount": 1058,
          "title": "Tailwind Startup Essentials Kit — Pre-built essential startup pages",
          "imageUrl": "https://ph-files.imgix.net/ac8603bb-767f-4498-b8a7-36c73c89f5b8.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/vision-board-3",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/vision-board-3",
          "publishedOn": "2022-09-29T01:44:39.000Z",
          "wordCount": 1064,
          "title": "Vision Board — Concentrate on your dreams, vision and goals",
          "imageUrl": "https://ph-files.imgix.net/ad50a878-7cda-4181-bc08-817cf19c7e5a.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/markie",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/markie",
          "publishedOn": "2022-09-29T01:00:08.000Z",
          "wordCount": 902,
          "title": "Markie — The new way to onboard customers",
          "imageUrl": "https://ph-files.imgix.net/a96f3d42-a825-4c42-9a39-33220816b81b.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/defter-notes",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/defter-notes",
          "publishedOn": "2022-09-28T23:36:10.000Z",
          "wordCount": 1002,
          "title": "Defter Notes — iPad app for handwritten spatial notes",
          "imageUrl": "https://ph-files.imgix.net/2be4306e-937a-40e0-bd85-625da17a7014.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/divercty-io",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/divercty-io",
          "publishedOn": "2022-09-28T23:32:49.000Z",
          "wordCount": 994,
          "title": "Divercty.io — Closing the workforce diversity and inclusion gap with data",
          "imageUrl": "https://ph-files.imgix.net/9eb36e9b-c012-4126-8a2e-9ece36553205.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/figtree",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/figtree",
          "publishedOn": "2022-09-28T22:50:37.000Z",
          "wordCount": 884,
          "title": "Figtree — A friendly yet minimal sans-serif font",
          "imageUrl": "https://ph-files.imgix.net/cdaba8a2-3c51-4378-83e3-e5dfbfed4b7c.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/front-figure",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/front-figure",
          "publishedOn": "2022-09-28T21:08:54.000Z",
          "wordCount": 967,
          "title": "Front Figure — Value your company or validate your idea pre-operations",
          "imageUrl": "https://ph-files.imgix.net/bfd06b86-9a6f-4117-a101-7affb161ab7a.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/the-visionary-by-crew",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/the-visionary-by-crew",
          "publishedOn": "2022-09-28T19:34:39.000Z",
          "wordCount": 1000,
          "title": "The Visionary by Crew — Use design thinking to plan your next career step",
          "imageUrl": "https://ph-files.imgix.net/9439b3f0-1e7d-46a4-9d4e-0ef15e5523d8.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/lucid-9",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/lucid-9",
          "publishedOn": "2022-09-28T18:33:45.000Z",
          "wordCount": 876,
          "title": "Lucid — The world’s most important  knowledge, visualized",
          "imageUrl": "https://ph-files.imgix.net/69931bfa-2d63-448c-9dde-123ca873cdae.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/confidence",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/confidence",
          "publishedOn": "2022-09-28T18:22:56.000Z",
          "wordCount": 906,
          "title": "Confidence — Run thousands of forecast simulations right in Salesforce",
          "imageUrl": "https://ph-files.imgix.net/fca43c6f-b25a-49b7-b28d-0579ee994b79.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/amazon-halo-view",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/amazon-halo-view",
          "publishedOn": "2022-09-28T17:09:19.000Z",
          "wordCount": 1019,
          "title": "Amazon Halo View  — A new bedside health tracker from Amazon",
          "imageUrl": "https://ph-files.imgix.net/5f4cbfea-65a1-4004-a880-df8da2f15362.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/emerge-recovery",
          "author": null,
          "description": "https://medium.com/@Crow-and-Pit....\n\n\n➡️ Who are we building for? 🙋🏻‍♀️🧑🏾‍🦱🧑🏼‍🦰🧕🏽🧓🏻👨🏻\n\nGrown folks(18+) with a phone or tablet(Android or iOS) who are uncomfortable with their current behaviors and relationships with a substance(s). This ranges from the sober-curious all the way to diagnosed addictions disorders transitioning out of acute care facilities.\n\n\n➡️ Why “Crow & Pitcher”? 🤔🔧\n\nOur company namesake is taken from Aesop’s Fables. Read it here!: https://www.read.gov/aesop/012.html\n\n\n➡️ How do we know if we’ve succeeded? 🌎 💗\n\nImproved quality of life—less pain, better sleep, improved moods, support system\n- Reduction in use over time\n- Reduced criminal justice involvement\n- Stability\n\n➡️❓What else would you aim to improve in your life with the aid of daily activities reflection while you are trying to reduce use of a substance? ex: have one little moment of joy each day: https://apps.npr.org/joy-generat...\" (I really wish this had existed during peak lockdown!) \n\nCrow & Pitcher, Inc. is a registered Public Benefit Company (PBC). A PBC provides a public good to society beyond merely creating shareholder value. In our charter: *to positively impact the quality of life for those seeking substance use long-term recovery through technology while embracing an evidence-driven, privacy-first, and systems-centric approach.*\n\nAddiction and substance misuse are complicated experiences that intersect medical, mental, and physical health. We strive to partner with other organizations, many who would be perceived as our competitors, to provide a comprehensive array of tools towards a better quality of life. The rising tide lifts all boats!\n\n➡️ We’re looking forward to hearing your thoughts and feedback, and happy to answer questions!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/emerge-recovery",
          "publishedOn": "2022-09-28T16:07:56.000Z",
          "wordCount": 1021,
          "title": "Emerge Recovery — Your low-key substance misuse activity tracker",
          "imageUrl": "https://ph-files.imgix.net/6ce16837-9a10-4f65-ab9b-e795ae89e54f.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/interactive-demo",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/interactive-demo",
          "publishedOn": "2022-09-28T16:06:48.000Z",
          "wordCount": 929,
          "title": "Interactive Demo — Create, edit & share interactive demo for your SaaS product",
          "imageUrl": "https://ph-files.imgix.net/29e94c45-67ac-4ad8-8c48-e3c51d9a5c09.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/700-twitter-swipe-file",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/700-twitter-swipe-file",
          "publishedOn": "2022-09-28T16:04:53.000Z",
          "wordCount": 1076,
          "title": "700+ Twitter Swipe File — Skyrocket your impressions and engagement on Twitter",
          "imageUrl": "https://ph-files.imgix.net/a09c3657-d4c0-4199-86c4-4906b4fe9b21.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/formly-2",
          "author": null,
          "description": "https://appsumo.8odi.net/formly\n\nPlease share your thoughts, comments and feedback and have a great day! \nMany Thanks \nUrmi & Formly Team  😊\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/formly-2",
          "publishedOn": "2022-09-28T15:50:55.000Z",
          "wordCount": 919,
          "title": "Formly — On-brand forms with your own domain",
          "imageUrl": "https://ph-files.imgix.net/56ccf4f5-b03c-4e8e-bf91-62072622eef3.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/infos",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/infos",
          "publishedOn": "2022-09-28T11:37:10.000Z",
          "wordCount": 1035,
          "title": "Infos — Quickly capture and look-up short infos",
          "imageUrl": "https://ph-files.imgix.net/c631e3b0-0a22-4d78-99e2-ec2ae117eaf7.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/grouple-2",
          "author": null,
          "description": "rohit@grouple.in\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/grouple-2",
          "publishedOn": "2022-09-28T10:21:57.000Z",
          "wordCount": 986,
          "title": "Grouple — Making group bookings easier and faster",
          "imageUrl": "https://ph-files.imgix.net/55de3b89-c934-498d-8bad-e416257efda7.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/onpassword-one-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/onpassword-one-2",
          "publishedOn": "2022-09-28T09:25:27.000Z",
          "wordCount": 1025,
          "title": "onPASSWORD One — An offline, open-source and memorable password generator",
          "imageUrl": "https://ph-files.imgix.net/0949feeb-9617-4a61-86f4-fdfb5e7c4951.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/sellerz-io",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/sellerz-io",
          "publishedOn": "2022-09-28T09:21:07.000Z",
          "wordCount": 1002,
          "title": "Sellerz.io — Let prospects video call your sales team",
          "imageUrl": "https://ph-files.imgix.net/f83f4b7f-a431-4360-b587-047d16db8d4d.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/tally-4fc9646a-7755-4be8-8833-777380081545",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/tally-4fc9646a-7755-4be8-8833-777380081545",
          "publishedOn": "2022-09-28T09:11:03.000Z",
          "wordCount": 857,
          "title": "Tally — How much does it cost to charge your EV?",
          "imageUrl": "https://ph-files.imgix.net/b1b2d32c-c48b-4a19-8d01-e77b1186f399.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/maze-3",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/maze-3",
          "publishedOn": "2022-09-28T07:43:25.000Z",
          "wordCount": 1053,
          "title": "Maze — Helping you live the life you want, wherever it is",
          "imageUrl": "https://ph-files.imgix.net/3e2b7dfd-358b-423a-9d63-6fa04c8cb761.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/same-day-blocker",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/same-day-blocker",
          "publishedOn": "2022-09-28T07:29:50.000Z",
          "wordCount": 995,
          "title": "Same Day Blocker — No more same day meetings",
          "imageUrl": "https://ph-files.imgix.net/c1cd7350-37e8-4f41-8f73-de3c967aba99.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/impulse-dev",
          "author": null,
          "description": "https://rogovoy.me/blog/writing-...\n\nImpulse is my experiment to bridge that gap and make a \"design\" tool that works directly with my code.\n\nWith Impulse, I've come to love web design.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/impulse-dev",
          "publishedOn": "2022-09-28T07:09:34.000Z",
          "wordCount": 990,
          "title": "Impulse.dev — Impossible dev tools for React and Tailwind",
          "imageUrl": "https://ph-files.imgix.net/85df76a0-78ed-44c3-921b-c3af5975595a.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/aprive",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/aprive",
          "publishedOn": "2022-09-28T07:08:56.000Z",
          "wordCount": 971,
          "title": "Aprive — The first ever free real estate CRM",
          "imageUrl": "https://ph-files.imgix.net/405cee4a-991d-4456-8cff-c79bab85d57a.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/kana",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/kana",
          "publishedOn": "2022-09-28T07:04:22.000Z",
          "wordCount": 912,
          "title": "Kana — Hub for AI generated content",
          "imageUrl": "https://ph-files.imgix.net/4cb2d2f3-5a32-4adb-ac25-5c54d21e353b.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/maple-6cda5ec7-f628-4561-bf89-0156cb362197",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/maple-6cda5ec7-f628-4561-bf89-0156cb362197",
          "publishedOn": "2022-09-28T01:22:34.000Z",
          "wordCount": 1020,
          "title": "Maple — Take the stress out of planning and organizing your home",
          "imageUrl": "https://ph-files.imgix.net/5d2f900d-7890-4e95-bf9e-b9215aad7034.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/pdf-flip-books-v2-0",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/pdf-flip-books-v2-0",
          "publishedOn": "2022-09-27T19:13:03.000Z",
          "wordCount": 1049,
          "title": "PDF Flip Books v2.0 — Convert your PDFs into beautiful PDF flip books in seconds",
          "imageUrl": "https://ph-files.imgix.net/883fd3ff-8e65-4cc0-86bb-4265c837121b.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/trello-tip-generator-and-newsletter",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/trello-tip-generator-and-newsletter",
          "publishedOn": "2022-09-27T19:07:13.000Z",
          "wordCount": 1081,
          "title": "Trello Tip Generator and Newsletter — Get the most of out of Trello with these quick tips",
          "imageUrl": "https://ph-files.imgix.net/15538f7b-dcc0-448d-9185-2f8c5730e71d.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/stripe-no-code-customer-portal",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/stripe-no-code-customer-portal",
          "publishedOn": "2022-09-27T17:50:27.000Z",
          "wordCount": 1046,
          "title": "Stripe No-code Customer Portal — Share a link to let customers manage billing details",
          "imageUrl": "https://ph-files.imgix.net/60484978-faa4-42af-aecf-7fe286b01b1d.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/salesmsg-for-slack",
          "author": null,
          "description": "https://app.salesmessage.com/register?c=PH20.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/salesmsg-for-slack",
          "publishedOn": "2022-09-27T13:50:06.000Z",
          "wordCount": 955,
          "title": "Salesmsg for Slack — Simple, scalable, two-way business texting, now on Slack",
          "imageUrl": "https://ph-files.imgix.net/1ed4ec38-faca-4556-8e22-de92ade8eddd.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/bounsel-flow",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/bounsel-flow",
          "publishedOn": "2022-09-27T10:20:36.000Z",
          "wordCount": 919,
          "title": "Bounsel Flow — Enough of copy-paste, welcome to Bounsel Flow",
          "imageUrl": "https://ph-files.imgix.net/bf676de9-c59e-4cea-8839-9c2079808f36.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/notion-world",
          "author": null,
          "description": "@valentin_notion and @quentinvllrd - who are also the makers behind Notion Everything.\n\nHave fun with this :)\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/notion-world",
          "publishedOn": "2022-09-26T20:34:11.000Z",
          "wordCount": 1108,
          "title": "Notion World — 150+ resources and tools to master the world of Notion",
          "imageUrl": "https://ph-files.imgix.net/8a1b5ca4-ab06-4377-ae32-3ef5cea826c7.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/arcade-2-0",
          "author": null,
          "description": "Product-led: Unlike most of our competitors, we’re actually product-led! You can go right to our website and get started within minutes. We’ve made a lot of investments in a great self-service experience. No more waiting for someone to respond to your “requested a demo” form. \n\n🕹 Arcade Play: We rebuilt our Chrome extension to automatically make video snippets based on actions such as scrolling, drag and drop, and entering text. Press “Record Demo” in our extension to see what we mean! \n\n🥁 Interactive emails and GIFs: We’ve doubled down on our GTM user base who love embedding Arcades inside of homepages, emails, social media and onboarding flows. Since launching, we’ve redesigned our chrome extension to create interactive video based on user actions, and we now support interactive Arcades inside of Gmail, Outlook, Superhuman, and Github! We also allow you to export Arcades as GIFs if you want to promote across channels. \n\n👨‍👩‍👧‍👦  Arcade Teams: If you are a creator and want to collaborate with others inside your company, check out our new Arcade Teams product (in beta). We have signed contracts with Atlassian, Carta, Sentry, AngelList and many more! \n\n🎨  A completely redesigned UI: We gave our product a nice facelift with our new design language.  \n\n\n\nWe’re also one of the easiest interactive demo tools to use. Our median time to publish is 7m. We have a generous free tier as well. Try it out for yourself: http://arcade.software/.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/arcade-2-0",
          "publishedOn": "2022-09-26T16:08:09.000Z",
          "wordCount": 1053,
          "title": "Arcade 2.0 — The easiest way to showcase your product",
          "imageUrl": "https://ph-files.imgix.net/a1caf2d9-4e2c-4b00-940e-34835e36f754.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/derrick-app",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/derrick-app",
          "publishedOn": "2022-09-26T14:27:16.000Z",
          "wordCount": 992,
          "title": "Derrick App — Build Lead Lists in seconds, from LinkedIn to GoogleSheet",
          "imageUrl": "https://ph-files.imgix.net/ece05f3b-85e9-4446-9e2d-a032e423f974.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/stardust-adventure-coffee",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/stardust-adventure-coffee",
          "publishedOn": "2022-09-26T09:40:19.000Z",
          "wordCount": 1041,
          "title": "Stardust Adventure Coffee — Delicious coffee, wherever you are",
          "imageUrl": "https://ph-files.imgix.net/9d8c91f2-011e-456c-bbac-34d51a186ee4.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/agoston-beta",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/agoston-beta",
          "publishedOn": "2022-09-26T07:07:35.000Z",
          "wordCount": 967,
          "title": "Agoston (Beta) — Code any ideas in hours, scale live or deploy anywhere",
          "imageUrl": "https://ph-files.imgix.net/a3057992-dad0-40be-9eb6-9e96449e2166.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/course-architect",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/course-architect",
          "publishedOn": "2022-09-26T05:34:36.000Z",
          "wordCount": 977,
          "title": "Course Architect — Make your next course a next level course",
          "imageUrl": "https://ph-files.imgix.net/b060185f-3a2a-4f57-8e83-f93983793656.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/watchlimits",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/watchlimits",
          "publishedOn": "2022-09-24T14:35:01.000Z",
          "wordCount": 1008,
          "title": "watchlimits — Solve binge watching and unlock hours of lost productivity",
          "imageUrl": "https://ph-files.imgix.net/f26d9a12-b090-4f6b-9517-c093aee8caad.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}