{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news/",
      "articles": [
        {
          "id": "https://www.freecodecamp.org/news/how-to-compare-arrays-in-javascript/",
          "author": "Joel Olawanle",
          "description": "When handling logic with JavaScript, you might need to compare two arrays to see if they are equal or not. Really, this shouldn't be difficult, as you'd think we could easily use either the loose equality (double equals - ==) or the strict equality (triple equals -  ===). But",
          "link": "https://www.freecodecamp.org/news/how-to-compare-arrays-in-javascript/",
          "publishedOn": "2022-09-16T00:15:56.000Z",
          "wordCount": 1785,
          "title": "Comparing Arrays in JavaScript – How to Compare 2 Arrays in JS",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/cover-template.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-data-science-what-a-data-scientist-actually-does/",
          "author": "Dionysia Lemonaki",
          "description": "Data Science is one of the most in-demand and desirable careers of the 21st century. Even though the term was introduced in the early 1960s, its meaning has changed considerably over time. And despite its rise in popularity in recent years, many people outside the field still find the term",
          "link": "https://www.freecodecamp.org/news/what-is-data-science-what-a-data-scientist-actually-does/",
          "publishedOn": "2022-09-15T20:11:02.000Z",
          "wordCount": 3184,
          "title": "What is Data Science? What a Data Scientist Actually Does",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/pexels-alex-knight-2599244.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/animate-react-apps/",
          "author": "Reed Barger",
          "description": "Animations have the powerful ability to turn a boring, static application into a more dynamic, memorable experience for your users.  In general, animations can be quite difficult to set up, especially if you intend to animate multiple components in your app.  In this tutorial, we will see how",
          "link": "https://www.freecodecamp.org/news/animate-react-apps/",
          "publishedOn": "2022-09-15T19:56:57.000Z",
          "wordCount": 1702,
          "title": "How to Animate Your React Apps with 1 Line of Code",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/mugshotbot.com_customize_color-red-image-9129875b-mode-dark-pattern-topography-theme-two_up-url-https___freecodecamp.org.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-install-kali-linux/",
          "author": "Daniel Iwugo",
          "description": "Kali Linux (formerly known as BackTrack) is an open-source Linux distro developed and funded by Offensive Security.  It’s basically an ethical hacker's dream operating system, because it has most of the tools you'll ever need built-in. From Metasploit to JohntheRipper to the one and only Aircrack-ng, this OS has",
          "link": "https://www.freecodecamp.org/news/how-to-install-kali-linux/",
          "publishedOn": "2022-09-15T19:37:37.000Z",
          "wordCount": 2418,
          "title": "How to Install Kali Linux on Your Computer",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/install-kali-linux-article-image.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/nodejs-api-best-practices-for-scaling/",
          "author": "Rishabh Rawat",
          "description": "There is more to scalability than using cluster mode. In this tutorial, we'll explore 10 ways you can make your Node.js API ready to scale. When working on a project, we often get a few real nuggets here and there on how to do something in a better way. We",
          "link": "https://www.freecodecamp.org/news/nodejs-api-best-practices-for-scaling/",
          "publishedOn": "2022-09-15T16:59:00.000Z",
          "wordCount": 5604,
          "title": "Best Practices for Scaling Your Node.js REST APIs",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Node.js-Best-Practices-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-create-a-pivot-table-in-excel/",
          "author": "Kolade Chris",
          "description": "In Excel, pivot tables let you analyze and visualize your data in an easy way. With pivot tables, you can make comparisons and create calculations more quickly. You can even create charts to visualize your data. Creating pivot tables might be intimidating if you're doing it for the first time.",
          "link": "https://www.freecodecamp.org/news/how-to-create-a-pivot-table-in-excel/",
          "publishedOn": "2022-09-14T22:35:36.000Z",
          "wordCount": 1633,
          "title": "How to Create a Pivot Table in Excel",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/pivotTable.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-evaluate-machine-learning-models-using-tensorboard/",
          "author": "Salim Oyinlola",
          "description": "Improving a Machine Learning model is an iterative process. No machine learning model is ever perfect on the first attempt at training it. It usually takes a few iterations.  But a common mistake you might make as a Machine Learning practitioner is failing to realize that you need to",
          "link": "https://www.freecodecamp.org/news/how-to-evaluate-machine-learning-models-using-tensorboard/",
          "publishedOn": "2022-09-14T18:31:32.000Z",
          "wordCount": 1897,
          "title": "How to Evaluate Machine Learning Models using TensorBoard with TensorFlow",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/TensorFlow_Logo_with_text.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-html-and-css-from-the-ceo-of-scrimba/",
          "author": "Beau Carnes",
          "description": "Almost every website in the world uses HTML and CSS. So you should definitely learn them if you want to create websites. We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to build websites with HTML and CSS. Per Borgan created this course. Per",
          "link": "https://www.freecodecamp.org/news/learn-html-and-css-from-the-ceo-of-scrimba/",
          "publishedOn": "2022-09-14T18:15:01.000Z",
          "wordCount": 915,
          "title": "Learn HTML and CSS from the CEO of Scrimba",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/htmlcss.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/kernel-security-check-failure-how-to-restart-the-kernel-in-windows-10/",
          "author": "Gavin Lon",
          "description": "I’ve been a professional software engineer for many years, and I can testify that there are few things worse than getting the dreaded BSOD (Blue Screen of Death). Especially when you are about to write a piece of mind bending code at 2am to meet a looming deadline.  That’s",
          "link": "https://www.freecodecamp.org/news/kernel-security-check-failure-how-to-restart-the-kernel-in-windows-10/",
          "publishedOn": "2022-09-14T15:41:50.000Z",
          "wordCount": 2480,
          "title": "Kernel Security Check Failure – How to Restart the Kernel in Windows 10",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/ScreenShot1_BSOD_Anger.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-i-learned-teaching-20-hs-girls-to-code/",
          "author": "Kylie Ying",
          "description": "On day 1, they barely knew what a float was. On day 14, they had programmed a game of minesweeper, a cipher decoder, or a zombie apocalypse simulation. And I helped teach them how to do it. Each summer, MIT hosts a program called WTP, or Women's Technology Program.",
          "link": "https://www.freecodecamp.org/news/what-i-learned-teaching-20-hs-girls-to-code/",
          "publishedOn": "2022-09-14T14:46:14.000Z",
          "wordCount": 1815,
          "title": "What I Learned Teaching 20 High School Girls How to Code",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/pexels-pixabay-207691.jpg"
        }
      ]
    },
    {
      "title": "DEV Community 👩‍💻👨‍💻",
      "feedUrl": "https://dev.to/feed",
      "siteUrl": "https://dev.to",
      "articles": [
        {
          "id": "https://dev.to/jolamemushaj/three-ways-to-iterate-an-array-340j",
          "author": "jolamemushaj",
          "description": "Given an array of integers, return a new array with each value doubled.\nFor example: [2, 4, 6] --> [4, 8, 12]\nNumber #1: We use a for loop to iterate over the elements, transform each individual one, and push the results into a new array.\nfunction doubleValues(array) {\n    let result = [];\n    for (let i = 0; i < array.length; i++) {\n        result.push(array[i] * 2);\n    }\n    return result;\n}\n\nconsole.log(doubleValues([1, 2, 3, 4]));\n// [2, 4, 6, 8]\n\nNumber #2: For-of loop.\nfunction doubleValues(array) {\n    let result = [];\n    for (const element of array) {\n        result.push(element * 2);\n    }\n    return result;\n}\n\nconsole.log(doubleValues([1, 2, 3, 4]));\n// [2, 4, 6, 8]\n\nNumber #3: JavaScript Array type provides the map() method that allows you to transform the array elements in a cleaner way.\nconst array = [1, 2, 3, 4];\nconst doubleValues = array.map(element => element * 2);\nconsole.log(doubleValues);\n// [2, 4, 6, 8]",
          "link": "https://dev.to/jolamemushaj/three-ways-to-iterate-an-array-340j",
          "publishedOn": "2022-09-16T10:02:05.000Z",
          "wordCount": 1259,
          "title": "Three ways to iterate an array",
          "imageUrl": "https://dev.to/social_previews/article/1194864.png"
        },
        {
          "id": "https://dev.to/jjenus/programming-chose-me-4dd6",
          "author": "JJenus",
          "description": "Being unable to convince my parents and being unable to afford a university elsewhere except in my home state, I was compelled to apply for Medicine and Surgery (they believe I can do anything), but I'd already planned my life toward computer engineering (software or hardware).\nOn seeing the results, I was a point less than the required points to be in medical school and I was offered biology and the option to choose another. As of then, there was no computer engineering in the school, so I opted for the closest, \"Electrical and Electronic Engineering\". I've always wanted computer engineering cause I love fixing things and it'll give me a good grind on software engineering too.\nMeeting the best in the faculty and the department, he told me I'll be introduced to programming (I didn't know what programming was, I was just curious about how the computer works) and not let the zeal die, and that was the first step to where I'm today.\nI could've easily scored higher than what I scored, but somehow I didn't and I'm here building an IoT platform in a company 2 years after graduating, doing what I love doing, \"Software Engineering\".\nAlthough I have good knowledge of Java, PHP, Javascript, Python, and C, my curiosity has led me to join the ALX Software Engineering Program, where I'm currently resharpening my skills in C, and Python and acquiring DevOps skills and software engineering best practices. I'm also taking the AWS Machine Learning program. I told you, I love fixing things.",
          "link": "https://dev.to/jjenus/programming-chose-me-4dd6",
          "publishedOn": "2022-09-16T10:01:16.000Z",
          "wordCount": 1293,
          "title": "Programming chose me",
          "imageUrl": "https://dev.to/social_previews/article/1194573.png"
        },
        {
          "id": "https://dev.to/surinder_rawat/revised-php-backend-roadmap-2i3c",
          "author": "Surinder Rawat",
          "description": "Presently, the web development industry is radically different from what it was a few years back. Nowadays, there are lots of different elements that can easily baffle anyone, especially newcomers. \nAs a consequence, we decided to create a step-by-step guide demonstrating the bigger picture and providing easy-to-follow guidelines for people who want to be in certain roles in the web development industry e.g. PHP backend developer! \nFor anyone who desires to become a PHP backend developer, a roadmap is a must to have in order to succeed. However, a backend roadmap earlier was merely a recommendation of technologies with no clear indication of their order of priority. \nTo clear the woes, we are sharing a revised PHP backend roadmap to give you a better idea of how the learning process should…",
          "link": "https://dev.to/surinder_rawat/revised-php-backend-roadmap-2i3c",
          "publishedOn": "2022-09-16T09:50:44.000Z",
          "wordCount": 2372,
          "title": "Revised PHP Backend Roadmap",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--wIj2dEfM--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/l17fhjbcqq229scft2jb.jpg"
        },
        {
          "id": "https://dev.to/madsstoumann/recreating-apples-color-picker-icon-20aa",
          "author": "Mads Stoumann",
          "description": "I'm currently working on a colorpicker, where a user can select a predefined theme-color:\n\nWhile this is fairly simple to code and use, there will be cases where the user needs to create a custom color.\nSo, how do you indicate that a color is custom, is not a part of the default theme-colors — and can be modified?\nI've spent quite some time investigating this, and then I discovered how Apple do it in their Notes-app: \n\nSimple and beautiful! The chosen color is displayed at the center of the circle, surrounded by an inner border and a gradient of hues.\nBut how to achieve this in CSS?\nAs always, Temani Afif has the answer.\nWe'll just replace the linear-gradient with a conic-gradient:\n.box::after {\n  content: \"\";\n  position: absolute;\n  inset: 0;\n  border-radius: inherit; \n  padding: 8px; \n  …",
          "link": "https://dev.to/madsstoumann/recreating-apples-color-picker-icon-20aa",
          "publishedOn": "2022-09-16T09:01:14.000Z",
          "wordCount": 1774,
          "title": "Recreating Apple's Color Picker Icon",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--_7I03SSZ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/j24f7f7n5ygjlhdwqn9h.jpg"
        },
        {
          "id": "https://dev.to/dustyworld666/a-beginners-guide-to-vuejs-3oa1",
          "author": "Aman Kumar",
          "description": "Intro\n\n\nHey there, everybody. In this article, I'll be showing you how you can start your journey with VueJS, a popular front-end framework. This guide will help you understand the basics of VueJS to a level where you'll be able to carry on with it and build some awesome projects.\nIf you go to their official website, it is written that:\nVue (pronounced /vjuː/, like view) is a JavaScript framework for building user interfaces. It builds on top of standard HTML, CSS, and JavaScript, and provides a declarative and component-based programming model that helps you efficiently develop user interfaces, be it simple or complex.\nA few things we understand from it are:\nIt's a front-end framework like React or Angular.\nIt provides a declarative and component-based programming model. Here declarative …",
          "link": "https://dev.to/dustyworld666/a-beginners-guide-to-vuejs-3oa1",
          "publishedOn": "2022-09-16T08:36:56.000Z",
          "wordCount": 2628,
          "title": "A beginner's guide to VueJS",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--KwlAhcmv--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/9aetblxkrym4iu8f77ww.jpg"
        },
        {
          "id": "https://dev.to/john_alex/how-to-use-data-science-to-create-a-better-customer-experience-4n2p",
          "author": "John Alex",
          "description": "Introduction\nOf course, enhancing customer service is essential to having a competitive edge over other B2C companies. With today's cutting-edge technology, data science has swiftly established itself as a powerful tool for enhancing the consumer experience. In essence, data science combines statistics, analysis, and machine learning to make sense of data.\nIt is an all-encompassing phrase frequently used interchangeably with \"business analytics\" and \"predictive modeling,\" It can completely alter how companies engage with their customers.\nNevertheless, many businesses have not yet included any kind of data science services in their business plans. This can result from a vague understanding of how data science might improve consumer engagement. \nThe main benefits of data science for your bus…",
          "link": "https://dev.to/john_alex/how-to-use-data-science-to-create-a-better-customer-experience-4n2p",
          "publishedOn": "2022-09-16T07:48:26.000Z",
          "wordCount": 1668,
          "title": "How to Use Data Science to Create a Better Customer Experience?",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--vlElALAJ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/6yhuatxvh0akic5is18n.jpg"
        },
        {
          "id": "https://dev.to/dailydevtips1/google-actions-recap-1110",
          "author": "Chris Bongers",
          "description": "For those paying attention, you would have probably noticed that Google's conversational actions are already being deprecated.\nA little bit unclear what the exact reasoning is, but it seems Google wants to drive more on structured data than individually made apps.\nHowever, it was still a grand experiment to play around with and some new techniques to learn.\nIf you did make a Google action, you'd have till June 13, 2023, to work with them.\nRead more in Google's statement\nIn a previous article, we also deployed our Google action. I wanted to jump back on that and give you an update quickly.\nMy Action, unfortunately, got rejected.\nThe first reason was that I submitted the app with the wrong claims. I included an Immersive Canvas tag, but don't use any of that.\nThe second reason is likely more the official reason why it won't ever be accepted.\n\"We don't allow Actions whose primary purpose is to drive affiliate traffic to a website or provide a webview of a website without permission from the website owner or administrator.\nI'm a bit surprised by the \"without permission\" part as it's my website, and I even verified it within the Action.\nAll and all, I'm not sad about it. It was a fantastic experience. Maybe I'll even contact them to verify why it's not allowed to add links to your website.\nAs mentioned, it looks like Google is pushing more to structured data, so perhaps it's good to see how we can optimize the structured data on a website.\nI'll probably take time to review that in some upcoming articles.\nIf you did manage to build a Google action with the help of these articles, please let me know, as I'd love to see what others have made.\nThank you for reading my blog. Feel free to subscribe to my email newsletter and connect on Facebook or Twitter",
          "link": "https://dev.to/dailydevtips1/google-actions-recap-1110",
          "publishedOn": "2022-09-16T07:02:31.000Z",
          "wordCount": 1581,
          "title": "Google actions recap",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--kguqxfkK--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/r50xhynz5tr0bj7h5ij8.jpg"
        },
        {
          "id": "https://dev.to/scrapingdog/web-scraping-with-python-an-ultimate-guide-5gf6",
          "author": "Scrapingdog",
          "description": "If you are a beginner in a web scraping world then you might get overwhelmed with the amount of libraries offered by any programming language. Web scraping can be very useful for you or your company as it can offer enormous amount of data which can be used for better decision making. \nBut before that you need to master web scraping and I am pretty sure if you are starting with web scraping then you are doing it with python. It is a great library with a huge community support. It offers so many libraries that one might get confused to start with.\nThese are the most useful libraries in python for web scraping:\nRequests\nScrapy\nBeautifulSoup\nMechanical Soup\nLXML\nXPATH\nRegular Expression\nSelenium\nSocket\nUrllib3\nYou have to master one library which can make HTTP request and other one which can extract target data out of the raw data. I started with Requests and BS4. These libraries are pretty flexible and you can scrape data in no time with them. You just need to select a website for learning purpose and with a small effort you can learn web scraping with python.",
          "link": "https://dev.to/scrapingdog/web-scraping-with-python-an-ultimate-guide-5gf6",
          "publishedOn": "2022-09-16T06:38:21.000Z",
          "wordCount": 1265,
          "title": "Web Scraping With Python (An Ultimate Guide)",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--TH9Zj5B5--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/k1xuqjo1xvxf6ebiwa25.png"
        },
        {
          "id": "https://dev.to/ashishdonga/its-2022-please-dont-just-use-consolelog-anymore-2oel",
          "author": "Ashish donga",
          "description": "It is 2022 and still you use console.log then this guide for you\n5 JavaScript console object methods and tricks you should know about.\nAs a front-end engineer, you must have used console.log, which can help us print auxiliary information on the console to troubleshoot problems.\nBut do you know any other secrets about the console object?\nThis article will introduce 5 practical tips for using the console object, I hope you will like them\n1.1 Basic usage skills\nconsole.log() is the method we use most often in our work, and you can use it anywhere in JavaScript.\n`\nconst name = 'fatfish'\nconsole.log(name, age)\nBut when the amount of printed information becomes very large, the information becomes unintuitive. Because we don’t know what it refers to\nconst name = 'fatfish'\nconst age = 24\nconst job…",
          "link": "https://dev.to/ashishdonga/its-2022-please-dont-just-use-consolelog-anymore-2oel",
          "publishedOn": "2022-09-16T05:48:45.000Z",
          "wordCount": 1784,
          "title": "It’s 2022, Please Don’t Just Use “console.log” Anymore 😎",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--JCoLT-_l--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/gkurlhm161ew6xkje3ay.jpg"
        },
        {
          "id": "https://dev.to/uchihaitachi0/leetcode-217-contains-duplicate-dsa-4-592m",
          "author": "Anubhav Shukla",
          "description": "Question Link\n\n\nPython || C++ || TypeScript\nThis approach is very simple, so I am not going to waste much time in this approach\nWe take one element and compare it with all the other elements.\nWe do this for all the elements.\ndef containsDuplicateMethod1(nums: list[int]) -> bool:\n    length = len(nums)\n    for i in range(length):\n        for j in range(i + 1, length):\n            if nums[i] == nums[j]:\n                return True\n    return False\n\nTime Complexity: O(n^2)\nSince we have to find the duplicate elements, so we can sort the array and then find the duplicate elements.\nFor example: nums = [1, 2, 3, 1]\nAfter sorting: nums = [1, 1, 2, 3]\nNow we can find the duplicate elements by comparing the adjacent elements.\ndef containsDuplicateMethod2(nums: list[int]) -> bool:\n    nums.sort()\n    length = len(nums)\n    for i in range(length - 1):\n        if nums[i] == nums[i + 1]:\n            return True\n    return False\n\nTime Complexity: O(nlogn)\nThis method is also very easy to understand.\nWe create a Set.\nWe traverse the array and check if the element is present in the Set or not.\nIf the element is present in the Set then we return True.\nIf the element is not present in the Set then we add the element in the Set.\nIf we traverse the whole array, and we don't find any duplicate element then we return False.\ndef containsDuplicateMethod3(nums: list[int]) -> bool:\n    storage = set()\n    for value in nums:\n        if value in storage:\n            return True\n        storage.add(value)\n\n    return False\n\nTime Complexity: O(n)\ndef containsDuplicateMethod4(nums: list[int]) -> bool:\n    return len(nums) != len(set(nums))",
          "link": "https://dev.to/uchihaitachi0/leetcode-217-contains-duplicate-dsa-4-592m",
          "publishedOn": "2022-09-16T05:28:19.000Z",
          "wordCount": 1385,
          "title": "Leetcode 217. Contains Duplicate. DSA - #4",
          "imageUrl": "https://dev.to/social_previews/article/1194777.png"
        },
        {
          "id": "https://dev.to/aldora/funcool-developers-readings-2eia",
          "author": "Aldora",
          "description": "Julia Evans:  Explain computer basics with comics\n\n\nPosts\nComics\nCrypto Challenges: A collection of exercises to learn about crypto.\nGolden: : Web3 version wikipedia, a protocol mapping the world’s knowledge.\nTextbook for System Design Interviews: Still in progress, a step-by-step illustrated guide for system design interview questions.\nI will keep updating this list at here",
          "link": "https://dev.to/aldora/funcool-developers-readings-2eia",
          "publishedOn": "2022-09-16T05:11:06.000Z",
          "wordCount": 1092,
          "title": "Fun&Cool Developer's Readings",
          "imageUrl": "https://dev.to/social_previews/article/1194714.png"
        },
        {
          "id": "https://dev.to/devsimc/15-best-terminal-commands-that-you-should-know-110g",
          "author": "simc dev CSM®",
          "description": "List of Best Commands For Terminal\nPWD(present working directory)\ncd(change directory)\nls\nmkdir(make directory)\necho\ntouch\ncat\ndiff\nhead\ntail\nrm(remove directory)\nclear\nRedirection operators (> & >>)\ncp\nmv\nPWD command stands for present working directories from your computer device. It reflects your prevailing location to the file.\nSyntax of PWD:\npwd -L: Prints the symbolic path.\npwd -P: Prints the actual path.\n\nCD command stands for changing your directory from your current location.\nIt is used to change your current location on the computer by selecting a different part in your pc. But you want to define the particular part below to change your location. It's one of the best commands for terminal.\nAnd there are some tricks to go back and ahead. If you want to go back simply type the .. f…",
          "link": "https://dev.to/devsimc/15-best-terminal-commands-that-you-should-know-110g",
          "publishedOn": "2022-09-16T04:31:16.000Z",
          "wordCount": 1940,
          "title": "15 Best Terminal Commands That You Should Know",
          "imageUrl": "https://dev.to/social_previews/article/1194703.png"
        }
      ]
    },
    {
      "title": "小众软件",
      "feedUrl": "https://feeds.appinn.com/appinns",
      "siteUrl": "https://www.appinn.com",
      "articles": [
        {
          "id": "https://www.appinn.com/?p=43344",
          "author": "青小蛙",
          "description": "AList 是一款支持 18 款常见网盘的的文件列表工具，它可以让用户直接在浏览器中预览文件、上传文件、下载文件、播放视频、浏览照片，也可以直接在播放器中打开视频文件，还可以配合 aria2 实现文件",
          "link": "https://www.appinn.com/alist-file-list-program/",
          "publishedOn": "2022-09-16T08:50:48.000Z",
          "wordCount": 2390,
          "title": "AList – 聚合阿里云盘、百度网盘、PikPak、WebDav 等 18 款网盘：文件预览、上传/下载，直接播放视频",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-16T150310.322.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43338",
          "author": "青小蛙",
          "description": "土豆录屏是一款简单易用，不限制时长、无水印，支持多显示器的免费 Windows 录屏工具。@Appinn 来自发现频道，开发者自荐。 土豆录屏 土豆录屏界面简单，细节做的还不错，在发现频道反馈很赞。有",
          "link": "https://www.appinn.com/tudou-luping/",
          "publishedOn": "2022-09-15T06:04:28.000Z",
          "wordCount": 2257,
          "title": "土豆录屏 – 支持多显示器的免费录屏工具[Windows]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-15T134533.856.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43323",
          "author": "青小蛙",
          "description": "对于开发者来讲，每天都要和各种编程 IDE 和开发工具打交道。想必一定听说过 JetBrains 公司，或旗下的产品：IntelliJ IDEA、PyCharm、WebStorm 等。 不久前，Jet",
          "link": "https://www.appinn.com/jetbrains-2209/",
          "publishedOn": "2022-09-14T12:25:05.000Z",
          "wordCount": 2346,
          "title": "JetBrains 系列即将涨价，抓紧最后的好价入手！",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-14T202004.358.png"
        },
        {
          "id": "https://www.appinn.com/?p=43317",
          "author": "青小蛙",
          "description": "小周打印纸是一款微信小程序，内置了 74 款纸张模板，包括田字格、作业本、信纸、分镜表、拼音纸、计划表等样式，可直接保存为图片，并最终打印出来使用，实体打印。@Appinn 青小蛙在小众软件微博上提问",
          "link": "https://www.appinn.com/xiaozhou-printer-wechat-miniapp/",
          "publishedOn": "2022-09-14T09:22:51.000Z",
          "wordCount": 2391,
          "title": "小周打印纸 – A4 纸张模板：田字格/拼音、作业本、信纸、分镜表等 74 款可打印[微信小程序]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-14T164644.415.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43296",
          "author": "青小蛙",
          "description": "锁屏启动 是一款由 @自力hzlzh 刚刚发布的 iOS 16 专属应用，利用 iOS 16 的新功能锁屏小组件，实现在锁屏界面启动健康码、行程码、付款码、快捷指令、任意应用、自定义 URL Sche",
          "link": "https://www.appinn.com/lock-launcher-for-ios-16/",
          "publishedOn": "2022-09-13T04:08:52.000Z",
          "wordCount": 2568,
          "title": "锁屏启动 – iOS 16 锁屏小组件：在锁屏界面启动健康码、行程码、付款码、快捷指令[内购限免]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-13T111615.462.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43289",
          "author": "青小蛙",
          "description": "RSSPush 是一款基于 Docker 部署的自托管服务，它能够将 RSS 实时推送至微信（基于 Server酱，支持关键词过滤），支持 RSSHub 生成的 RSS 地址。近日更是整合了 Appr",
          "link": "https://www.appinn.com/rsspush/",
          "publishedOn": "2022-09-12T09:44:41.000Z",
          "wordCount": null,
          "title": "RSSPush – 将 RSS 实时推送至微信，以及大多数主流服务（IFTTT、Telegram、Slack 等）",
          "imageUrl": null
        },
        {
          "id": "https://www.appinn.com/?p=43283",
          "author": "稻米鼠",
          "description": "最近写了几枚小脚本，是那种很没有存在感的小脚本，然后恰好遇到了一些令人感慨的事情，所以出来聊聊天。@Appinn 事情的起因在这里：https://meta.appinn.net/t/topic/36",
          "link": "https://www.appinn.com/making-links-better/",
          "publishedOn": "2022-09-11T08:26:40.000Z",
          "wordCount": null,
          "title": "[油猴脚本]让链接变得更好系列",
          "imageUrl": null
        },
        {
          "id": "https://www.appinn.com/?p=43280",
          "author": "青小蛙",
          "description": "来自发现频道，@gezhong.vip 同学发布了一款名为中高风险疫情地区-API接口的在线服务，提供了更容易检索、更直观的各地疫情风险等级查询功能。@Appinn 开发者提到： 由于官方的查询界面太",
          "link": "https://www.appinn.com/arearisklist/",
          "publishedOn": "2022-09-11T07:51:33.000Z",
          "wordCount": 2234,
          "title": "更易检索的「中高风险地区查询」工具，支持 API",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-11T153938.981.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43277",
          "author": "青小蛙",
          "description": "Seal 是一款简单的开源 Android 在线视频下载器、音频提取器，内嵌 yt-dlp 与 aria2c，支持封面、字幕、播放列表等功能，Material Design 3 设计风格。@Appin",
          "link": "https://www.appinn.com/seal-online-video-download/",
          "publishedOn": "2022-09-10T08:18:10.000Z",
          "wordCount": null,
          "title": "Seal – 内嵌 yt-dlp 与 aria2c 的开源 Android 在线视频下载器（音频提取）",
          "imageUrl": null
        },
        {
          "id": "https://www.appinn.com/?p=43264",
          "author": "青小蛙",
          "description": "今天早上 @alenh 同学的一个帖子：非常喜欢 SimpleDiagrams 软件绘画出来的效果，但苦于软件有使用时间限制，有没有解决方法或类似软件替代，谢谢，让青小蛙才发现这样一款有趣的软件。但开",
          "link": "https://www.appinn.com/simplediagrams-byebye/",
          "publishedOn": "2022-09-09T05:14:30.000Z",
          "wordCount": null,
          "title": "记一款有趣软件的离开：SimpleDiagrams",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Linux 中国◆开源社区",
      "feedUrl": "https://linux.cn/rss.xml",
      "siteUrl": "https://linux.cn/",
      "articles": [
        {
          "id": "https://linux.cn/article-15038-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Linus Torvalds 称他不是工作狂，格雷才是\n\r\n在 LPC 2022 上，Linux 创始人 Linus Torvalds 谈到了工作。他说他不是工作狂，在参加这次会议前花了六天时间在玩潜水。他说，他可以一年又一年在内核上工作是因为他可以短时间离开放松下，最筋疲力尽的时候通常是合并开始时，而 Linux 内核社区真正的工作狂是稳定版内核维护者 GKH（格雷），每周都不停的工作。他也介绍了外出旅行时的装备，他使用一台 M2 MacBook Air 笔电，运行 Fedora Workstation 36。Fedora 还没有支持 ARM-64 M2 处理器的版本，他自己动手让 Fedora 36 能运行在 M2 上，这个版本不完美，不支持 3D 图形，Chrome 也不支持。\n\r\n\r\n消息来源：ZDNet\n\r\n\r\n\r\n老王点评：一个可以坚持 30 年的不是工作狂的工作狂。\n\r\n\r\n\n\r\n以太坊合并完成，为全球电力节省了 0.2%\n\r\n2022 年 9 月 15 日，以太坊准备了 8 年之久的从 PoW 切换到 PoS 顺利完成。此次合并只是对以太坊进行一系列升级的第一步，而接下来还将实施另外四个开发阶段。最终目的是让以太坊的扩展性更好、速度更快、使用成本更低。据报告，此前以太坊网络每年消耗约 2300 万兆瓦时的能源，合并后，可将以太坊的二氧化碳排放总量减少 99.992%。Vitalik 称，这降低了全球电力消耗 0.2%。不过，显然相当多的以太坊矿工转移到了继续采用 PoW 的 ETC 网络上了。\n\r\n\r\n消息来源：CCRI\n\r\n\r\n\r\n老王点评：合并是成功了，未来是不是成功不好说。\n\r\n\r\n\n\r\nCloudflare 放弃 Nginx 代理服务器\n\r\n长期以来，Cloudflare 都依赖于 Nginx 作为其 HTTP 代理堆栈的一部分。但现在，其已替换为由 Rust 编写的自研 Pingora 软件。该公司宣称，Pingora 每日可处理超过一万亿次请求。在提供更高性能的同时，CPU 和内存资源的开销还仅为旧方案的三分之一。不过，Pingora 尚未开源 —— 尽管 Cloudflare 表示其正在制定计划。\n\r\n\r\n消息来源：Phoronix\n\r\n\r\n\r\n老王点评：当年掀翻了 Apache 的 Nginx ，终有一天也会被其它的 Web 服务器掀翻。",
          "link": "https://linux.cn/article-15038-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-16T08:10:57.000Z",
          "wordCount": 518,
          "title": "硬核观察 #761 Linus Torvalds 称他不是工作狂，格雷才是",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15037-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "一个名为 GNU LibreJS 的 Firefox 浏览器扩展程序旨在自动阻止非自由软件的大型 JavaScript 脚本。与 NoScript 相比，GNU LibreJS 的操作也类似。主要的区别特征之一是 NoScript 在默认情况下会阻止大多数 JavaScript 脚本，而 GNU LibreJS 针对的非自由软件的大型 JavaScript 脚本。\n\r\nGNU LibreJS 源于 Richard Stallman 的一篇名为《JavaScript 陷阱》的文章。Stallman 认为，运行在浏览器上的非自由软件，主要是用 JavaScript 编写的，也有用其他语言编写的。这些应用程序有许多是专有软件或者不开源的，更有甚者其中不乏一些有害的或有问题的程序。Stallman 声称 Google 文档使用的 JavaScript 程序的大小为半兆字节。它是压缩过的，想要理解和分析这样的程序就很具有挑战性。Stallman 将监控用户的 JavaScript 代码称为恶意软件。\n\r\nStallman 建议不要运行那些复杂的或非常消耗处理能力的 JavaScript。从外部页面加载的脚本、修改 DOM 的脚本以及对 eval 的调用，都是符合上面描述的 JavaScript 代码的例子。GNU 网站发布了一个（符合上述描述的）列表。当 GNU LibreJS 安装在 Firefox 和其他兼容的浏览器中时，它会为用户做出这些区分。它会启用那些小型的 JavaScript，并阻止它认为非自由软件的大型 JavaScript 代码。\n\r\n该扩展添加了一个工具栏图标，指示页面上存在多少被阻止的 JavaScript 引用。除了更改整个网站或特定脚本或代码段状态的控件外，单击会显示接受和阻止的 JavaScript。可以将整个网站以及特定脚本或代码片段列入白名单或黑名单。扩展程序会记住之前的设置。提供了显示 JavaScript 代码的选项，以及撤销所有自定义设置或单个自定义设置的选项。\n\r\n\r\nvia: https://www.opensourceforu.com/2022/09/gnu-librejs-for-firefox-stops-non-free-non-trivial-javascript/\n\r\n作者：Laveesh Kocher 选题：lkxed 译者：littlebirdnest 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15037-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-16T06:56:16.000Z",
          "wordCount": 501,
          "title": "屏蔽非自由软件的大型 JavaScript 脚本的浏览器扩展",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15036-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Lapce 是一个用 Rust 构建的开源代码编辑器。它正处于早期开发阶段，但看起来很有前途！\n\r\n\r\n\n\r\n有很多开源的代码编辑器可用于 Linux。\n\r\n你对换一种选择有什么看法：一个专注于性能的基于 Rust 的开源代码编辑器？\n\r\n它应该是激动人心的，对吗？\n\r\nLapce 就是这样一个正在开发的项目，它的目标是开发出一个功能丰富、速度快的代码编辑器，作为微软的 Visual Studio Code 的替代品。\n\r\n开发者还提到，它的灵感来自于 Xi-editor（它已不再处于活跃开发状态）。\n\r\nLapce 处于 pre-alpha 阶段\n\r\n\n\r\n虽然 Lapce 还不是一个完整的产品，但它有很多东西可以提供。\n\r\n因此，随着稳定版本的接近，我们得到的东西应该是有趣的。\n\r\n值得强调的功能包括：\n\r\n\r\n命令面板（快速操作）。\n\r\n自定义用户界面字体、标题高度、字体阴影、滚动宽度等。\n\r\n内置终端。\n\r\n类似 Vim 的模态编辑。\n\r\n连接到远程计算机。\n\r\n代码语法高亮，代码不全，以及类似功能。\n\r\n插件系统。\n\r\n深色/浅色模式。\n\r\n\r\n虽然它专注于性能，但在用户体验方面看起来不错（尽管它不完整）。\n\r\n\n\r\n如果用户能够获得一个代码编辑器所期望的所有基本功能，以及一个性能更好的应用，Lapce 很快就会成为一个受欢迎的选择。\n\r\n下载 Lapce\n\r\nLapce 在 Linux、macOS 和 Windows 中有 pre-alpha 版本。\n\r\n对于 Linux，你只需要下载并解压 tar.gz 包，然后使用 GUI 或终端运行 Lapce 可执行文件。\n\r\n目前，它正在积极开发中。你可以为你的平台下载软件包并进行测试，但你应该预期会出现 bug 和新的版本。探索它的 GitHub 页面 以获得更多信息。\n\r\n\r\nLapce\n\r\n\r\n我在 Pop!_OS 22.04 LTS 上试用了它，发现用户界面冻结了几次。然而，它所提供的功能似乎令人印象深刻。\n\r\n💬 你对 Lapce 作为一个用 Rust 构建的开源代码编辑器有什么看法？你认为你会考虑它而不是你目前的最爱吗？请在下面的评论中分享你的想法。\n\r\n\r\nvia: https://news.itsfoss.com/lapce-code-editor/\n\r\n作者：Ankush Das 选题：lkxed 译者：geekpi 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15036-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-16T00:56:13.000Z",
          "wordCount": 510,
          "title": "Lapce：一个开发中的快速、轻量级的开源代码编辑器",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15035-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "本指南旨在帮助你了解如何在流行的浏览器，如 Firefox、谷歌 Chrome、Chromium 和微软 Edge 中启用深色模式。\n\r\n\r\n\n\r\n我们都喜欢深色模式。许多人喜欢它，而不是标准的浅色模式。虽然许多桌面应用提供了原生的深色模式，但一些应用通过桌面环境的基础模式适应深色模式。\n\r\n你不能否认，我们都在浏览器上花了好多时间。我们很少使用桌面应用（除非你是在工作，如视频编辑等）。因此，当你在浏览器上花很多时间阅读和学习时，你应该也可以选择深色模式。但是，对于各个浏览器，稍微有点不同。\n\r\n本指南为你提供简单的步骤，你可以按照这些步骤在 Mozilla Firefox、Chromium、Chrome 和 Edge 浏览器中启用深色模式。\n\r\n在浏览器中启用深色模式\n\r\n在 Firefox 中启用深色模式\n\r\n打开 Firefox ，点击右上角的设置菜单。\n\r\n点击 “设置Settings > 扩展和主题Extension and Themes”。\n\r\n选择“深色主题Dark Theme”并点击“启用enable”。然后你应该看到深色模式被应用到 Firefox。\n\r\n\n\r\n\n\r\n要恢复它，按照同样的步骤，选择浅色主题。\n\r\nChromium 和 Chrome 的深色模式\n\r\nChromium 或 Chrome 默认不预装任何深色主题。因此，你需要去 Chrome 商店，下载任何你想要的深色主题。在本指南中，我将推荐 “Morpheon Dark” 主题，它有超过一百万用户在使用它。\n\r\n从 Chromium 浏览器中打开 Morpheon Dark 主题页面（从以下链接）。\n\r\n\r\nChrome 网络商店中的 Morpheon Dark 主题\n\r\n\r\n点击“添加到 ChromeAdd To Chrome” 按钮。它应该会在 Chrome 中启用。\n\r\n你可能想探索 Chrome 网络商店中的其他黑白或深色主题。请访问此页面，查看所有的深色主题集合 。\n\r\n然而，你应该记住一件事：这个主题不会改变设置或上下文菜单。这很明显。因为它只是改变了浏览器窗口，而那些菜单是操作系统本身的一部分（有时）。\n\r\n\n\r\n对 Google Chrome 也要按照同样的步骤进行。\n\r\nEdge 浏览器的深色模式\n\r\n然而，微软 Edge 浏览器 默认带有更好的深色主题。它允许你从设置中使用 GTK+、浅色和深色模式。\n\r\n打开 Edge 浏览器\n\r\n点击右上角的三个小圆点。\n\r\n进入“外观Appearance”，选择“深色Dark”。这就完成了。\n\r\n这个 Edge 的深色主题实现得更好，因为它改变了上下文菜单和地址栏。\n\r\n\n\r\n结束语\n\r\n如果你是一个高级用户，你可能不需要这个指南。你可以搞清楚。\n\r\n但我们为所有的读者涵盖了所有从基础到高级的教程。许多新的 Linux 用户可能也不知道如何在浏览器中启用深色模式。\n\r\n因此，话虽如此，我希望这能帮助你和其他人。如果你遇到任何麻烦，请在下面的评论栏里告诉我。\n\r\n\r\nvia: https://www.debugpoint.com/dark-mode-browser/\n\r\n作者：Arindam 选题：lkxed 译者：geekpi 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15035-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-15T15:21:00.000Z",
          "wordCount": 524,
          "title": "如何在浏览器中启用深色模式",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15034-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "DeepMind 研究员论文称 AI 将消灭人类\n\r\n来自谷歌 DeepMind 和牛津大学的研究人员发表的一篇新论文称，超级智能的 AI “很可能” 会给人类带来生存灾难。这篇论文设想地球上的生命将变成人类与超级先进的机器之间的零和游戏。他们认为，在一个资源有限的世界里，对这些资源的竞争是不可避免的。在未来的某个时刻，监督某些重要功能的高级 AI 可能被激励想出作弊策略，以损害人类的方式获得其奖励。\n\r\n\r\n消息来源：VICE\n\r\n\r\n\r\n老王点评：虽然可以按照阿西莫夫机器人三定律的原则设计一些 AI 自限的规则，不过，说到底，还是要让 AI 认为人类的存在是必要的才行。\n\r\n\r\n\n\r\nAI 机器人在论坛模仿发帖，导致用户互相指责对方是机器人\n\r\n一位 YouTube 主播利用论坛的内容训练了一个 AI 语言模型，并将该 AI 模型用于 10 个机器人程序，然后在 24 小时内发了 1.5 万个论坛帖子。这些机器人虽然偶尔会犯错，但该论坛的用户花了两天时间才注意到问题，并识别出了其中一个机器人账号。机器人账号导致了用户之间的不信任，即使在关闭了这些机器人之后，用户彼此之间仍然会指责对方是机器人。\n\r\n\r\n消息来源：Solidot\n\r\n\r\n\r\n老王点评：过去是安能辨我是雌雄，现在是谁知道你是不是个机器人呢？\n\r\n\r\n\n\r\n微软 Teams 以明文方式存储授权令牌\n\r\n安全分析师在微软 Teams 的桌面应用程序中发现了一个严重的安全漏洞，它在 Windows、Linux 和 Mac 中以明文方式存储授权令牌，使威胁者能够访问认证令牌和开启了多因素认证（MFA）的账户。研究人员在 2022 年 8 月发现了这个问题，并向微软报告。然而，微软并不同意这个问题的严重性，并表示它不符合打补丁的标准。由于微软不准备提供补丁修复，专家建议用户改用浏览器版本的微软 Teams 客户端。\n\r\n\r\n消息来源：BleepingComputer\n\r\n\r\n\r\n老王点评：或许微软有自己的逻辑，不过微软这种否认后再提供补丁的事情也不少。\n\r\n\r\n回音\n\r\n\r\n美国财政部上个月宣布制裁混币器 Tornado Cash 后引来了反对诉讼，现在它 澄清 制裁不涉及源代码，美国人可以查看、复制、讨论和教授源代码，或将源代码包含在书面出版物中。",
          "link": "https://linux.cn/article-15034-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-15T05:20:25.000Z",
          "wordCount": 489,
          "title": "硬核观察 #760 DeepMind 研究员论文称 AI 将消灭人类",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15033-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "经过两年的发展，自由开源的照片编辑器 PhotoDemon 的作者已推出了 PhotoDemon 9.0。新版本增强了用户界面，内置了对 Adobe Photoshop 插件的支持，支持了新的图像格式，减少了资源使用等等。根据用户在 “工具Tools > 选项Options > 更新Updates” 下的设置，已经安装了 PhotoDemon 9.0 可以自动收到更新推送。你也可以选择通过 “帮助Help > 检查更新Check for Updates” 手动更新。\n\r\nPhotoDemon 这个便携程序提供压缩包下载。解压到系统，就能启动这个照片编辑器。可能最新版本会让Windows 可能会发出 SmartScreen 警告，VirusTotal 上的两个不太知名的杀毒软件也会报毒（以上都是误报）。新的 PhotoDemon 消耗的资源比以前的版本少，这是它的优点之一。例如，它在冷启动后使用的内存也比以前的版本少 12%。\n\r\n用过老版本的用户切换到新版本可能会立即注意到新的界面。比如大多数选项现在都以弹出的方式显示，最常用的工具显示在工具栏上。根据作者的说法，新的用户界面使用了“旧版本不到一半的垂直空间”，而且不会牺牲功能。\n\r\n用户界面仍然可以适配各种显示分辨率，包括 1024×768 这样的传统分辨率。且新版本中打开的照片会有更多空间。在早期的版本中，照片编辑器的选择工具表现出色。最新版本中包含对多选区的支持。添加选区、减去选区和相交选区可用于组合选择，即使在多个选区处于活动状态时，你仍然能编辑刚创建的选区。\n\r\n内容填充工具，通常称为智能对象移除或涂抹，是另一个新功能。要使用它，用户可以选择 “编辑Edit > 内容填充Content-aware fill” 或 “选择Select > 修复选区Heal selected region”。虽然该工具是自主操作的，也能个性化一些设置和选项。该功能既不需要人工智能也不需要互联网连接。事实上，正因为如此，如果多次运行该工具可能会带来更好的图片。\n\r\nPhotoDemon 9.0 支持新的图像格式。新版本提供 PSP 图片、AVIF 和动画 WebP 图像的导入和导出功能。尽管有 AVIF 支持，但由于其大小，并未内置必要的编码器和解码器应用程序。用户首次加载或保存 AVIF 文件时会下载必要的数据。现在可以导入 XCF（GIMP）、SVG 和 SVGZ 格式的图像。\n\r\n最后但同样重要的是，PhotoDemon 9.0 支持无损 “quite OK”（QOI）照片、Symbian 图像（MBM 和 AIF）、漫画书档案（CBZ）和无损 JPEG（JPEG-LS）图像。作者称最新版本中的自动优化 GIF 的功能是同类产品中最佳的。新的神经网络颜色量化器也有助于依赖调色板的图像格式。\n\r\nPhotoDemon 9.0 的新增增强功能包括：\n\r\n\r\n图像调整器提供了 12 种复杂的重采样技术的实时交互式预览。\n\r\n支持内置的 Adobe Photoshop 插件（8bf）。\n\r\n完全支持 3D LUT（三维查找表）。\n\r\n新效果包括渐变流、凹凸贴图、Droste 和 Truchet 贴图。\n\r\n改进了结晶和染色玻璃的工具。\n\r\n一种新的去雾工具，用于恢复“被雾霾或雾霾破坏”的照片。\n\r\n新的用户界面和改进的工具性能曲线。\n\r\n为了“更好地匹配 Photoshop 的实现”，照片滤镜工具已经过重新设计。\n\r\n\r\n\r\nvia: https://www.opensourceforu.com/2022/09/open-source-photo-editor-photodemon-9-0-is-now-available/\n\r\n作者：Laveesh Kocher 选题：lkxed 译者：littlebirdnest 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15033-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-15T01:53:46.000Z",
          "wordCount": 537,
          "title": "开源照片编辑器 PhotoDemon 9.0 现已可供下载",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15032-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "树莓派操作系统更新，增加了对 NetworkManager 支持以及新的操作快捷方式。\n\r\n\r\n\n\r\n如果你是小型迷你计算机的狂热粉丝的话，你可能知道树莓派可以用作成熟的桌面计算机使用。此外，它也是支持各种电子/物联网项目的核心组件。\n\r\n虽然许多 Linux 发行版为树莓派提供了镜像文件，但树莓派基金会仍然提供了其官方操作系统，即 树莓派操作系统Raspberry Pi OS。\n\r\n顺便说一句，树莓派操作系统是基于 Debian 的。具体来说，当前版本是基于 Debian 11 Bullseye 的，它是采用 LXDE 作为桌面应用环境的轻量级操作系统。\n\r\n树莓派操作系统：带来了什么最新内容？\n\r\n尽管这个最新的更新并不是一个重大更新，但它仍然带来了一些有用的补充。如果你把树莓派用作桌面计算机来使用，你一定会欢迎它的。\n\r\n让我们来看看新版本提供了什么。\n\r\n主菜单的快速搜索功能\n\r\n虽然 Windows 系统和许多 Linux 发行版已经包含了这个基本功能，但树莓派操作系统之前一直没有这个功能。\n\r\n用户可以点击“树莓派”图标或键盘上的默认主机键，打开主菜单，键入要启动的应用程序的名称，就会自动出现一个新的搜索框。\n\r\n可用向上和向下箭头键来浏览菜单，用回车键选择应用。\n\r\n\n\r\n如果用户不键入任何内容，则主菜单的功能与点击“树莓派”图标以显示应用程序时的功能完全相同。\n\r\n再也不需要用鼠标光标来打开应用程序了。\n\r\n全新的键盘操作快捷方式\n\r\n就像主菜单一样，你还可以通过键盘打开 Wi-Fi 和切换蓝牙功能。\n\r\n按下 Ctrl+Alt+W 将打开 Wi-Fi 菜单，而 Ctrl+Alt+B 是用于蓝牙的。\n\r\n增强型音频输入控制\n\r\n任务栏现在将为输入和输出设备显示两个单独的图标，而不是单个默认音量图标。\n\r\n\n\r\n每当连接音频输入设备时，扬声器图标旁边也会弹出一个麦克风图标。此外，如果连接了多个音频输入设备，用户可以右键单击该图标从列表中选择设备，而左键单击将显示音量控制滑块。\n\r\n支持 NetworkManager\n\r\nNetworkManager 是许多 Linux 发行版用来处理网络功能的流行的守护程序。它包括许多功能，可帮助用户相应地调整和配置网络设置。\n\r\n如果你想进一步了解，请在此处了解有关 Linux 中守护程序的更多信息：\n\r\n\r\n什么是 Linux 中的守护进程？为什么使用它们？\n\r\n\r\n就其功能而言，引入了对 NetworkManager 的初步支持，以作为 dhcpcd 的替代选项。这意味着用户可以轻松管理 VPN 连接，而不会有太多麻烦，甚至可以将树莓派配置为一个 Wi-Fi 接入点。\n\r\n\n\r\n\r\n请注意，NetworkManager 的支持应该还在测试中。为了获得稳定的网络体验，建议用户继续使用 dhcpcd。\n\r\n如果你仍然想尝试 NetworkManager，则需要遵循一些高级步骤。但可以放心，如果在使用 NetworkManager 时遇到任何问题，可以选择切换回 dhcpcd。\n\r\n\r\n如果你想了解有关该版本的更多信息，官方发行说明 包括了更多详细信息。\n\r\n获取树莓派操作系统\n\r\n前往下面链接的官方下载页面下载新的镜像文件。\n\r\n\r\n获取树莓派操作系统\n\r\n\r\n你可以在任何系统上使用树莓派 Imager 来制作要在树莓派上使用的 microSD 卡。不管如何，你都可以单独下载树莓派操作系统文件进行设置。\n\r\n\r\nvia: https://news.itsfoss.com/raspberry-pi-os-sep-update/\n\r\n作者：Rishabh Moharir 选题：lkxed 译者：zjsoftceo 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15032-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-15T01:10:54.000Z",
          "wordCount": 520,
          "title": "新树莓派操作系统更新带来一些不错的小改进",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15031-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "MGLRU 页面回收算法有望并入 Linux 6.1 内核\n\r\nLPC 2022 上，谷歌工程师披露了 MGLRU 项目的最新进展。作为当前 Linux 内核页面回收代码的一个更好替代方案，如果 MGLRU 能够在 2022 年进入 Linux 6.1，那它也将成为年内最激动人心的创新之一。从 ChromeOS / Android，到台式机、工作站、甚至服务器领域，MGLRU 普遍能够在各项工作负载和各类硬件平台上提供更好的性能。一旦进入主线，它的下一个改进是让 MGLRU 达到可以安全地默认启用的程度。\n\r\n\r\n消息来源：Phoronix\n\r\n\r\n\r\n老王点评：在这次 LRC 大会上，谷歌宣讲了好几个重量级的技术进展。\n\r\n\r\n\n\r\n到 2030 年，软件将占拖拉机公司约翰迪尔收入的 10%\n\r\n美国农机巨头约翰迪尔公司的所有拖拉机和收割机都标准配有自动驾驶功能。该公司现在计划在几年内将 150 万台机器和 5 亿英亩的土地连接到其运营中心，并将之前销售的没有自动驾驶功能的拖拉机升级自动驾驶功能。尽管农民已经在为运营成本，如化肥和燃料，而苦苦挣扎，但该公司希望为运营其越来越智能的车辆出售软件订阅。分析师估计，农用软件的平均毛利率为 85%，而设备销售的毛利率为 25%。\n\r\n\r\n消息来源：The Register\n\r\n\r\n\r\n老王点评：软件和硬件哪个重要？从汽车到拖拉机，纷纷采用软件订阅，这是不是说明软件越来越重要，而且软件的利润也更高。\n\r\n\r\n\n\r\n谷歌在欧洲面临 250 亿欧元的反垄断罚款\n\r\n谷歌是最大也是最重要的广告技术提供商，市场份额超过九成。欧盟以及英国的监管机构正在调查谷歌是否滥用其在数字广告市场的支配地位，可能导致其面临 250 亿欧元的反垄断罚款。去年法国的反垄断监管机构对谷歌开出了 2.2 亿欧元的罚单。\n\r\n\r\n消息来源：BBC\n\r\n\r\n\r\n老王点评：真是树大招风啊，谷歌太有钱了。",
          "link": "https://linux.cn/article-15031-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-14T09:46:21.000Z",
          "wordCount": 483,
          "title": "硬核观察 #759 MGLRU 页面回收算法有望并入 Linux 6.1 内核",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15030-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "pyp2rpm 使得创建 RPM 包的过程更加自动化。\n\r\n\r\n当你安装一个应用程序时，你通常是在安装一个软件包，其中包含应用程序的可执行代码和重要文件，如文档、图标等。在 Linux上，软件一般被打包成 RPM 或 DEB 等格式，用户只要通过 dnf 或者 apt 等命令就可以进行安装了，这取决于你使用的 Linux 发行版。然而几乎每天都有新的 Python 模块发布，因此你很容易遇到一个尚未打包的 Python 模块。这就是 pyp2rpm 存在的意义了。\n\r\n最近我在尝试安装一个叫 python-concentration 的模块，但是进展并不太顺利：\n\r\n$ sudo dnf install python-concentration\r\nUpdating Subscription Management repositories.\r\nLast metadata expiration check: 1:23:32 ago on Sat 11 Jun 2022 06:37:25.\r\nNo match for argument: python-concentration\r\nError: Unable to find a match: python-concentration\r\n\n\r\n虽然这是一个发布在 PyPi 的包，但它仍不能被打包成 RPM 包。好消息是你可以使用 pyp2rpm 以一个相对简单的过程将它打包成 RPM 包。\n\r\n首先你需要设置两个目录：\n\r\n$ mkdir rpmbuild\r\n$ cd rpmbuild && mkdir SPECS\r\n\n\r\n像这样去安装 pyp2rpm：\n\r\n$ sudo dnf install pyp2rpm\r\n\n\r\n1、生成 spec 文件\n\r\nRPM 包的基础是一种 spec 文件，这个文件包含你创建这个包的所有信息，如所需的…",
          "link": "https://linux.cn/article-15030-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-14T07:51:19.000Z",
          "wordCount": 851,
          "title": "4 步打包一个新的 Python 模块",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15027-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "开源贡献者 Hari Rana 表达了他对传统 Linux 软件包格式不再适合现代应用的看法。\n\r\n\r\n\n\r\n图片来源：来自 Unsplash 的 Kelli McClintock\n\r\n我多次遇到用户抱怨 LTS 和稳定版的应用软件包有问题，但又声称开发版从来没有发生过这种事情。然而，以我在软件包技术方面的经验和知识，我不能不强调，这是不对的。\n\r\n发行模式不是问题的根源所在，根本的问题是传统的软件包格式不适合现代的图形应用，不管是什么发行版。那么像 Nix 和 Flatpak 这样的格式是如何解决这些基本问题的？有趣的是，大多数服务器确实利用了容器化（即 Docker），因为它提高了可重复性并增强了可维护性。我们可以从中得到启发，采用一个适用于 Linux 桌面的类似标准。\n\r\n免责声明\n\r\n\r\n“传统软件包”是指使用包管理器发布的图形应用程序，而不使用容器，如 apt、dnf、pacman 等。\n\r\n“发行模式”是指发行过程，如长期支持版（LTS）、稳定版和开发版等。\n\r\n“类似的应用程序”是指两个在技术上真正相似的应用程序，如 Visual Studio Code 和 Code - OSS。\n\r\n在这些例子中，我将使用 Arch Linux 作为参考。然而，这些行为与那些大量采用传统软件包格式的发行版是一致的。\n\r\nNix 不使用容器，它也不是一种容器格式。但为了简单起见，我暂时把它称为一种容器格式。\n\r\n\r\n根本问题\n\r\n\n\r\n图片来源：来自 Unsplash 的 Jackson Simmer\n\r\n大多数（或许不是全部）大量采用传统软件包格式的发行版都有这个共同的问题：它们都没有利用容器或其他方便的方法来分离依赖关系。用通俗的话说，容器是一个盒子，我们可以把东西放在里面，在不影响主系统（主机）的情况下单独使用它们。\n\r\n容器通常不会影响“盒子”外的任何东西。并且它们…",
          "link": "https://linux.cn/article-15027-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-14T03:02:00.000Z",
          "wordCount": 823,
          "title": "传统的 Linux 软件包格式不适合现代应用",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "先知安全技术社区",
      "feedUrl": "https://xz.aliyun.com/feed",
      "siteUrl": "https://xz.aliyun.com/forum/",
      "articles": [
        {
          "id": "https://xz.aliyun.com/t/11705",
          "author": null,
          "description": "一些BAT的XSS实例（四）高级篇",
          "link": "https://xz.aliyun.com/t/11705",
          "publishedOn": "2022-09-16T02:40:54.000Z",
          "wordCount": null,
          "title": "一些BAT的XSS实例（四）高级篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11697",
          "author": null,
          "description": "利用ASP.NET Web API Help Page文件上传",
          "link": "https://xz.aliyun.com/t/11697",
          "publishedOn": "2022-09-16T02:35:20.000Z",
          "wordCount": 546,
          "title": "利用ASP.NET Web API Help Page文件上传",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11673",
          "author": null,
          "description": "基于netfilter的rootkit",
          "link": "https://xz.aliyun.com/t/11673",
          "publishedOn": "2022-09-16T02:33:43.000Z",
          "wordCount": 645,
          "title": "基于netfilter的rootkit",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11699",
          "author": null,
          "description": "不常见的内存与流量取证 -- WMCTF 2022 1!5!",
          "link": "https://xz.aliyun.com/t/11699",
          "publishedOn": "2022-09-15T15:45:49.000Z",
          "wordCount": 1375,
          "title": "不常见的内存与流量取证 -- WMCTF 2022 1!5!",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11674",
          "author": null,
          "description": "CVE-2020-8558-跨主机访问127.0.0.1",
          "link": "https://xz.aliyun.com/t/11674",
          "publishedOn": "2022-09-15T15:41:29.000Z",
          "wordCount": null,
          "title": "CVE-2020-8558-跨主机访问127.0.0.1",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11676",
          "author": null,
          "description": "红日安全团队ATT&CK(二)实战系列靶场",
          "link": "https://xz.aliyun.com/t/11676",
          "publishedOn": "2022-09-15T15:40:07.000Z",
          "wordCount": 913,
          "title": "红日安全团队ATT&CK(二)实战系列靶场",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11656",
          "author": null,
          "description": "“黑猫”又伸出恶魔之手？揭秘BlackCat病毒的三重勒索",
          "link": "https://xz.aliyun.com/t/11656",
          "publishedOn": "2022-09-15T15:39:00.000Z",
          "wordCount": 488,
          "title": "“黑猫”又伸出恶魔之手？揭秘BlackCat病毒的三重勒索",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11703",
          "author": null,
          "description": "CVE-2022-1292的分析",
          "link": "https://xz.aliyun.com/t/11703",
          "publishedOn": "2022-09-14T13:40:35.000Z",
          "wordCount": 523,
          "title": "CVE-2022-1292的分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11690",
          "author": null,
          "description": "Gitlab常见漏洞复现及后利用",
          "link": "https://xz.aliyun.com/t/11690",
          "publishedOn": "2022-09-14T13:39:16.000Z",
          "wordCount": 869,
          "title": "Gitlab常见漏洞复现及后利用",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11695",
          "author": null,
          "description": "从mcms历史漏洞中捡漏",
          "link": "https://xz.aliyun.com/t/11695",
          "publishedOn": "2022-09-13T11:53:55.000Z",
          "wordCount": 543,
          "title": "从mcms历史漏洞中捡漏",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11688",
          "author": null,
          "description": "2022 网鼎杯玄武组-you can find it 题解—Spring通用MemShell改造",
          "link": "https://xz.aliyun.com/t/11688",
          "publishedOn": "2022-09-13T11:52:20.000Z",
          "wordCount": 513,
          "title": "2022 网鼎杯玄武组-you can find it 题解—Spring通用MemShell改造",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11669",
          "author": null,
          "description": "某后台管理系统的审计",
          "link": "https://xz.aliyun.com/t/11669",
          "publishedOn": "2022-09-09T15:56:45.000Z",
          "wordCount": 275,
          "title": "某后台管理系统的审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11684",
          "author": null,
          "description": "关于那WebSocket劫持的二三事",
          "link": "https://xz.aliyun.com/t/11684",
          "publishedOn": "2022-09-08T15:55:34.000Z",
          "wordCount": 910,
          "title": "关于那WebSocket劫持的二三事",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11682",
          "author": null,
          "description": "一些BAT的XSS实例（三）中级篇",
          "link": "https://xz.aliyun.com/t/11682",
          "publishedOn": "2022-09-07T15:54:00.000Z",
          "wordCount": 311,
          "title": "一些BAT的XSS实例（三）中级篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11659",
          "author": null,
          "description": "红队开发基础-基础免杀(四)",
          "link": "https://xz.aliyun.com/t/11659",
          "publishedOn": "2022-09-06T15:55:00.000Z",
          "wordCount": 445,
          "title": "红队开发基础-基础免杀(四)",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11653",
          "author": null,
          "description": "揭开新型窃密软件的面纱：伪装成CDR画图应用安装包",
          "link": "https://xz.aliyun.com/t/11653",
          "publishedOn": "2022-09-06T15:54:00.000Z",
          "wordCount": 285,
          "title": "揭开新型窃密软件的面纱：伪装成CDR画图应用安装包",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11664",
          "author": null,
          "description": "Linux提权基础分享和讨论",
          "link": "https://xz.aliyun.com/t/11664",
          "publishedOn": "2022-09-06T15:53:35.000Z",
          "wordCount": 2882,
          "title": "Linux提权基础分享和讨论",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11671",
          "author": null,
          "description": "CVE-2020-28413 MantisBT SQL注入漏洞分析",
          "link": "https://xz.aliyun.com/t/11671",
          "publishedOn": "2022-09-05T15:55:21.000Z",
          "wordCount": null,
          "title": "CVE-2020-28413 MantisBT SQL注入漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11681",
          "author": null,
          "description": "一些BAT的XSS实例（二）进阶篇",
          "link": "https://xz.aliyun.com/t/11681",
          "publishedOn": "2022-09-05T15:54:50.000Z",
          "wordCount": 262,
          "title": "一些BAT的XSS实例（二）进阶篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11672",
          "author": null,
          "description": "JAVA常用框架SQL注入审计",
          "link": "https://xz.aliyun.com/t/11672",
          "publishedOn": "2022-09-05T15:54:25.000Z",
          "wordCount": 1732,
          "title": "JAVA常用框架SQL注入审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11677",
          "author": null,
          "description": "一些BAT的XSS实例（一）基础篇",
          "link": "https://xz.aliyun.com/t/11677",
          "publishedOn": "2022-09-01T09:00:03.000Z",
          "wordCount": 278,
          "title": "一些BAT的XSS实例（一）基础篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11662",
          "author": null,
          "description": "利用Nginx、Tyk Gateway API和CloudFlare防火墙隐藏C2设施",
          "link": "https://xz.aliyun.com/t/11662",
          "publishedOn": "2022-08-31T14:55:35.000Z",
          "wordCount": 467,
          "title": "利用Nginx、Tyk Gateway API和CloudFlare防火墙隐藏C2设施",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11667",
          "author": null,
          "description": "域内批量获取敏感文件",
          "link": "https://xz.aliyun.com/t/11667",
          "publishedOn": "2022-08-31T14:54:03.000Z",
          "wordCount": 991,
          "title": "域内批量获取敏感文件",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11660",
          "author": null,
          "description": "CVE-2022-31197 PostgreSQL JDBC SQL注入分析",
          "link": "https://xz.aliyun.com/t/11660",
          "publishedOn": "2022-08-30T15:40:39.000Z",
          "wordCount": 291,
          "title": "CVE-2022-31197 PostgreSQL JDBC SQL注入分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11627",
          "author": null,
          "description": "ADCS攻击笔记",
          "link": "https://xz.aliyun.com/t/11627",
          "publishedOn": "2022-08-29T14:15:00.000Z",
          "wordCount": null,
          "title": "ADCS攻击笔记",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11658",
          "author": null,
          "description": "ThinkPHP 5.0.X代码审计",
          "link": "https://xz.aliyun.com/t/11658",
          "publishedOn": "2022-08-29T13:51:41.000Z",
          "wordCount": null,
          "title": "ThinkPHP 5.0.X代码审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11652",
          "author": null,
          "description": "【云攻防系列】从攻击者视角聊聊K8S集群安全（上）",
          "link": "https://xz.aliyun.com/t/11652",
          "publishedOn": "2022-08-29T13:49:00.000Z",
          "wordCount": 475,
          "title": "【云攻防系列】从攻击者视角聊聊K8S集群安全（上）",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11655",
          "author": null,
          "description": "给木马带双眼睛",
          "link": "https://xz.aliyun.com/t/11655",
          "publishedOn": "2022-08-29T13:48:52.000Z",
          "wordCount": 329,
          "title": "给木马带双眼睛",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11651",
          "author": null,
          "description": "利用 PHP-FPM 做内存马的方法",
          "link": "https://xz.aliyun.com/t/11651",
          "publishedOn": "2022-08-29T13:45:00.000Z",
          "wordCount": 359,
          "title": "利用 PHP-FPM 做内存马的方法",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11647",
          "author": null,
          "description": "Flask Pin码构造详解",
          "link": "https://xz.aliyun.com/t/11647",
          "publishedOn": "2022-08-24T16:00:48.000Z",
          "wordCount": 665,
          "title": "Flask Pin码构造详解",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11628",
          "author": null,
          "description": "CVE-2022-34265 Django SQL 注入漏洞调试分析",
          "link": "https://xz.aliyun.com/t/11628",
          "publishedOn": "2022-08-24T15:58:17.000Z",
          "wordCount": 1189,
          "title": "CVE-2022-34265 Django SQL 注入漏洞调试分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11643",
          "author": null,
          "description": "一文入门 soot",
          "link": "https://xz.aliyun.com/t/11643",
          "publishedOn": "2022-08-24T15:57:08.000Z",
          "wordCount": 621,
          "title": "一文入门 soot",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11639",
          "author": null,
          "description": "聊一聊基于\"ebpf xdp\"的rootkit",
          "link": "https://xz.aliyun.com/t/11639",
          "publishedOn": "2022-08-23T16:10:42.000Z",
          "wordCount": 427,
          "title": "聊一聊基于\"ebpf xdp\"的rootkit",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11640",
          "author": null,
          "description": "论如何优雅的注入Java Agent内存马",
          "link": "https://xz.aliyun.com/t/11640",
          "publishedOn": "2022-08-23T15:59:38.000Z",
          "wordCount": 4217,
          "title": "论如何优雅的注入Java Agent内存马",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11633",
          "author": null,
          "description": "Shiro 历史漏洞分析",
          "link": "https://xz.aliyun.com/t/11633",
          "publishedOn": "2022-08-23T15:58:08.000Z",
          "wordCount": null,
          "title": "Shiro 历史漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11631",
          "author": null,
          "description": "Mysql蜜罐反制Cobalt Strike",
          "link": "https://xz.aliyun.com/t/11631",
          "publishedOn": "2022-08-22T12:14:06.000Z",
          "wordCount": 653,
          "title": "Mysql蜜罐反制Cobalt Strike",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11625",
          "author": null,
          "description": "对云函数隐藏C2技术的防御反制思路",
          "link": "https://xz.aliyun.com/t/11625",
          "publishedOn": "2022-08-22T12:13:05.000Z",
          "wordCount": 618,
          "title": "对云函数隐藏C2技术的防御反制思路",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "dev.to top (month)",
      "feedUrl": "https://rsshub.app/dev.to/top/month",
      "siteUrl": "https://dev.to/top/month",
      "articles": [
        {
          "id": "https://dev.to/stripe/designing-apis-for-humans-error-messages-94p",
          "author": "Paul Asjes, Stripe",
          "description": "#api #webdev #programming #stripe",
          "link": "https://dev.to/stripe/designing-apis-for-humans-error-messages-94p",
          "publishedOn": "2022-09-14T11:36:49.000Z",
          "wordCount": 4331,
          "title": "Designing APIs for humans: Error messages",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--8NfiYBul--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/pfxrwzebqa64bcyj3bow.png"
        },
        {
          "id": "https://dev.to/novu/building-an-interactive-screen-sharing-app-with-puppeteer-and-react-12h7",
          "author": "Nevo David, novu",
          "description": "#react #webdev #javascript #opensource",
          "link": "https://dev.to/novu/building-an-interactive-screen-sharing-app-with-puppeteer-and-react-12h7",
          "publishedOn": "2022-09-12T15:05:19.000Z",
          "wordCount": 5188,
          "title": "Building an interactive screen-sharing app with Puppeteer and React 🤯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7WhDhNPC--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/z19zh12b5yiuggqevbgr.jpg"
        },
        {
          "id": "https://dev.to/k_ivanow/finding-remote-work-in-2022-26j",
          "author": "Kristian Ivanov",
          "description": "#remote #interview #career #jobs",
          "link": "https://dev.to/k_ivanow/finding-remote-work-in-2022-26j",
          "publishedOn": "2022-09-11T15:07:11.000Z",
          "wordCount": 2623,
          "title": "Finding remote work in 2022",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--A-BCBZYT--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/djubpwkd8c3oycq5qpu2.jpeg"
        },
        {
          "id": "https://dev.to/aviavinav/the-making-of-a-react-component-librabry-cep",
          "author": "Avi Avinav",
          "description": "#javascript #react #webdev #beginners",
          "link": "https://dev.to/aviavinav/the-making-of-a-react-component-librabry-cep",
          "publishedOn": "2022-09-11T12:09:24.000Z",
          "wordCount": 3845,
          "title": "The Making of A React Component Library",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--980rloZD--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/iglufrc1hyb2akr4wdhq.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/mastering-these-7-basics-css-skills-will-make-you-a-frontend-wizard-2khn",
          "author": "Tapajyoti Bose",
          "description": "#webdev #programming #css #beginners",
          "link": "https://dev.to/ruppysuppy/mastering-these-7-basics-css-skills-will-make-you-a-frontend-wizard-2khn",
          "publishedOn": "2022-09-11T06:25:06.000Z",
          "wordCount": 2400,
          "title": "Mastering these 7 Basics CSS Skills will make you a Frontend Wizard 🧙✨",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--o3Bv5OAd--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/heca1jzzdzqchb4k2sdl.png"
        },
        {
          "id": "https://dev.to/github/why-are-people-developing-inside-containers-38o6",
          "author": "Rizèl Scarlett, GitHub",
          "description": "#github #beginners #cloud #docker",
          "link": "https://dev.to/github/why-are-people-developing-inside-containers-38o6",
          "publishedOn": "2022-09-09T20:49:53.000Z",
          "wordCount": 3997,
          "title": "Why are people developing inside containers?",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7lFVUHWD--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/58pr74ygicsvwc84lzko.png"
        },
        {
          "id": "https://dev.to/wiseai/30-pytricks-ive-learned-by-joining-the-real-python-mailing-list-227i",
          "author": "Mahmoud Harmouch",
          "description": "#python #beginners",
          "link": "https://dev.to/wiseai/30-pytricks-ive-learned-by-joining-the-real-python-mailing-list-227i",
          "publishedOn": "2022-09-08T20:16:08.000Z",
          "wordCount": 3898,
          "title": "30 PyTricks I've Learned By Joining the Real Python Mailing List.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---uxRo6-R--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://cdn.pixabay.com/photo/2016/07/13/08/48/mobile-phone-1513945_960_720.jpg"
        },
        {
          "id": "https://dev.to/madza/12-modern-ui-components-to-inspire-your-future-designs-4ni4",
          "author": "Madza",
          "description": "#webdev #design #ui #inspiration",
          "link": "https://dev.to/madza/12-modern-ui-components-to-inspire-your-future-designs-4ni4",
          "publishedOn": "2022-09-08T16:08:58.000Z",
          "wordCount": 2389,
          "title": "12 Modern UI Components to Inspire Your Future Designs 😍✨",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--hbquREjm--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/scnrm2bxol261sqbs5nk.png"
        },
        {
          "id": "https://dev.to/surajondev/50-awesome-tools-for-web-developers-5gan",
          "author": "Suraj Vishwakarma",
          "description": "#javascript #webdev #beginners #react",
          "link": "https://dev.to/surajondev/50-awesome-tools-for-web-developers-5gan",
          "publishedOn": "2022-09-08T11:31:33.000Z",
          "wordCount": 3556,
          "title": "50+ Awesome tools for Web Developers",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--8iFoZSNU--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/584lu1fv3nsoulybolcx.png"
        },
        {
          "id": "https://dev.to/devsyedmohsin/javascript-tips-and-tricks-you-need-to-know-1g2k",
          "author": "Syed Mohsin Raza",
          "description": "#webdev #javascript #programming #beginners",
          "link": "https://dev.to/devsyedmohsin/javascript-tips-and-tricks-you-need-to-know-1g2k",
          "publishedOn": "2022-09-08T11:16:33.000Z",
          "wordCount": 2063,
          "title": "JavaScript Tips And Tricks Every Developer Should know 💯 🚀️",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--ihSk23fE--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/hl22lqwcsrc92kvcap9y.png"
        },
        {
          "id": "https://dev.to/valeriavg/me-react-5-years-in-15-minutes-58od",
          "author": "Valeria",
          "description": "#react #beginners #javascript #webdev",
          "link": "https://dev.to/valeriavg/me-react-5-years-in-15-minutes-58od",
          "publishedOn": "2022-09-08T07:10:08.000Z",
          "wordCount": 6057,
          "title": "Me & React: 5 years in 15 minutes",
          "imageUrl": "https://dev.to/social_previews/article/1182435.png"
        },
        {
          "id": "https://dev.to/anshika_gautam_/build-a-web-paint-application-5f55",
          "author": "Anshika",
          "description": "#javascript #html #css #webdev",
          "link": "https://dev.to/anshika_gautam_/build-a-web-paint-application-5f55",
          "publishedOn": "2022-09-07T14:49:34.000Z",
          "wordCount": 3637,
          "title": "Build a Web Paint Application",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--N0wfHpeN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/61e7ifwm7v7o3ze8cgyx.png"
        },
        {
          "id": "https://dev.to/j471n/detect-when-users-switch-tabs-using-javascript-3mi3",
          "author": "Jatin Sharma",
          "description": "#javascript #webdev #tutorial #beginners",
          "link": "https://dev.to/j471n/detect-when-users-switch-tabs-using-javascript-3mi3",
          "publishedOn": "2022-09-07T04:00:01.000Z",
          "wordCount": 3207,
          "title": "Detect When Users Switch Tabs using JavaScript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--sh7elrYU--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qudvzomd2qg2su4d9a5n.png"
        },
        {
          "id": "https://dev.to/zevir/the-complete-list-of-heroku-alternatives-to-consider-1l8o",
          "author": "Zevi Reinitz",
          "description": "#heroku #webdev #programming #devops",
          "link": "https://dev.to/zevir/the-complete-list-of-heroku-alternatives-to-consider-1l8o",
          "publishedOn": "2022-09-06T15:21:05.000Z",
          "wordCount": 4721,
          "title": "The Complete List of Heroku Alternatives to Consider",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--vhb83Cu9--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ym56sdt5nhkglna6tse8.jpg"
        },
        {
          "id": "https://dev.to/novu/building-a-live-event-alert-system-with-react-socketio-and-push-notifications-2jg5",
          "author": "Nevo David, novu",
          "description": "#javascript #react #programming #webdev",
          "link": "https://dev.to/novu/building-a-live-event-alert-system-with-react-socketio-and-push-notifications-2jg5",
          "publishedOn": "2022-09-05T14:36:26.000Z",
          "wordCount": 5079,
          "title": "Building a live-event alert system with React, Socket.io, and Push Notifications 🚀",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--EHHuJVoh--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/nbmmt0sax2e28wluvsyl.png"
        },
        {
          "id": "https://dev.to/enterspeed/we-measured-the-ssr-performance-of-6-js-frameworks-heres-what-we-found-1ck0",
          "author": "Kasper Andreassen, Enterspeed",
          "description": "#javascript #react #performance #webdev",
          "link": "https://dev.to/enterspeed/we-measured-the-ssr-performance-of-6-js-frameworks-heres-what-we-found-1ck0",
          "publishedOn": "2022-09-05T06:35:44.000Z",
          "wordCount": 4283,
          "title": "We measured the SSR performance of 6 JS frameworks - here's what we found",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--am_cPbMF--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/c1vlghlhjps2toxu0m25.jpg"
        },
        {
          "id": "https://dev.to/codewithtee/15-array-methods-in-javascript-1p1m",
          "author": "Tabassum Khanum",
          "description": "#javascript #webdev #beginners #programming",
          "link": "https://dev.to/codewithtee/15-array-methods-in-javascript-1p1m",
          "publishedOn": "2022-09-04T18:05:05.000Z",
          "wordCount": 4085,
          "title": "15+ Array Methods in Javascript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--E2de0xXe--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vtkz5a0fnln38z578ikg.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/6-must-have-chrome-extensions-for-web-developers-1ma2",
          "author": "Tapajyoti Bose",
          "description": "#webdev #javascript #productivity #programming",
          "link": "https://dev.to/ruppysuppy/6-must-have-chrome-extensions-for-web-developers-1ma2",
          "publishedOn": "2022-09-04T06:15:00.000Z",
          "wordCount": 2379,
          "title": "6 must-have Chrome Extensions for Web Developers 🚀🌐",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--2XIBrsLR--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ba1979d6k9jju5e6ia6p.png"
        },
        {
          "id": "https://dev.to/sarath_pm/git-cheatsheet-414e",
          "author": "Sarath P M",
          "description": "#git #programming #github #codenewbie",
          "link": "https://dev.to/sarath_pm/git-cheatsheet-414e",
          "publishedOn": "2022-09-03T13:35:05.000Z",
          "wordCount": 3459,
          "title": "Git Cheatsheet",
          "imageUrl": "https://dev.to/social_previews/article/1178295.png"
        },
        {
          "id": "https://dev.to/heyjtk/big-o-notation-basics-made-dead-simple-1c9m",
          "author": "JTK",
          "description": "#softwareengineering #algorithms #coding",
          "link": "https://dev.to/heyjtk/big-o-notation-basics-made-dead-simple-1c9m",
          "publishedOn": "2022-09-02T19:06:38.000Z",
          "wordCount": 4898,
          "title": "Big O notation basics made dead simple",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--3OHOMm_M--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ia3qpqezyrd0lyr5j6dg.jpg"
        },
        {
          "id": "https://dev.to/surajondev/awesome-github-repositories-for-web-developer-part-2-1h8b",
          "author": "Suraj Vishwakarma",
          "description": "#github #webdev #javascript #beginners",
          "link": "https://dev.to/surajondev/awesome-github-repositories-for-web-developer-part-2-1h8b",
          "publishedOn": "2022-09-01T11:36:22.000Z",
          "wordCount": 3116,
          "title": "Awesome GitHub Repositories for Web Developer - Part 2",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--HfSsorGN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/n562actscws9k9rfsvpq.png"
        },
        {
          "id": "https://dev.to/whitep4nth3r/whats-the-difference-between-and-in-css-23p4",
          "author": "Salma Alam-Naylor",
          "description": "#css #webdev #beginners",
          "link": "https://dev.to/whitep4nth3r/whats-the-difference-between-and-in-css-23p4",
          "publishedOn": "2022-09-01T09:41:50.000Z",
          "wordCount": 2832,
          "title": "What's the difference between : and :: in CSS?",
          "imageUrl": "https://dev.to/social_previews/article/1181288.png"
        },
        {
          "id": "https://dev.to/francescoxx/how-to-learn-web3-september-2022-3h9h",
          "author": "Francesco Ciulla",
          "description": "#web3 #blockchain #beginners #programming",
          "link": "https://dev.to/francescoxx/how-to-learn-web3-september-2022-3h9h",
          "publishedOn": "2022-09-01T06:03:23.000Z",
          "wordCount": 5967,
          "title": "How to Learn Web3 (September 2022)",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--L7sp3K03--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ir3ojvhv20khaipk7x9l.jpg"
        },
        {
          "id": "https://dev.to/meshvpatel18/top-heroku-alternatives-for-free-46g1",
          "author": "Meshv Patel",
          "description": "#heroku #webdev #programming",
          "link": "https://dev.to/meshvpatel18/top-heroku-alternatives-for-free-46g1",
          "publishedOn": "2022-08-31T13:49:56.000Z",
          "wordCount": 4802,
          "title": "Top Heroku Alternatives for free",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--r_6FrH43--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/6p9g6fa8h6n8w0wfx453.png"
        },
        {
          "id": "https://dev.to/devdevcharlie/building-an-aircraft-radar-system-in-javascript-4ml8",
          "author": "Charlie Gerard",
          "description": "#javascript #webusb #rtlsdr",
          "link": "https://dev.to/devdevcharlie/building-an-aircraft-radar-system-in-javascript-4ml8",
          "publishedOn": "2022-08-29T16:00:41.000Z",
          "wordCount": 3900,
          "title": "Building an aircraft radar system in JavaScript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--bbckrCHJ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://res.cloudinary.com/devdevcharlie/image/upload/v1661734283/Group_36_i7nacq.png"
        },
        {
          "id": "https://dev.to/refine/5-most-common-usestate-mistakes-react-developers-often-make-3aig",
          "author": "Necati Özmen, refine",
          "description": "#react #webdev #programming #opensource",
          "link": "https://dev.to/refine/5-most-common-usestate-mistakes-react-developers-often-make-3aig",
          "publishedOn": "2022-08-29T09:26:00.000Z",
          "wordCount": 5670,
          "title": "5 Most Common useState Mistakes React Developers Often Make",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--icsJRQJA--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/8hwypzqq79uayyyj6ff9.png"
        },
        {
          "id": "https://dev.to/j471n/i-made-all-countries-flags-using-html-css-4cnc",
          "author": "Jatin Sharma",
          "description": "#css #webdev #html #beginners",
          "link": "https://dev.to/j471n/i-made-all-countries-flags-using-html-css-4cnc",
          "publishedOn": "2022-08-28T09:08:00.000Z",
          "wordCount": 6538,
          "title": "I made all countries' flags using HTML & CSS",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Gd_3mxyQ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/bq099o7ud7g1xj3fa2at.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/7-neat-tricks-for-js-that-you-probably-did-not-know-358d",
          "author": "Tapajyoti Bose",
          "description": "#javascript #webdev #programming #productivity",
          "link": "https://dev.to/ruppysuppy/7-neat-tricks-for-js-that-you-probably-did-not-know-358d",
          "publishedOn": "2022-08-28T05:02:31.000Z",
          "wordCount": 2847,
          "title": "7 neat tricks for JS that you probably did not know",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--WA6O6eXN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/f263nocop0yni6w4d3ot.jpg"
        },
        {
          "id": "https://dev.to/daveson217/free-alternatives-to-heroku-3jh9",
          "author": "David Babalola",
          "description": "#help #heroku #webdev #python",
          "link": "https://dev.to/daveson217/free-alternatives-to-heroku-3jh9",
          "publishedOn": "2022-08-26T10:28:07.000Z",
          "wordCount": 5222,
          "title": "Free Alternatives to Heroku",
          "imageUrl": "https://dev.to/social_previews/article/1176747.png"
        },
        {
          "id": "https://dev.to/ondrejsevcik/20-principles-i-learned-from-10-years-of-developing-software-5354",
          "author": "Ondrej Sevcik",
          "description": "#beginners #programming #career",
          "link": "https://dev.to/ondrejsevcik/20-principles-i-learned-from-10-years-of-developing-software-5354",
          "publishedOn": "2022-08-25T17:38:25.000Z",
          "wordCount": 4135,
          "title": "20 principles I learned from 10 years of developing software",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--NnA9zcAf--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/xceonypgt9lwtyf4636x.png"
        },
        {
          "id": "https://dev.to/yuridevat/how-i-got-my-first-job-as-a-developer-by-making-simple-projects-seem-big-48oi",
          "author": "𝕁𝕦𝕝𝕚𝕒 👩🏻‍💻",
          "description": "#codenewbie #career #motivation",
          "link": "https://dev.to/yuridevat/how-i-got-my-first-job-as-a-developer-by-making-simple-projects-seem-big-48oi",
          "publishedOn": "2022-08-25T12:20:36.000Z",
          "wordCount": 6174,
          "title": "How I got my first job as a developer by making simple projects seem big",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--JK0WqSaY--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rarbgb13upbv6x9lo6rm.png"
        },
        {
          "id": "https://dev.to/shadowfaxrodeo/why-your-website-should-be-under-14kb-in-size-398n",
          "author": "Nathaniel",
          "description": "#todayilearned #webperf #webdev #performance",
          "link": "https://dev.to/shadowfaxrodeo/why-your-website-should-be-under-14kb-in-size-398n",
          "publishedOn": "2022-08-25T00:22:00.000Z",
          "wordCount": 4748,
          "title": "Why your website should be under 14kb in size",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--1cttSxyj--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/8ik8z1bn8pw7pde9kdsh.png"
        },
        {
          "id": "https://dev.to/mteheran/typescript-ultimate-guide-for-beginners-1dlo",
          "author": "Miguel Teheran",
          "description": "#typescript #javascript #guide",
          "link": "https://dev.to/mteheran/typescript-ultimate-guide-for-beginners-1dlo",
          "publishedOn": "2022-08-24T16:06:52.000Z",
          "wordCount": 3394,
          "title": "TypeScript: Ultimate guide for beginners",
          "imageUrl": "https://dev.to/social_previews/article/1175262.png"
        },
        {
          "id": "https://dev.to/wadecodez/5-fresh-project-ideas-for-web-developers-15l2",
          "author": "Wade Zimmerman",
          "description": "#webdev #javascript #css #beginners",
          "link": "https://dev.to/wadecodez/5-fresh-project-ideas-for-web-developers-15l2",
          "publishedOn": "2022-08-24T01:37:00.000Z",
          "wordCount": 2344,
          "title": "5 Refreshing Project Ideas for Web Devs",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--6ZgH4RYx--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vfasli39mv4th7plqhci.png"
        },
        {
          "id": "https://dev.to/madza/18-useful-github-repositories-every-developer-should-bookmark-2n99",
          "author": "Madza",
          "description": "#webdev #design #productivity #github",
          "link": "https://dev.to/madza/18-useful-github-repositories-every-developer-should-bookmark-2n99",
          "publishedOn": "2022-08-23T12:35:14.000Z",
          "wordCount": 3574,
          "title": "18 Useful GitHub Repositories Every Developer Should Bookmark 👍💯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--YZm-Jo7E--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ofoahawoba7xwkazx3jh.png"
        },
        {
          "id": "https://dev.to/novu/building-a-chat-browser-notifications-with-react-websockets-and-web-push-1h1j",
          "author": "Nevo David, novu",
          "description": "#react #node #javascript #programming",
          "link": "https://dev.to/novu/building-a-chat-browser-notifications-with-react-websockets-and-web-push-1h1j",
          "publishedOn": "2022-08-22T15:11:00.000Z",
          "wordCount": 5286,
          "title": "Building a chat - Browser Notifications with React, Websockets and Web-Push 🤯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--9NqzXLjP--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/zitw40s2hspakrlfmy86.png"
        },
        {
          "id": "https://dev.to/irreverentmike/5-tools-i-add-to-every-new-web-project-for-seo-and-analytics-58f2",
          "author": "Mike Bifulco",
          "description": "#webdev #javascript #seo #productivity",
          "link": "https://dev.to/irreverentmike/5-tools-i-add-to-every-new-web-project-for-seo-and-analytics-58f2",
          "publishedOn": "2022-08-22T14:56:00.000Z",
          "wordCount": 4719,
          "title": "SEO tools I used to grow my sites to 20k+ visitors/month",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--XxgssCZp--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rmv9r0mhafv79co0if0g.png"
        },
        {
          "id": "https://dev.to/joelbonetr/speech-recognition-with-javascript-59g1",
          "author": "JoelBonetR",
          "description": "#javascript #webdev #tutorial #programming",
          "link": "https://dev.to/joelbonetr/speech-recognition-with-javascript-59g1",
          "publishedOn": "2022-08-22T09:23:00.000Z",
          "wordCount": 2797,
          "title": "Speech Recognition with JavaScript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--q07qCeuf--/c_imagga_scale,f_auto,fl_progressive,h_500,q_66,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/fg7d21fl5gqpngmiwb40.gif"
        },
        {
          "id": "https://dev.to/pragativerma18/youre-not-using-http-status-codes-right-pc6",
          "author": "Pragati Verma",
          "description": "#codenewbie #webdev #computerscience #api",
          "link": "https://dev.to/pragativerma18/youre-not-using-http-status-codes-right-pc6",
          "publishedOn": "2022-08-21T20:17:00.000Z",
          "wordCount": 4545,
          "title": "You're Not Using HTTP Status Codes Right",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--NkOI-IC6--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/hwsth9hcuj6gjr93eu8y.png"
        },
        {
          "id": "https://dev.to/dawsoncodes/beautify-github-profile-5a3",
          "author": "Dawson Codes",
          "description": "#github #webdev #programming #career",
          "link": "https://dev.to/dawsoncodes/beautify-github-profile-5a3",
          "publishedOn": "2022-08-21T19:45:00.000Z",
          "wordCount": 3594,
          "title": "Beautify GitHub profile",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--wldQTiuy--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/b0s3feqi49x5ycw0bvy6.jpg"
        },
        {
          "id": "https://dev.to/ioanat94/dos-and-donts-of-creating-your-portfolio-website-2h4p",
          "author": "Ioana Tiplea",
          "description": "#beginners #portfolio #design #webdev",
          "link": "https://dev.to/ioanat94/dos-and-donts-of-creating-your-portfolio-website-2h4p",
          "publishedOn": "2022-08-21T05:43:00.000Z",
          "wordCount": 5107,
          "title": "Do's and Don'ts of Creating Your Portfolio Website",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--WfL0cbqq--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/80syci6u0b56vvj0z6k7.jpg"
        },
        {
          "id": "https://dev.to/hugaomarques/a-arquitetura-simples-lb",
          "author": "Hugo Marques",
          "description": "#arquiteturalimpa #sistemasdistribuidos #aws #systemdesign",
          "link": "https://dev.to/hugaomarques/a-arquitetura-simples-lb",
          "publishedOn": "2022-08-20T18:59:15.000Z",
          "wordCount": 7176,
          "title": "A Arquitetura simples",
          "imageUrl": "https://dev.to/social_previews/article/1170796.png"
        },
        {
          "id": "https://dev.to/lico/react-ts-dont-repeat-the-type-when-you-pass-functions-as-props-use-their-types-5h6h",
          "author": "SeongKuk Han",
          "description": "#react #typescript #webdev #beginners",
          "link": "https://dev.to/lico/react-ts-dont-repeat-the-type-when-you-pass-functions-as-props-use-their-types-5h6h",
          "publishedOn": "2022-08-19T03:08:00.000Z",
          "wordCount": 2380,
          "title": "React TS: Don't repeat the type when you pass functions as props, use their types.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Nzix1Sm2--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ariysc4jtiw7d020or2n.png"
        },
        {
          "id": "https://dev.to/bytehide/visual-studio-codes-new-editor-sticky-scroll-feature-never-get-lost-in-the-code-again-1dob",
          "author": "ByteHide",
          "description": "#news #vscode #beginners #programming",
          "link": "https://dev.to/bytehide/visual-studio-codes-new-editor-sticky-scroll-feature-never-get-lost-in-the-code-again-1dob",
          "publishedOn": "2022-08-18T13:34:00.000Z",
          "wordCount": 4245,
          "title": "Visual Studio Code's New Editor Sticky Scroll Feature - Never Get Lost In The Code Again!😍",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--KSAUmkkn--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/unwqie2g73nlewbasmst.png"
        },
        {
          "id": "https://dev.to/chegerose/5-enhancements-that-will-boost-your-nodejs-app-3pj5",
          "author": "Rose Chege",
          "description": "#node #performance #javascript #programming",
          "link": "https://dev.to/chegerose/5-enhancements-that-will-boost-your-nodejs-app-3pj5",
          "publishedOn": "2022-08-18T10:13:00.000Z",
          "wordCount": 3807,
          "title": "5 enhancements that will boost your Node.js app",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--iffLzmlg--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/arii3ff4d1awwzado9bt.jpg"
        },
        {
          "id": "https://dev.to/aviyel/9-no-code-tools-you-should-definitely-try-in-2022-33ol",
          "author": "Pramit Marattha, Aviyel Inc",
          "description": "#productivity #nocode #beginners #webdev",
          "link": "https://dev.to/aviyel/9-no-code-tools-you-should-definitely-try-in-2022-33ol",
          "publishedOn": "2022-08-18T09:13:00.000Z",
          "wordCount": 4207,
          "title": "9 No-Code Tools You should definitely try in 2022 🔥💯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--c-WCiahL--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qip87ybn1kxmiaaeyql8.png"
        },
        {
          "id": "https://dev.to/dcodeyt/5-javascript-events-you-need-to-know-1jjl",
          "author": "Dom (dcode)",
          "description": "#javascript #webdev #beginners",
          "link": "https://dev.to/dcodeyt/5-javascript-events-you-need-to-know-1jjl",
          "publishedOn": "2022-08-17T22:58:04.000Z",
          "wordCount": 1684,
          "title": "5 JavaScript Events You NEED To Know 🌏",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--tFRObNac--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/gucfmv9t4edb3i2onys1.jpg"
        }
      ]
    },
    {
      "title": "少数派 -- Matrix",
      "feedUrl": "https://rsshub.app/sspai/matrix",
      "siteUrl": "https://sspai.com/matrix",
      "articles": [
        {
          "id": "https://sspai.com/post/75719",
          "author": "莱森",
          "description": "Part 0 引入\n众所周知，Watch 有两种视图。第一个是「列表视图」，第二个则是「蜂窝视图」。我第一次用蜂窝视图的时候觉得这种交互模式非常炫酷，但是用了一段时间后的感受是 —— 「就像把杂货箱的东西全部倾倒出来，然后直到找着这一次需要的东西」。这无疑是一个非常糟糕的体验，因为每一次找 App 都要反复体验一下找杂物的难受感。所以这里触发了一个痛点是：「买完 Apple Watch 之后，我们应该如何快速找到并打开目标 app 呢？」\n回忆一下小时候混乱的工具箱\n本篇文章的前提 —— 在抛除了「Siri」、「程序坞」、「表盘上的快捷入口」三种检索方式的基础之上，再来探索有没有办法可以进一步提高效率，让我们的「应用菜单」也可以具备更强的检索性，做到井井有条。\nGrid View（网格视图，我也喜欢称为蜂窝视图）\nPart 1 思路总括\n一开始我是换回了习惯的「列表视图」，依靠皇冠的转动来找到 App。但是列表视图有个问题是 —— 你无法调整 App 的显示顺序。就算你可以调整并分类 App，你也有可能需要在「单向」上线性地浏览众多的 App 之后才能找到目标，\nList View（列表视图）\n所以思路开始清晰起来 —— 如果我们把应用进行分类，并从中心延伸到几个不同的方向，就可以减少查找的时间和查找的路径长度。基于此，我们利用蜂窝的特性，从中心恰好可以切割出 6 条大方向，代表 6 个大类，然后把最主要的 App 直接放到 6 条线上。相当于至少提高检索速度 6 倍。\n自制演示图\nPart 2 和我一起来分类\n现在，请大家停下 1 分钟，和我一起思考：我的 Apple Watch 上大致都有哪些 app 呢？对于我而言，我会分为以下 6 大类（逆时针），然后把最常用的放到线上：\n\n健康\n运动\n音乐·声音\n办公·社交·信息\n支付\n其他工具\n\nPart 3 和我一起思考 6 …",
          "link": "https://sspai.com/post/75719",
          "publishedOn": "2022-09-15T06:56:56.000Z",
          "wordCount": 634,
          "title": "一日一技｜六边形法迅速查找 Apple Watch 中的 app",
          "imageUrl": "https://cdn.sspai.com/2022/09/14/d128741fed4c4eeeed1bf4df750df0ae.jpeg"
        },
        {
          "id": "https://sspai.com/post/75599",
          "author": "不辣的黄",
          "description": "起因：加班太多，病倒了\n之前公司赶项目进度，我所在的团队两个月无休连轴转，导致身体负荷太大，生了一场小病。医生的诊断是免疫系统出了问题，虽然对日常生活影响不大，但可能无法根治，只能慢慢调理。从诊室走出来后，我立即将「保持身体健康」这件事的优先级「置顶」了，决定开始改变以前一些不健康的生活习惯。\n除了调整作息、加强锻炼，也开始研究日常的营养摄入。但是关于营养，我除了知道几个类似「高油、高糖、高盐要少吃」、「卡路里超标会肥胖」、「高蛋白可以增肌」的碎片化概念，似乎也没有更加深入的认知了，一时有点无从下手。\n于是我决定先从书里找找答案。\n灵感：从食物多样性入手\n在豆瓣的书单和评分榜上一番搜寻，我注意到了《你是你吃出来的》这本书。看完之后，书里提到的一个概念让我印象深刻：人类是杂食动物，吃得不够全面，是营养失衡最常见的诱因。\n1.身体器官出毛病，主要是因为细胞损伤得快，修复得慢。\n人体内的细胞都是在以固定的速度更新换代，比如血管的内皮细胞 1 天就会死亡；胃黏膜细胞 3 ～ 5 天更替一次；肺表面的细胞寿命是 2 ～ 3 周。当细胞修复的速度高于损伤速度，就是健康的，「青黄不接」则容易出毛病。\n2.上述过程所需的「原材料」，唯一来源就是日常摄入的食物。\n虽然生病后吃药可以抑制、缓解症状，但并没有根本上改变细胞更新的平衡。更合理的方式是通过日常饮食提供充分的「原材料」，让细胞更新的平衡有序地运转下去。\n3.人体所需的营养元素十分庞杂，很难靠少数几种食物就满足。\n比如上皮组织，如果人体内缺乏胶原蛋白，细胞之间的缝隙会加大，上皮细胞的保护功能就会减弱，管腔中的血液就会渗透出去，形成皮下出血。比如摄碘不足或者过量都将影响甲状腺功能，造成甲状腺的损伤。不同的身体器官，所需要的营养元素不尽相同，综合起来，身体所需的营养是个相当复杂的集合。如果日常只是摄入少数几种食物，就容易导致营养「偏科」，被忽视掉的营养元素可能导致某些器官的细胞更新的失衡。反之，吃得越杂，营养越容易均衡。\n《中国居民膳食指南 2022 》中也有类似的建议。《指南》共有8条核心准则，其中第一条就是「食物多样，合理搭配」，并明确建议「平均每天摄入12种以上食物，每周25种以上」。\n来源：《中国居民膳食指南》官网\n动手：「吃得杂」简单易行，但似乎没有趁手的工具\n作为一个打工人，我认为「吃得杂」的策略十分可行。一方面，我不仅仅满足于吃得饱、吃得爽，必须要提升下日常营养摄入的质量。另一方面，又也不想在营养搭配上花太多的精力，比如研究某些「神奇食物」、详细规划每一餐的卡路里、食物成分等等。「吃得杂」的策略就成了质量和效率的平衡之选。\n \n「每周25种」开始成为我的饮食准则。\n我开始有意每餐都吃一些不一样的食物，降低自己的营养「偏科」风险。 做起来似乎其实不难，菜市场买得到的，或者快餐能点的，随便组合下基本就能达到。 但这个策略执行了一段时间，我发现总是记不住这周吃了多少种。\n为了记录饮食，我也尝试了几个现有的应用，但要么功能太庞杂，各种 Banner 、营销推送满屏飞，要么记录成本太高，功能太偏向专业用户，比如要记录食物的重量、卡路里等等参数，而实际上我并不需要这么精确的食物成分管理。\n我既想知道自己有没有做到「食物多样」，又不想在这 [记录] 这个环节耗费太多的精力。既然工具不趁手，就自己做一个。\n「杂食记」——帮你达成「每周25种」的健康膳食目标\n \n量化当周的膳食目标达成进度，以及基本的种类分布。\n\n记录时只需要记下种类，不需要输入其他繁琐的参数。\n\n分析饮食数据，帮你更了解自己的饮食偏好，同时支持小组件。\n提供分析图表，并支持小组件\n可通过食物库管理食物，内置了常见的食物，当然你也可以自定义添加。\n\n按日期查询每一天的详细记录，当然也可以删除。\n\n其他小功能：定时提醒，帮你养成记录习惯；自定义每周膳食目标，给自己「加码」\n\n希望大家一起好好吃饭\n调理营养可能是个很复杂的事情，你我身上也背了很多责任和限制，没法做到永远把「营养调理」摆在第一优先级，但我们也许可以从好好吃饭开始，日常习惯做一点微小的改变，就能帮身体的营养维持该有的平衡。希望我的 App 可以帮大家迈出第一步，从「每周吃够25种」开始，变得更加健康。\n关于App的其他\n\n目前是买断制，另外App内有打赏页面，各位用得顺手可随缘投喂。\n发布才一个多月，功能和体验还在持续优化进步中。大家有任何建议或吐槽都可以通过站内信或者App内的邮件地址联系我。\nBug一定马上改，但功能不会随便加，尤其是与「每周25种」无关的功能会更加谨慎。同时，我觉得除了记录、查看分析之外并，大家没有必要在这个App中停留太久，希望做到「真·用完即走」、「真·小而美」。",
          "link": "https://sspai.com/post/75599",
          "publishedOn": "2022-09-14T22:28:41.000Z",
          "wordCount": 510,
          "title": "为了养成更健康的饮食习惯，我开发了这款App",
          "imageUrl": "https://cdn.sspai.com/2022/09/07/fd3457061bf87b5809b2f732c2fb28e2.jpg"
        },
        {
          "id": "https://sspai.com/post/75715",
          "author": "少数派编辑部",
          "description": "5 月 25 日，少数派受邀参与「2022 年春季飞书未来无限大会」。 在「人与事相互成就」这个话题上，飞书这次又为我们带来了一整套从人事、招聘、绩效到项目管理、应用开发完整覆盖的先进工具，也分享了更多值得我们借鉴和消化的用法。\n在这些工具当中，我们对上手简单、功能强大且完全免费的飞书多维表格，其实也有自己的「一套说法」。\n虽然不能像大会上提到的那些团队「一张表管公司」，多维表格的确也在过去这段时间里帮我们解决了很多问题：曾经有过这么一段时间，我们的团队沟通工具是 Slack、选题看板放在 Trello、协作文档服务是 Quip、跨组项目进度同步依赖 Teambition、作者运营工作放在微信群……每一处都需要有人花时间和精力去维护，工作群里时不时也会蹦出几条消息提醒老麦，XX 团队服务又该续费了。\n飞书多维表格的上线，则让「不花一分钱解决业务需求」成为了可能。如果你没能第一时间观看「2022 年春季飞书未来无限大会」的线上直播，不妨跟随本文一起认识多维表格，看看这套工具在我们的团队中是如何发挥作用的。\n首先，它是一张（更好用的）表\n接触过 Excel，上手多维表格就已经成功了一半。如果你已经有了原始数据，甚至可以在飞书文档右上角的「新建」菜单里，直接将 Excel/CSV 格式文件导入为多维表格。\n\n能否用好多维表格，另一半因素在于你是否清楚自己的需求，或者说后续如何对表格数据进行加工、处理。和所有优秀的互联网工具类似，飞书也在多维表格的创建流程中提供了海量的模板，既能搜索、也能通过左侧导航分门别类进行筛选，成员分工、项目管理、分销记录、防疫报备、周报月报……下次同事按耐不住剁手的冲动想要续费什么团队服务之前，先打开多维表格的模板用他念叨的那些关键字搜搜看？\n\n当然，我们将多维表格和 Excel 类比，最主要的原因在于，和恨不得把所有选项都堆在工具栏的 Excel 不同，…",
          "link": "https://sspai.com/post/75715",
          "publishedOn": "2022-09-14T02:40:00.000Z",
          "wordCount": 565,
          "title": "少数派每天都在用的这个软件，怎么让我们「提前下班」",
          "imageUrl": "https://cdn.sspai.com/article/24160872-8c6d-382e-95de-ce59a931bfb1.png"
        },
        {
          "id": "https://sspai.com/post/75658",
          "author": "老麦",
          "description": "一转眼就到了九月，全新的少数派会员服务也运转了两个多月，经过会员组、编辑部、产品组、数字工具组的共同努力，目前的产品、内容和服务，都已经进入了稳定状态，接下来该周边组发力了，给大家准备这一季的实体周边，借着周边的设计，我也重新总结一下少数派会员的权益和价值。\n\n在我们的会员介绍页面，有三个简单的图形，这背后是产品负责人的设计思考，它代表着一个三角形切割打磨成圆形的过程，其实也完美的诠释了少数派业务与会员服务的关系，以及我们未来的愿景。这套图形也正是会员周边的核心元素，我想把背后的故事讲给大家听听。\n超值的六边会员服务\n代表着我给会员定制的六个方面的服务，它们分别是专属内容、专属产品、高质社群、定制周边、商品福利、共创增值，逐个给大家讲讲。\n\n专属内容\n最近几年，短视频爆发，娱乐内容泛滥，大量的攫取着我们的时间。但我们始终认为，如果想让工作和生活变得更好，单靠娱乐远远是不够的，我们需要持续的学习和成长，持续的创新和创造，而深度图文+语音对谈，依然是承载这类内容的最佳方式。而这些经验和思考类内容，稀缺性强，生产成本也高，且很难获得广告支持，会员服务将支撑我们长期深耕这些内容，不断扩展领域，让会员用户跟我们共同成长。\n\n比如一份针对用户消费领域的深度报告内容，制作周期可能长达数月，目前已经针对机械键盘、显示器、咖啡、录音设备等领域推出了这类消费报告。帮助大家全面完整的了解这些产品和用法。\n专属产品\n我们几乎开发了一套完整的会员产品模块，从页面设计、产品功能、用户体系，都在围绕会员进行规划和重构，我们不像以往的互联网公司那样，为了流量去做大而全，而是希望不断提供独特的创新的产品使用体验。\n\n会员用户可以给我们最直接和有效的反馈，更有很多产品从业者，甚至能跟我们一起共创有趣的新模块。除了内容、商品，我们甚至希望联动线下服务。\n高质社群\n家家都可以做社群，做好社群却很难，少数派本身就是…",
          "link": "https://sspai.com/post/75658",
          "publishedOn": "2022-09-14T02:35:13.000Z",
          "wordCount": 487,
          "title": "少数派思考 031：会员周边要来了",
          "imageUrl": "https://cdn.sspai.com/2022/09/14/b7fd9cfe5e69da8065bdf0c9faa9ba5a.jpg"
        },
        {
          "id": "https://sspai.com/post/75710",
          "author": "会飞的三羊店长",
          "description": "Matrix 首页推荐 \nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。 \n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\n得到这台文石 Tab8 实属偶然，起因是一位朋友给我传送了文石可用旧 Kindle 换新设备的 「ok 计划」。俗话说得好，甘当分母总会成为分子，于是我喜提 Tab8，也就有了这篇测评。\n注：尽管 Tab8 是用一台旧 Kindle 以及测评本身换得，但是本文内容和观点不经文石干涉。\n\n我和第四台文石\n虽然我在去年才亲自掏钱购入一台文石，但由于我对大尺寸电子墨水屏设备的贪恋，和文石的缘分在更早之前其实就开始了。\n20 年入职少数派时，派内闲置的一台 Boox Note Pro 让我眼前一亮——这不就是我想要但买不起的那个东西吗！于是立刻占为己有使用了好几个月。彼时文石还未将骁龙芯片纳入使用，采用的是自研芯片，所以——墨水屏设备有的毛病它都有。除了使用自带阅读器 Neo Reader 读 PDF 等本地文件，使用应用市场下载 App 的使用体验都非常糟糕，卡得飞起。但即便如此我还是用它看完了几部《铳梦》，卡顿和闪屏并不妨碍大尺寸的电子墨水屏给我留下了非常良好的阅读体验，只是那时的文石确实让我觉得，这离一台我会自己花三千大洋购入的墨水屏设备着实还有一段距离。\n2020 年底，文石将新设备的芯片统一更换为骁龙 6 系。对于手机来说早已过时的芯片在电纸书上来说却非常堪用，于是没过多久我就购入了一台 Boox Note3，至今服役一年有余。在这台设备上，阅读本地文档和手写批注的体验已经非常丝滑，微信读书 E-ink 版本这类优化过的 App 体验感也上佳。但对于更进一步的网页阅读、未针对墨水屏优化的 App，仍只停留在「能用」的程度。\n…",
          "link": "https://sspai.com/post/75710",
          "publishedOn": "2022-09-13T15:46:12.000Z",
          "wordCount": 691,
          "title": "我相信这是它一开始就想到达的地方——文石 Tab8 上手体验",
          "imageUrl": "https://cdn.sspai.com/2022/09/13/5049a3e59f543449d26fc5c7e5f518ec.png"
        },
        {
          "id": "https://sspai.com/post/75705",
          "author": "Tolecen",
          "description": "白描是一款简单好用的 OCR 文字识别与扫描工具，主要功能有提取图片中的文字，图片表格转 Excel，公式识别，文件扫描，身份证扫描，合成PDF等。现在，白描除了可以在手机上和网页上用，Windows 版本正式发布，支持 Windows 7/8/10/11，目前白描已经包含 iOS、Android、Windows、Mac、网页、小程序多种版本，想在哪用就在哪用。除小程序外，所有平台的会员通用，也就是说，在手机端买个会员，就可以一个账号全平台使用了。\n\n截屏 OCR 识别\n首先，白描 Windows 版本最方便的就是截屏识别，App 运行后，会在右下角托盘有个小图标，右键小图标可以有更多操作，比如：截屏识别。\n\n除了通过托盘图标菜单识别，可以在白描设置界面设置截屏的快捷键，识别更高效。\n\n截图后会弹出识别结果页面，左侧是截图后的原图，右侧是文本结果，在识别结果页面可以复制结果，导出 Word 或 TXT 文本。\n截图不只是文字识别，还可以公式识别、表格识别\n\n如果是表格识别，在识别结果的部分可以直接导出 Excel，公式识别可以直接复制为 LaTeX 格式。\n\n如果你平常截图识别的种类非常多，又识别文字，又识别表格，又识别公式，又识别二维码，可以在设置里打开自动检测图片类型，软件会根据检测到的类型自动进行相应的识别。\n文字识别\n除了截屏快捷识别，也可以在主界面中进行操作，在左侧选中图片文字提取，便可以进行普通的 OCR 文字识别，支持单张识别，批量识别，长图也同样支持直接识别。\n\n主界面的文字识别，除了图片格式，也支持直接将 PDF 文件拖入识别，首先软件会将 PDF 的所有页面解析为图片，然后进行识别。\n\n表格识别\n主界面左侧切换为表格识别，可以直接将图片中的表格转换为 Excel 格式，无论带线还是不带线的表格都支持。\n\n如果有多个表格，也支持把表格识别为多个工作表（Sheet）。\n公式识别\n主界面左侧切换为公式识别，可以将图片中的公式转换为文本，复制为 LaTeX 格式。\n\n关于会员\n白描手机 App 中购买的会员可以直接在 Windows 版本中使用，在设置页面登录账号就可以了。\n\n点击这里去 白描官网 下载。\n关于另一个 Mac 版\n白描之前已经在 Mac 的 App Store 中发布了 Mac 版本，此次又发布了一个新的 Mac 版，是一个可以独立下载安装的版本，基本功能和上面介绍的 Windows 版本一样，同样支持截屏识别、文字识别、表格识别、公式识别、PDF 识别，不过他还有另一个功能：让你的 Mac 变成一个 OCR 识别服务器：\n\n如果你会一些编程，又拥有一台 Mac 电脑，想自己实现一个 OCR 的工具，那可以使用白描提供的服务器服务，发挥你的想象力，做出任何自己喜欢的 OCR 识别工具。\n这部分如果感兴趣的人多，会考虑单独写一篇文章来介绍服务器模式。\n最新的 Windows 和 Mac 官方版本下载地址：\nhttps://baimiaoapp.com",
          "link": "https://sspai.com/post/75705",
          "publishedOn": "2022-09-13T08:58:32.000Z",
          "wordCount": 558,
          "title": "白描 Windows 版发布，全平台好用的 OCR 文字表格识别工具",
          "imageUrl": "https://cdn.sspai.com/2022/09/13/40f6280ddee6db989dca49648b4b27be.jpg"
        },
        {
          "id": "https://sspai.com/post/75692",
          "author": "中年程序猿汪二",
          "description": "中年的汪二眼里已经没有了光，头顶却越来越光，脱贫没脱掉，却脱了发，还和颈椎病斗争了多年，最终还是和颈椎病共存了。\n汪二有个儿子，每当小儿写作业的时候，就在后面，天天唠叨抬头。汪二摸了摸硬直的颈椎想：此生因为颈椎没能成为乔布斯，下一代不能在此再折一次啊。\n\n汪二在某宝上买了一些防止小朋友写作业低头的产品，有物理挡着的，有智能硬件提醒的，都不甚理想，小儿要不是完美避开了物理障碍，就是把电拨了。\n为了呵护下一代的乔布斯，也为了当代打工人还能为祖国健康工作三十年，幸福生活一辈子！\n汪二挥洒着中年程序猿的余晖，花了数月写了一个新的App，它叫顶瓜瓜！\n如何使用\n打开App，放在桌前手机支架，角度随意，只要能拍到头即可，然后脑袋上会顶个西瓜，姿势不正确的时候，西瓜会掉下来。\n \n \n当你低头了，离桌子太近了，歪头了，它会用有多种方式提醒你，屏幕闪烁和语音提醒（可选择鸭子叫，或真人发声），如果你有Apple Watch，手表会振动。\n\n灵敏度松严可调，建议在写作业时调松，用电脑时调严一点。\n\n在公司里，为了打工人在使用时避免被老板当成在玩自拍，App 设计了10几个花式 Animoji 拟我表情头套可选（也可能更像在玩自拍），随着使用时长增加还可逐步解锁更多表情。\n\n除了可以顶西瓜，当然你也可以顶个榴莲、书、花瓶、鸟窝、皇冠等。不要低头！低头皇冠会掉！打碎了贵重的花瓶也不好啊。\n除此之外，它也是一个蕃茄钟应用，你可以选择不同时长来使用，完了有完善的统计功能可供日后分析。在App 上可查看当日/月/年/近7日/近30日专注时间，以及不良坐姿统计，数据存储采用 iCloud Private Database ，它仅由你自己可以查看自己的数据，最大化保护你的隐私，并支持多设备数据同步。\n小组件\n支持 iOS 16 锁屏小组件和 iOS 14 桌面小组件\n\n作为一个AR应用，顶瓜瓜上线的第二天就获得了 App Store 推荐啦！🎉\n\n关于用户隐私\nApp 使用 iOS 系统的机器学习，完全本地运算，无需联网，你也不用担心衣装不整时使用会被汪二偷看，另外和汪二的其他作品一样，无广告，无事绝不推送，绝不推送，送。。。\n支持设备\nApp 利用了设备的搭载的前置原深感（TrueDepth）相机，需要 iPhone X 或 iPad Pro 11-inch及后续机型才能使用(即支持FaceID)。更多参考：https://support.apple.com/HT209183\n致谢\n感谢仍在日本读书的青年才俊 Megabits（PomNow作者），设计师狳魚，YaoYao 用户群的大力支持。\n下载地址：\nhttps://apps.apple.com/app/id1629577265 或 App Store 搜索： 顶瓜瓜\n有个18元的Pro 内购，欢迎大家提出一些毫无原则的鼓励，和冲动的付款。如果你觉得毫无用处，就当手工耿的发明也行。",
          "link": "https://sspai.com/post/75692",
          "publishedOn": "2022-09-13T07:01:54.000Z",
          "wordCount": 514,
          "title": "这款 App 想再次尝试拯救下你的脖子",
          "imageUrl": "https://cdn.sspai.com/2022/09/13/771d815607f60a6d0bda5d0ee3dc4a52.png"
        },
        {
          "id": "https://sspai.com/post/75655",
          "author": "图拉鼎",
          "description": "继 7 月的《PasteNow 2.3 发布：支持 Word、Pages 下多个项目粘贴》后，PasteNow 2.4 又带来了一个非常实用的功能，即「将最近一个项目粘贴为纯文本 」。\n新特性：将最近一个项目粘贴为纯文本\n在 PasteNow 的使用场景当中，复制粘贴文本是其中最常见的一个场景，而其中又有一部分的需求是将富文本以纯文本的形式粘贴出来，或者换句话说就是：去除文本的格式。\nPasteNow 一直都有按需去除格式的功能，它可以按纯文本粘贴或原始格式（富文本）进行粘贴。不过这个过程会需要将 PasteNow 的界面唤起，并按下内置的快捷键来达到这个目标。如果需要多次处理较多的文本，处理起来就会相对比较慢了。\n于是在 2.4 版本中，针对这一场景，PasteNow 引入了一个新的快捷键，即「将最近一个项目粘贴为纯文本 」。通过设置成自己习惯的快捷键，然后就可以非常迅速地以统一的形式在任何 App 里完成文本的去格式粘贴，这个过程甚至不需要将 PasteNow 的界面呼出来！\n举个例子，比如要将一个网页富文本以纯文本形式粘贴至 Word，首先将「Option+Command+V」设置为快捷键后，接下去只需要这样操作：\n\n在 Safari 里按下 Command + C 复制一段网页文本；\n来到 Word，直接按下 Option+Command+V，那么这段网页文本就会以纯文本的形式粘贴至 Word 里面。\n\n请看视频演示：\n \n \n相信通过新增这个快捷键，PasteNow 可以又快又好地完成纯文本粘贴这一场景的需求。\nmacOS 版本及 iOS 版本的其他更新\n和以往版本一样，每个版本也会带来旧有功能的完善和修复，其他更新有：\n\n调整音效的音量大小，使与系统当前音量匹配；\n修复无法复制正在编辑的标题的问题；\n修复无法显示其他应用保存的 JPEG 格式图像的问题；\n修复 macOS 端修改列表名称后，没有同步至 iOS 端的问题；\n修复暗色模式下，在一些白色背景的剪贴板文本下无法显示标题和快捷键标识的问题。\n\n其中 iOS 版本最主要的变化是完善了对 iOS 16 的适配：\n\n修复了在 iOS 16 Beta 版本中，底部工具栏会布局错乱的问题；\n修复无法通过搜索标题找到对应项目的问题。\n\n小结\n目前 PasteNow 还有很多需求和功能有待去实现，我会继续保持节奏，将其不断完善下去。\n附：App Store 链接",
          "link": "https://sspai.com/post/75655",
          "publishedOn": "2022-09-13T06:37:56.000Z",
          "wordCount": 548,
          "title": "PasteNow 2.4 发布：快速将最近一个项目粘贴为纯文本",
          "imageUrl": "https://cdn.sspai.com/2022/09/13/7488f8832660a6fce2ba647156171b71.png"
        },
        {
          "id": "https://sspai.com/post/75690",
          "author": "红酒皇",
          "description": "本文参与数字文具盒征文活动。\n产生学术外脑的需求\n从我们最熟悉的九年义务教育开始，学习就意味着老师发下来新的课本，孩子们对课本的朗读、背诵和课后习题的思考。「课本」是我们最习惯的接触知识的渠道。来到大学，当学习不再来自学校和家长的压力，对专业知识的获取更大程度取决于个人的管理，「课本」就成为了在学术道路上前进最自然的敲门砖。\n自大一使用数字化笔记伊始，我就开始钻研如何更好地阅读「课本」。每一门课程推荐阅读的参考书目，最后都通过我的知识处理流程成为我知识仓库的一部分。相应的，作为知识处理载体的 MarginNote 是以书目为主要处理对象进行加工的。我对任一知识的理解，都以文本为土地生长于文本，也正因为如此，它们始终无法脱离文本。当我在想到某一点时，我总会进而联想到这是在书中的第几章、第几节甚至于第几页。\n「课本」的章节条分缕析\n这恰是因为我所阅读的参考书目，本身为了阐述这一理论时，已经形成一套体系，通过作者对理论的理解串而联之，由目录一览无遗，因此我的学习不过是我对于作者自建知识系统的读取（以及批注）。这使得我对知识的理解方便快捷许多，因为每一知识之间的联系已经植根于文本之中，而我的学习过程更接近于摘下树木结出的果子。\n当开始进行理论课题研究后，我就不再能直接参考一套现有的体系，而必须要创造一套「知识系统」，使其能完整地说明这一课题对象的方方面面。只有具有了足够扎实的土壤，也就是与课题相关的足够知识，才能够创造出一棵身形完整的树木。这时候我需要从知识仓库的储备中选择合适的对象，说明其中的联系，哪颗葡萄长在哪根藤上，才能够写出一篇言之凿凿详实陈告的学术论文。\n知识的结构却不一定遵循写作顺序\n学术论文是厚积薄发，其内容相较于写作之人所掌握的知识必然是瓢水量海。因此，一篇优秀的学术论文背后离不开一个硕大的知识仓库。如果我们能够借用之前学习的思路，也为这一阶段的研究找到一个载体能够…",
          "link": "https://sspai.com/post/75690",
          "publishedOn": "2022-09-12T15:02:12.000Z",
          "wordCount": 653,
          "title": "数字工具盒｜用 Obsidian 来打造你的学术外脑",
          "imageUrl": "https://cdn.sspai.com/2022/09/16/e3e17f6fe266f0f20446fdd529a41b94.png"
        },
        {
          "id": "https://sspai.com/post/75682",
          "author": "玉树芝兰",
          "description": "Matrix 首页推荐 \nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。 \n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\nStable Diffusion 的人工智能绘画能力，我在之前已经不止一次给你展示过了。\n \n \n目前， Stable Diffusion 的代码和模型都已开源。按理说，每一个感兴趣的用户，都应该正在开心地尝试作画。但是，这种模型执行起来，需要足够的算力支持。前些日子，你还得需要一块专业级 GPU 来运行它。我买不起专业 GPU 怎么办呢？就从 Google Colab 租了云 GPU 来用。为此，还交了钱订阅 Colab Pro 。\n\n而随着最近 PyTorch 对苹果 ARM 芯片支持的完善，你现在完全可以在自己的 M1/M2 Mac 上面运行 Stable Diffusion ，来获得绘图结果了。\n想想看，不花一分钱去租或者买 GPU ，就能在本地出图。那岂不是相当于把一个插画师随身携带了？想想都兴奋。\n但问题是，在上周，为了实现这个功能，你还需要按照别人提供的详细教程，在本地安装一系列的软件包。但凡在设置上稍微出点儿问题，往往就会让小白用户手足无措。\n\n嘿，我明明只是打算输入文本生成图像，为什么需要达到计算机二级终端命令行操作水平才行？\n这个痛点，不只是想尝鲜的新手会有，就连专业人士也会觉得很麻烦。这么多年被图形界面宠坏了，大伙儿早就更习惯了窗口交互。连换个描述语，都要在一行行代码里面做文本替换，不愉快。\n今天我偶然看到了一个新的 Github 项目，叫做 Diffusion Bee ，可以有效解决咱们这个痛点 —— 终于，在 M1/M2 Mac 上面，图形界面开箱即用。不需要手动安装依赖、命令行输入参数，更不用对报错…",
          "link": "https://sspai.com/post/75682",
          "publishedOn": "2022-09-12T08:41:07.000Z",
          "wordCount": 641,
          "title": "如何在你的 M1/M2 Mac 本地运行 Stable Diffusion？",
          "imageUrl": "https://cdn.sspai.com/2022/09/12/6fee57e54f3299ce6ffec7bb781b4e26.png"
        },
        {
          "id": "https://sspai.com/post/75666",
          "author": "陳川端",
          "description": "Matrix 首页推荐\nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。\n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\n在最初打造 work-life balance 的居家空间时，物件的采购上确实更接近科技爱好者的「实用主义」，比如 BenQ 和 Wit 的灯具，极米的投影，甚至是全屋各个插座配置的多口氮化镓充电头等等，从实际体验到购买参考上的价值角度，每一件都很适合作为社区里「新玩意」栏目中的内容进行分享。\n\n但「器材」带来的兴奋很快就会过去，分享欲被时间消解，最近的购买也渐渐转向了那些「谈不上多有用，但就是喜欢」的东西，索性就用一个合集，整理一下最近带回家的「朋友们」。\n「红磨坊的舞会」油画&Pantasy 拼奇积木神奈川冲浪里\n前段时间的高温天气着实难熬，因为旅行家里空了几天，返沪时才发现在客厅的长杆蜡烛都被融弯，于是下定决心要换上一些「蓝色系」的点缀，试图在视觉上让自己有清凉的感觉。\n\n抱着这样的想法最近频繁逛了市集、旧货仓库和线下家居店，终于找到一副以深蓝色为基色的油画 ——「红磨坊的舞会」（Auguste Renoir Bal du moulin de la Galette）。原作来自法国印象派画家雷诺阿，这一副卡通版本的画家卖家自己也不太清楚，似乎是在某次展览中撤下的作品，尺寸为 150cm x 90cm。第一眼见到就无比喜欢，清爽浪漫的童话感觉很适合用来调和目前客厅的沉闷，秒付款带回家后立刻替换了原先的主装饰画，现在从房间出来一眼就能看到这一簇蓝色，令人身心愉悦。\n\n照片里的另一抹蓝色是之前一同西北旅行的队友寄来的礼物，我们曾相约在未来走遍国内还未涉足的地方，但不久后他就入职了 Pantasy 拼奇积木，这两年屡次邀约都因为工作忙…",
          "link": "https://sspai.com/post/75666",
          "publishedOn": "2022-09-10T09:11:02.000Z",
          "wordCount": 531,
          "title": "谈不上多有用，但就是喜欢：从实用主义走向恋物情结",
          "imageUrl": "https://cdn.sspai.com/2022/09/10/ce85c6ebbaaa258455a654a0e68c4544.jpg"
        },
        {
          "id": "https://sspai.com/post/75275",
          "author": "北鸮",
          "description": "「大厂」应用在你的想象中是什么样子？动辄 10G 的占用空间，还是让老旧设备突发高热的迟缓动效？\n我们总是看到这样的例子——当一家软件公司开始做大做强，用户量飞速上涨之后，他们的产品往往就走向一条不可挽回的庞杂之路。开发团队试图用更多的新功能和更大的饼圈住更多用户，越来越臃肿的界面和逐渐扩充的体积也让用着老设备的用户更加痛苦。\n不过大厂也并非所有产品都如此不堪，总有一些优质应用，因为顶着「大厂」的帽子让用户望而却步。这篇文章就简单介绍几个由头部开发商开发的小应用，希望这些好产品能得到它们应有的认识。\n微软数学：你手机里的数学老师\n平台：iOS / Android / 网页\n\n微软数学是一款用来求解数学方程式的 App——但它不止于此。通过拍照、手写或者是键盘输入待求解的方程式，它不仅可以帮你求出结果，还可以查看详细求解过程，必要时还会附加图片，再也不怕答案里的「略」。\n书签、历史记录功能都很完善，App 还提供了测验功能，可以根据运算过的方程式生成类似的题目，帮助你巩固知识点。详细的功能我们在之前的 App+1 文章中有过介绍，如果你常常被数学困扰，微软数学可以让你的学习之路更加轻松。此外，Edge 浏览器已经内置了微软数学，你可以在打开含有数学公式的页面时尝试这一功能。\nLayout：快捷图像拼贴工具\n平台：iOS / Android\n\nLayout 是一款用来拼接图片的 App，开发者是当时推出了多款独立图像编辑应用的 Instagram。Layout 功能简单，操作也很直观，选择图片与给定的拼接模板即可。不过在 Facebook（Meta）再次改变策略后，这些独立应用又都纷纷整合回了 Instagram。2020 年 Instagram 上推出的 Layout 功能就是这款 App 的延伸。\nLayout 上次更新停留在 2018 年末，但其体积小巧，功能粗暴，成图迅…",
          "link": "https://sspai.com/post/75275",
          "publishedOn": "2022-09-10T03:00:00.000Z",
          "wordCount": 584,
          "title": "大厂出品不等于又大又慢，这 6 个小应用值得一试",
          "imageUrl": "https://cdn.sspai.com/article/340461ec-929a-554a-c28d-2b3df71429e6.jpg"
        },
        {
          "id": "https://sspai.com/post/75632",
          "author": "两颗皮蛋",
          "description": "视频文字稿部分\n引子\n2016年秋季发布会\n开头的这段演讲来自于 2019 年的苹果秋季发布会，Tim 在台上说，在苹果创办的这 40 年里，教育深深的植入进了苹果的 DNA。其实回想一下历年来苹果对外的发言，对 DNA 的表述一直是非常谨慎和克制的，尽管苹果做了许多成功的产品，但你很少会听到什么东西构成了苹果的 DNA，在我的印象中只有两个，乔布斯当年说苹果要始终走在科技和人文的交叉口，这算是一个，而 Tim 口中的教育，则是另一个。而今天这期苹果护城河的视频，我们就来聊聊教育。\n坦率来说这个话题其实很早就进入了我们的选题库当中，甚至早于创建这个频道，很早之前我跟零号喝酒的时候就聊起过，你作为一个从业者，是没有办法去忽视苹果在这方面的成就的，但同时我们也知道，这注定不是一个迎合流量的选题，客观上来说，教育这个产品的目标用户不是我，可能也不是看视频的你，做这个选题是很有风险的一件事，有可能费了很大的劲，最后数据非常差。但我后来想清楚了，既然说教育是苹果的 DNA，那我们不妨就看看苹果在教育领域都做了什么，从这些动作和体验的细节上，我们也许就能知道，苹果为何而苹果，他到底哪里不一样。这期视频没有竞品分析，可能在一些细分领域苹果还有一些对手，但把苹果所有的投入放在一起时，尤其在国内的大环境下，苹果其实是没有竞品的，这是苹果真正的护城河。那让我们正式开始。\n人人能创造\n\n我们从苹果官网开始，把官网拉到最下面看索引的部分，可以很清晰的看到五列，代表苹果在国内的所有业务，其中第四列全部都是 to B 的商业业务，这里你就能看到 Apple 与教育的入口。打开之后你就能看到教育业务线有三个分支——基础教育、高等教育和高校学生。\n\n我先来给大家简单说几句后面两个，这两个大家应该是非常熟悉的。高校学生这个，就是大家最熟悉的教育优惠，页面当中会比较详细的介绍利用苹果产品和配套的 app 都可…",
          "link": "https://sspai.com/post/75632",
          "publishedOn": "2022-09-09T09:34:15.000Z",
          "wordCount": 578,
          "title": "创新的源头，苹果的DNA（对话葛越、谢恩伟）",
          "imageUrl": "https://cdn.sspai.com/2022/09/08/63ab40959d0c1c77cf9510a293b96a0c.jpg"
        },
        {
          "id": "https://sspai.com/post/75574",
          "author": "牛肉炒饭",
          "description": "「本文参与数字文具盒征文活动」\n\n自我介绍和学习内容\n第一次在少数派发文，简单介绍下自己。我从事轨道客车研发工作，就职于吉林长春国企大厂。懂得同学应该知道坐标了，不懂但感兴趣的同学欢迎私聊骚扰^_^。虽已毕业多年，因为从事研发工作的原因，还是要学习输入许多新技能和知识。借着少数派“我的数字文具盒”征文活动，作为非“学术”仅“研究”人员的我，也来蹭蹭热度。\n本文要和大家分享我在备考剑桥商务英语（下文用“BEC”缩写代替）高级学习备考过程中使用到的几个数字文具。考BEC高级的初衷简单到有些俗气：通过考试，公司每月发1000软妹币的外语补助，每两年需要重考一次。（让大家见笑了）\n出于一切为了钱财的本我思想，我开启了BEC的备考通关之路。本文仅和大家分享备考过程中使用的工具（硬件和软件），不涉及到备考应试的相关技巧。我也会整理关于BEC学习及应试方法的文章发在少数派上，感兴趣的同学可以关注一波。\n\n帮我通关BEC的数字文具们\n10.5寸ipad pro配合一代apple pencil是我数字文具的基础载体。2018年入手的这一套组合，现在用起来体验依然良好。\n数字文具一：GoodNotes\n我使用Goodnotes做BEC网课的课堂笔记。电子笔记对于字迹不好且排版混乱人士（是我自己没错了）极其友善。\n作为一个写字丑星人，我无论怎么注意排版和字迹，笔记的可读性都差到不行。上学时的课堂笔记混乱到没有人性，每次拿自己笔记复习时，我的内心都无比emo。“记的这些破玩意，鬼才愿意看。哪里来的自信用这么好看的本子呢？还不如随便用张纸，写完就扔来得痛快！”这样的想法从小到大，有过不止一次。\n时代在发展，社会在进步！使用电子笔记可以随时调整笔记排版，虽然依然无法拯救我丑恶的字迹，但笔记整体的可读性大大提高。对于解释性的图片、题目、清单等内容，直接截图到笔记中再调整好大小。笔记质量“真的比之前有了一…",
          "link": "https://sspai.com/post/75574",
          "publishedOn": "2022-09-09T08:38:36.000Z",
          "wordCount": 475,
          "title": "我的剑桥商务英语通关文具盒",
          "imageUrl": "https://cdn.sspai.com/2022/09/06/ec78e9c50db7aa85e5791f51b67122a8.jpg"
        },
        {
          "id": "https://sspai.com/post/75630",
          "author": "LiFE",
          "description": "Matrix 首页推荐\nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。\n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\n本文写于 iPhone 14 Pro 发布当日，会在后续考虑对一些过时的内容进行更新，如有谬误欢迎指正。\n在 2022 年，智能手机显然不再是一个噱头十足的产品类别了。但在 Apple 的下一个重大产品类别「Reality」AR 眼镜出现前（或者说成熟前），iPhone 仍然是 Apple 需要全力以赴迭代以吸引消费者更新的产品。而 iPhone 14 Pro 的有趣之处在于：纵然它的硬件特性和我在发布会前预知的几乎完全吻合，我却从发布会前的「不太考虑购入」变成了「计划购入」。\n\niPhone 14 Pro 之所以能制造这样的反差，说明其主要吸引力不止硬件特性，而是在各种无法被硬件特性所囊括的设计与解决方案里。\n事实上，硬件特性和其吸引力的相关程度低，是大部分高端产品的共性。而落实到 iPhone 14 Pro 这个产品上，影响其吸引力最重要的便是交互设计与软硬件协同、为专业用户设计解决方案的能力，以及能让它在部分方面「不思进取」的资本。\n通过今天这篇文章，我想分享一下在 iPhone 14 Pro 发布之后的一些杂思，围绕「iPhone 14 Pro 对我们设计『高端产品』的启示」展开。\n注：这些杂思中可能有一部分我在曾经讲过类似的观点。然而，想到互联网的随机性让我们每次的表达能触及和启发不同的人，便觉得适当重提一些观点也无大碍（甚至不介意日后继续这样做），看过我此前作品的读者还请多多包涵。\n交互设计与软硬件协同\niPhone 14 Pro 上最吸引眼球的便是 Dynamic Island（灵动岛）这个设计。Apple 的这一巧…",
          "link": "https://sspai.com/post/75630",
          "publishedOn": "2022-09-09T07:46:07.000Z",
          "wordCount": 832,
          "title": "iPhone 14 Pro 对我们设计「高端产品」的启示",
          "imageUrl": "https://cdn.sspai.com/2022/09/08/5aba8fea58c01327bae2aff2b75d3c5d.png"
        },
        {
          "id": "https://sspai.com/post/75643",
          "author": "老木曾雪菜",
          "description": "前言\n日本作为工业强国之一，其文具产业量成熟而发达，诸多文具品牌都有百年以上的品牌历史，从早期的仿制和借鉴，到如今堪称原创程度极高、做工精巧细致、设计富有灵感和生活趣味，外观符合现代审美，因而被大家所深深喜欢。\n本篇将从品牌+代表现产产品介绍两方面，来和大家详细讲讲日系文具的趣味与实用属性。\n国誉\n\n国誉是一家综合的办公类设备供应商，创立于1905年，有极其丰富的文具产品生产线和办公家具产品供应。创始人黑田善太郎先生以封面纸起家，逐步发展成大型纸质品品牌，进而扩展到其它类别文具和家具行业。近年来也收购了多家国内企业，在我国建厂生产文具产品。\n购买国誉，还是要以他们的纸品、本册最为代表！\n国誉活页本\n\n国誉的活页本堪称是头号招牌，也是率先把活页本灵活收纳+书写的概念引入国内的学生群体，活页结构耐用，多种封面可选，后期还有不硌手的活页结构推出，非常成熟的代表作。\n\n除了结构上的优势，国誉Campus的内页纸质也是非常优秀的存在，设计有不同划线、结构的内页，并且日本进口原纸可能完美双面书写hold住钢笔。\n国誉Campus笔记本\n\n不习惯使用活页本的话，可以选择Campus系列下的笔记本，同样使用进口原纸，书写感受和活页本等同，完全hold住各种墨水~\n需要注意不要买成国誉子品牌Gambol系列，那个完全国产，虽然价格低，但不如Campus。\n国誉自我手账\n\n除了日用向的本子，国誉的自我手账是简易入手账坑的不错产品，有简约耐看的外皮和丰富的内页，可以很好得记录生活~\n每年一本，价格不贵~\n国誉对开笔袋\n\n极简设计的国誉笔袋也是品牌的热门款，拉链质感非常出色，设计简约耐看，适合中学生和办公一族！除了基础款，国誉还有些立式变形笔袋，基本都可以做到好用且耐用，值得推荐！\n国誉空气弹力剪刀\n\n国誉的这款剪刀也是站内神器之一，刃口锋利而耐用，所谓空气弹力是在握持位置增加了两个内握柄，使用感…",
          "link": "https://sspai.com/post/75643",
          "publishedOn": "2022-09-08T23:44:49.000Z",
          "wordCount": 477,
          "title": "你知道哪些日本知名文具品牌：为什么大家都爱日本文具？",
          "imageUrl": "https://cdn.sspai.com/2022/09/09/aaf4a2dcbfbe6a9f859f25cbf082b4a5.png"
        },
        {
          "id": "https://sspai.com/post/75323",
          "author": "Hermanchannn",
          "description": "Matrix 首页推荐\nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。\n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n本文封面来自：Unsplash.com\n\n七月中旬，我坐在拥挤的旅游大巴上，驶出深圳湾口岸前往隔离酒店。不知道是不是因为空调开得不够大以至于空气有点闷热，我的心情也有些沉闷，全然没有回家的兴奋。其实真要想，原因也很明了，因为自己在香港找工作的尝试失败了。\n这篇文章可能会和其他的经验总结有些不一样，因为我是站在一个失败者的角度来回顾和思考这一路上得到的经验教训。为了让自己的尝试有所价值，思考再三，我决定写下这篇文章，希望能帮助有留港工作意愿的朋友。\n本文的感受和经验根据我自己和身边朋友同学的亲身经历总结而成。因为经历和社交圈子有限，本文呈现的内容难免不能覆盖现实生活中的全部情况，请各位姑且听之，多有担待。如果有愿意分享自己经历或者想法的朋友，也欢迎留下自己的声音，共同探讨。\n受访者对于 2021 年香港就业前景看法趋负面（来源）\n专业选择\n我认为找工作是否成功包括两个衡量标准：\n\n能不能找到自己想要的工作；\n找到的工作在待遇、行业前景、个人发展空间等方面符不符合预期。\n\n我相信主观能动性的力量，但是一个人的成功，除了个人的奋斗，还需要考虑其他的客观因素。我认为找工作并不是从投递简历时才开始，甚至不是准备简历的时候开始的。很大程度上，一个人从事的职业在选择所学专业以及选择学习内容的时候就开始逐渐被决定了，甚至无论最后从事的工作和学习的内容有没有直接的联系。\n如果所学专业能更好地匹配当地市场环境和当时大背景的需求，那么找工作确实会显得事半功倍。香港作为一个外向型经济为主导的转口贸易港，如果想要留港工作，那么那些和「钱」字沾边的专业：金融、…",
          "link": "https://sspai.com/post/75323",
          "publishedOn": "2022-09-08T02:11:14.000Z",
          "wordCount": 551,
          "title": "毕业留港找工作，这些建议请笑纳",
          "imageUrl": "https://cdn.sspai.com/2022/08/29/fbb58b501630c17136cf1d98cb343063.jpg"
        },
        {
          "id": "https://sspai.com/post/75624",
          "author": "德坤",
          "description": "历史长河的锚点\n近段期间《梦华录》热播，我在豆瓣上看到网友“黄小胖”吐槽说，“感觉《梦华录》的制作方确实不完全理解北宋官制。”比如顾千帆的父亲说“你十八岁中进士，要是好好干，现在也是个翰林学士了。”事实上翰林学士官职极高，30岁左右的顾千帆正常情况下距离翰林学士还有很远的距离。\n《梦华录》\n同样的，顾千帆“兴平军节度使，参知政事，知苏州事”的父亲，这个“知苏州事”并不一定主政苏州。顾千帆父亲的历史原型可能是丁谓，有一段时间官名为持节苏州诸军事，苏州刺史，这些都不是实际岗位，都是他实际官名平江军节度使的自然延伸。换言之，丁谓当时应该在南京工作，而不是苏州。\n这名网友后来也感叹说：“《梦华录》的编剧就和我们这些普通观众一样，没有明白北宋阶官的制度，望文生义，认为苏州刺史就是苏州的官员，皇城副使就是皇城司的领导。这也是难免的，感觉只有专业人才能弄明白。”这名网友曾经对北宋奇特的官制产生了兴趣，在豆瓣友邻的鼓励下断断续续读了一些科普书籍。那么问题来了，有哪些能打通两宋与当下，专业与科普的书籍呢？或许《在田野看见宋朝》就是其中一本。包伟民先生在本书引言中，就诚恳地认为学术研究应当“走出‘专业’的圈子，以使历史知识能够走近更多的读者”。\n《在田野看见宋朝》，包伟民等著，浙江古籍出版社2022年8月出版。图源：浙江古籍出版社微信公众号\n就我个人而言，这本书之所以吸引我，在于提供了历史长河的锚点。这锚点，可以是距离我家不远的忠亭，可以是我多次穿越而过的鼓楼，可以是陆游的“深巷明朝卖杏花”，也可以是王安石在鄞县（今宁波）的新政实验。刘成国先生评价王安石时说：“所谓参天之木，必有其根；怀山之水，必有其源。”今天杭州背后的江南韵味、世代匠心，很大程度上来自两宋，而我们借助“锚点”回望两宋，也自有一股独特趣味。\n一手材料\n知乎上有网友提问说普通的中文系学生是否有阅读繁体竖排本古籍的必要。有一名网友…",
          "link": "https://sspai.com/post/75624",
          "publishedOn": "2022-09-07T15:10:39.000Z",
          "wordCount": 475,
          "title": "读书笔记141《在田野看见宋朝》",
          "imageUrl": "https://cdn.sspai.com/2022/09/07/a1ec32a3a2881abd1bfefe8ebb5db373.jpg"
        },
        {
          "id": "https://sspai.com/post/75622",
          "author": "锅从天上来",
          "description": "大部分的官方路由固件是功能、驱动固化后编译出来的，那自然缺点也很明显，很多第三方插件能提供的内容就不能用；饿，个人如果想要通过路由器实现更多功能和玩法，就只能借助于类似OpenWRT、Padavan这些第三方开源固件了。OpenWRT的框架化设计和包管理模式使用户有了完全的定制能力，国内很多软路由固件也都是基于OpenWRT深度开发的。\n\n为了解决内网设备的各种需求，就需要这些插件来支持了。我们有两种方法：第一个是主路由更换为软路由或者支持开源固件的硬路由；另一个就是添加一台支持开源固件的路由器，将其作为旁路路由使用。不过现在是千兆接入，一个支持2.5G及以上WAN口的旗舰硬路由，价格完全够搞台软路由的价格了，所以添置旁路路由是更合算过渡方案。\n\n1.第一次升级：两台硬路由的旁路由化尝试\n这次选择了GL.inet的两台支持OpenWRT的小路由：MT1300和SFT1200。SFT1200算是MT1300的SoC国产化后的一个低配版，二者使用了同样的模具设计，仅有颜色不同。\n\n所以二者的一致性还是很高的，同样都是一个千兆WAN口、两个千兆LAN口，有一个USB-A接口，同样都通过USB-C接口供电。\n\n不过SFT1200精简掉了网口的指示灯，并且USB-A的规格也降到了2.0，供电接口同样是使用的USB-C。\n\n另外就是SFT1200取消了TF卡槽，只能够通过USB接口进行存储扩展。MT1300的插槽标注支持128G，实测200G的卡的还是可以正确识别的。\n\n另一侧的模式选择与Reset按键，没有进行改动，二者这侧没有区别。\n\n在外观以外，MT1300的处理器是联发科MT7261A，32+256MB配置；SFT1200的处理器是矽昌SF19A2890，双128配置。不过二者差价在百元左右，这些差异倒也可以接受。\n\n上电待路由器完全启动后，我们就可以连接对应的Wi-Fi了。M…",
          "link": "https://sspai.com/post/75622",
          "publishedOn": "2022-09-07T14:22:46.000Z",
          "wordCount": 524,
          "title": "OpenWRT和软路由？我的踩坑手册就是你的入门指南",
          "imageUrl": "https://cdn.sspai.com/2022/09/07/10e54f861ed12d9e102f625ab45ccec0.jpg"
        },
        {
          "id": "https://sspai.com/post/75619",
          "author": "Fairyex",
          "description": "我前几天无聊在刷哔哩哔哩的时候，看到一个很吸引人的标题「充电，拓展，储存一步到位」，点进去看原来是一家创业公司 X-STATION 发布了一个名字叫「Cyberize 玲珑坞」充电头。看完宣传片后我直呼好家伙，表面上是 GaN 氮化镓 65W 快充头，背地里却偷偷给你最高 1TB 存储，还附带拓展坞和 HDMI 投屏功能，这是什么周星驰行为？\n我平时就喜欢折腾一些奇奇怪怪的东西，这玩意儿还能解决出门带上一堆乱七八糟东西的麻烦，自然跑不掉我的欲（划掉）愿望清单，赶紧弄了个回来体验一下。在体验了一周多之后我想说：\n坏消息 —— 是个缝合怪；\n好消息 —— 全缝上了。\n\nPS：先声明没有恰饭，纯粹是自己的体验，然后已经了解简单情况和基础参数的朋友，可以直接跳到后面的日常使用场景体验和玩法部分，看看有没有你心动的场景。\n\n过一遍外观和简单参数\n虽然说充电头也不太容易长成惊世骇俗的模样，但我们还是先来简单看看外观和一些参数。\n我拿到手的配件非常简单，就充电头，收纳包还有一条线（买手机不送充电头，买充电头居然送收纳包，十分不环保哈哈），收纳包的质感非常像耳机收纳包，不能说毫不相干，只能说一模一样。\n充电头和配件\n首次上手玲珑坞给我的感觉就是很轻巧，居然比 OPPO 自带的快充头还轻，重量大概就和小米送的 30W 快充头差不多（99g）。而且大小也是很正常的充电头大小（663CM），仅仅比小米送的 30W 充电头大一点点，和普通 100W GaN 快充头差不多大小，要知道玲珑坞里面还塞了一个固态硬盘和 HDMI 头，这个体积和重量控制还是可以的。另外两个充电脚也是直角收纳设计，不像普通充电头还要突出两个充电脚，进一步减少体积方便收纳。\n与不同充电头和固态硬盘大小的对比\n另外玲珑坞还自带三个不同颜色的橡胶圈让你套在充电头中间，非常有效防止你财力雄厚买了很多个，然后不小心把装着老师作品的充电…",
          "link": "https://sspai.com/post/75619",
          "publishedOn": "2022-09-07T10:07:16.000Z",
          "wordCount": 723,
          "title": "快充头，但是移动硬盘/拓展坞/投屏神器：X-STATION 玲珑坞是个啥？",
          "imageUrl": "https://cdn.sspai.com/2022/09/07/12d5662e21e3a84330e60fb467b51b62.jpg"
        }
      ]
    },
    {
      "title": "Opensource.com",
      "feedUrl": "https://opensource.com/feed",
      "siteUrl": "https://opensource.com/",
      "articles": [
        {
          "id": "70198 at https://opensource.com",
          "author": "Chris Hermansen",
          "description": "Fix the apt-key deprecation error in Linux\nChris Hermansen\nFri, 09/16/2022 - 03:00\n\n            \nThis morning, after returning home from a mini vacation, I decided to run apt update and apt upgrade from the command line just to see whether there had been any updates while I was offline. After issuing the update command, something didn't seem quite right; I was seeing messages along the lines of:\nW: https://updates.example.com/desktop/apt/dists/xenial/InRelease: Key is stored in legacy trusted.gpg keyring (/etc/apt/trusted.gpg), see the DEPRECATION section in apt-key(8) for details.\nTrue, it's just a warning, but still there's that scary word, deprecation, which usually means it's going away soon. So I thought I should take a look. Based on what I found, I thought my experience would be wor…",
          "link": "https://opensource.com/article/22/9/deprecated-linux-apt-key",
          "publishedOn": "2022-09-16T07:00:00.000Z",
          "wordCount": 2113,
          "title": "Fix the apt-key deprecation error in Linux",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/mistake_bug_fix_find_error.png"
        },
        {
          "id": "70207 at https://opensource.com",
          "author": "Lauren Pritchett",
          "description": "24 of our favorite articles in a downloadable eBook\nLauren Pritchett\nThu, 09/15/2022 - 03:00\n\n            \nOne day in March of 2020, a few of my Opensource.com teammates and I grabbed lunch to talk about how we would work from home for the next couple of weeks until this pandemic got nipped in the bud. At the end of the work day, I packed up my laptop and walked out the door of our office building. Several months later, we were all still working from home. None of us had returned to our office-based workstations. In July 2020, using safety precautions, we were granted access to our workstation solely to retrieve personal items. My desk was left exactly as I left it that afternoon in March. Expiring snacks stashed in my secret drawer. Picture frames collecting dust. Comic strips pinned up.\n…",
          "link": "https://opensource.com/article/22/9/opensource-yearbook-2022",
          "publishedOn": "2022-09-15T07:00:00.000Z",
          "wordCount": 1535,
          "title": "24 of our favorite articles in a downloadable eBook",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/diversity-inclusion-transformation-change_20180927.png"
        },
        {
          "id": "70195 at https://opensource.com",
          "author": "Michael Anello",
          "description": "How I switched from Docker Desktop to Colima\nMichael Anello\nThu, 09/15/2022 - 03:00\n\n            \nDDEV is an open source tool that makes it simple to get local PHP development environments up and running within minutes. It’s powerful and flexible as a result of its per-project environment configurations, which can be extended, version controlled, and shared. In short, DDEV aims to allow development teams to use containers in their workflow without the complexities of bespoke configuration.\nDDEV replaces more traditional AMP stack solutions (WAMP, MAMP, XAMPP, and so on) with a flexible, modern, container-based solution. Because it uses containers, DDEV allows each project to use any set of applications, versions of web servers, database servers, search index servers, and other types of sof…",
          "link": "https://opensource.com/article/22/9/docker-desktop-colima",
          "publishedOn": "2022-09-15T07:00:00.000Z",
          "wordCount": 1706,
          "title": "How I switched from Docker Desktop to Colima",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/coffee_cafe_brew_laptop_desktop.jpg"
        },
        {
          "id": "70184 at https://opensource.com",
          "author": "Seth Kenlon",
          "description": "3 steps to protect your home network\nSeth Kenlon\nWed, 09/14/2022 - 03:00\n\n            \nThe typical setup for Internet connectivity today is for your home to have a router, usually a little physical box located somewhere in your house, that acts as a gateway to the rest of the world. The router creates a local network, and you connect your devices to it, including your computer, mobile, TV, game console, and anything else that needs to connect to the Internet or to each other. It's deceptively easy to think of this setup as there being two \"sides\" of your router: On one side there's the Internet, and on the other, your devices. That's an awful colloquial, though, because in reality there's an entire worldwide network of computers on one side of your router, and your digital life on the othe…",
          "link": "https://opensource.com/article/22/9/protect-home-network",
          "publishedOn": "2022-09-14T07:00:00.000Z",
          "wordCount": 2627,
          "title": "3 steps to protect your home network",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/wfh_work_home_laptop_work.png"
        },
        {
          "id": "70179 at https://opensource.com",
          "author": "Bobby Gryzynger",
          "description": "Packaging Job scripts in Kubernetes operators\nBobby Gryzynger\nWed, 09/14/2022 - 03:00\n\n            \nWhen using a complex Kubernetes operator, you often have to orchestrate Jobs to perform workload tasks. Examples of Job implementations typically provide trivial scripts written directly in the manifest. In any reasonably-complex application, however, determining how to handle more-than-trivial scripts can be challenging.\nIn the past, I've tackled this problem by including my scripts in an application image. This approach works well enough, but it does have a drawback. Anytime changes are required, I'm forced to rebuild the application image to include the revisions. This is a lot of time wasted, especially when my application image takes a significant amount of time to build. This also mean…",
          "link": "https://opensource.com/article/22/9/packaging-job-scripts-kubernetes-operators",
          "publishedOn": "2022-09-14T07:00:00.000Z",
          "wordCount": 1900,
          "title": "Packaging Job scripts in Kubernetes operators",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/kubernetes_containers_ship_lead.png"
        },
        {
          "id": "70192 at https://opensource.com",
          "author": "David Both",
          "description": "How I troubleshoot swappiness and startup time on Linux\nDavid Both\nTue, 09/13/2022 - 03:00\n\n            \nI recently experienced another interesting problem in the Linux startup sequence that has a circumvention–not a solution. It started quite unexpectedly.\nI was writing a couple of articles while making some updates to my personal copy of my series of books, \"Using and Administering Linux: Zero to SysAdmin.\" I had four instances of LibreOffice Write open to doing all that. I had three VMs running with VirtualBox to test some of the things I was writing about. I also had LibreOffice Impress open to work on an unrelated presentation. I like to listen to music, so I had one of several tabs in Firefox open to Pandora, my music streaming service of choice. I had multiple Bash shells open using…",
          "link": "https://opensource.com/article/22/9/swappiness-startup-linux",
          "publishedOn": "2022-09-13T07:00:00.000Z",
          "wordCount": 2468,
          "title": "How I troubleshoot swappiness and startup time on Linux",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/gears_devops_learn_troubleshooting_lightbulb_tips_520.png"
        },
        {
          "id": "70190 at https://opensource.com",
          "author": "Nicko Guyer",
          "description": "Open source blockchain development: Get started with Hyperledger FireFly\nNicko Guyer\nTue, 09/13/2022 - 03:00\n\n            \nIt takes more than a blockchain node to build enterprise-grade applications at scale. As a result, developers often find themselves building plumbing from scratch to make their business logic work. The release of Hyperledger FireFly changed blockchain development, offering developers a full stack of tools to build and scale secure web applications using familiar APIs. FireFly’s next-gen platform simplifies development, making it easy to connect across multiple public and private chains while running many use cases simultaneously. Whether you want to build on permissioned chains like Hyperledger Fabric, Corda, or Enterprise Ethereum, or public chains like Ethereum, Poly…",
          "link": "https://opensource.com/article/22/9/blockchain-hyperledger-firefly",
          "publishedOn": "2022-09-13T07:00:00.000Z",
          "wordCount": 2067,
          "title": "Open source blockchain development: Get started with Hyperledger FireFly",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/cube_innovation_process_block_container.png"
        },
        {
          "id": "70189 at https://opensource.com",
          "author": "Vojtech Polasek",
          "description": "Remixing Linux for blind and visually impaired users\nVojtech Polasek\nTue, 09/13/2022 - 03:00\n\n            \nWhen I was around 5 years old, my father brought home our first computer. From that moment on, I knew I wanted to pursue a career in computers. I haven't stopped hanging around them since. During high school, when considering which specific area I wanted to focus on, I started experimenting with hacking, and that was the moment I decided to pursue a career as a security engineer.\nI'm now a software engineer on the security compliance team. I've been at Red Hat for over two years, and I work remotely in the Czech Republic. I've used Linux for about 12 years, mainly Arch Linux and Fedora, but I've also administered Debian, Gentoo, and Ubuntu in the past.\n  \n\n\n      \n   \nImage by: \n(Vojt…",
          "link": "https://opensource.com/article/22/9/linux-visually-impaired-users",
          "publishedOn": "2022-09-13T07:00:00.000Z",
          "wordCount": 2565,
          "title": "Remixing Linux for blind and visually impaired users",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/lightbulb_computer_person_general_.png"
        },
        {
          "id": "70193 at https://opensource.com",
          "author": "David Both",
          "description": "How I recovered my Linux system using a Live USB device\nDavid Both\nMon, 09/12/2022 - 03:00\n\n            \nI have a dozen or so physical computers in my home lab and even more VMs. I use most of these systems for testing and experimentation. I frequently write about using automation to make sysadmin tasks easier. I have also written in multiple places that I learn more from my own mistakes than I do in almost any other way.\nI have learned a lot during the last couple of weeks.\nI created a major problem for myself. Having been a sysadmin for years and written hundreds of articles and five books about Linux, I really should have known better. Then again, we all make mistakes, which is an important lesson: You're never too experienced to make a mistake.\nI'm not going to discuss the details of m…",
          "link": "https://opensource.com/article/22/9/recover-linux-system-live-usb",
          "publishedOn": "2022-09-12T07:00:00.000Z",
          "wordCount": 2176,
          "title": "How I recovered my Linux system using a Live USB device",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/markus-winkler-usb-unsplash.jpg"
        },
        {
          "id": "70168 at https://opensource.com",
          "author": "Nicolas Mengin",
          "description": "Control your home automation remotely with Raspberry Pi and Traefik Hub\nNicolas Mengin\nMon, 09/12/2022 - 03:00\n\n            \nOver the years, several friends have asked me for tips on managing their home networks. In most cases, they are setting up home automation and want to access their services from the outside.\nEvery time I helped them, each made the same comment: \"Are you kidding? It cannot be so complicated to publish one simple application!\"\nPublishing applications that don't put your network or cluster at risk can indeed be quite complicated. When we started working on Traefik Hub—the latest product by Traefik Labs—I knew it would be a game-changer for publishing applications.\nThis article demonstrates the complexity of publishing services and how Traefik Hub makes your life a lot e…",
          "link": "https://opensource.com/article/22/9/home-automation-traefik-raspberry-pi",
          "publishedOn": "2022-09-12T07:00:00.000Z",
          "wordCount": 2483,
          "title": "Control your home automation remotely with Raspberry Pi and Traefik Hub",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/house_home_colors_live_building.jpg"
        }
      ]
    },
    {
      "title": "The Verge -  All Posts",
      "feedUrl": "https://www.theverge.com/rss/index.xml",
      "siteUrl": "https://www.theverge.com/",
      "articles": [
        {
          "id": "https://www.theverge.com/2022/9/16/23355255/signify-wiz-spacesense-wi-fi-motion-sensing-smart-lights",
          "author": null,
          "description": "SpaceSense will turn WiZ light bulbs into motion sensors. | Image: Signify\n    \n\n  \nMotion-triggered smart lighting is pretty magical. Figuring out how to set up little white motion sensors all over your house to make it work is not. With its new SpaceSense feature, Signify may have come up with the perfect solution: let the light bulbs do the work.\nSpaceSense is a software feature coming to Signify’s Wi-Fi smart lighting line WiZ later this month. It uses Wi-Fi sensing technology that detects changes in Wi-Fi signal strength caused by movement to turn lights on when someone walks into a room and off when motion stops. Wi-Fi sensing is already being used in some routers and security systems, and it was only a matter of time until a lighting company figured out how to apply it to their tech.\nWith WiZ, the sensing...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/16/23355255/signify-wiz-spacesense-wi-fi-motion-sensing-smart-lights",
          "publishedOn": "2022-09-16T10:35:00.000Z",
          "wordCount": 12088,
          "title": "WiZ’s smart lights can now be motion sensors",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/KynW7Y6iZYdIRcfH1r8zic0jKlA=/0x0:5191x2914/1200x628/filters:focal(3138x1428:3139x1429)/cdn.vox-cdn.com/uploads/chorus_asset/file/24026163/SpaceSense_MOM_CAT_SPLIT_16_9.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/16/23356241/iphone-ios-screenshot-trick-neat-scribbles-why-u-no",
          "author": null,
          "description": "The iPhone has another hidden screenshot trick. | Photo by Amelia Holowaty Krales / The Verge\n    \n\n  \nI feel exactly the same as a TikTok creator that uncovered a hidden trick to make the scribbles on your screenshots way neater: why did nobody tell me about this? Ramal Media posted a video on TikTok this week showing how you can easily hold down on scribbles you make on iPhone screenshots to make circles look perfect or arrows look like actual arrows instead of a mess.\nIn fact, most shapes work here. If you’re a fan of squares, rectangles, or even triangles, just simply draw them messily and then hold down to witness magic. I have no idea when Apple added this to the screenshot tool, but it’s been available since iOS 15 at least. A similar trick has also been available in the Notes app for a couple of years.\n  @ramalmedia \n  Make your...\n\n\n\n  \nContinue reading…",
          "link": "https://www.theverge.com/2022/9/16/23356241/iphone-ios-screenshot-trick-neat-scribbles-why-u-no",
          "publishedOn": "2022-09-16T10:18:42.000Z",
          "wordCount": 11376,
          "title": "Why didn’t anyone tell me about this iOS screenshot trick?",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/fiIhMgxCSutHZTQgHwUrv3XJt2U=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/24020035/226270_iPHONE_14_PHO_akrales_0607.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/16/23356213/uber-hack-teen-slack-google-cloud-credentials-powershell",
          "author": null,
          "description": "Illustration by Alex Castro / The Verge\n    \n\n  \nUber says it’s investigating a “cybersecurity incident” amidst reports that the company’s internal systems have been breached. The alleged hacker, who claims to be an 18-year old, says they have administrator access to company tools including Amazon Web Services and Google Cloud Platform. The New York Times reports that the ride-hailing business has taken multiple internal systems, including Slack, offline while it investigates the breach.\nWhen contacted for comment by The Verge, a spokesperson for the company declined to answer additional questions, and pointed to its statement on Twitter. “We are currently responding to a cybersecurity incident. We are in touch with law enforcement and will post additional updates here as they become...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/16/23356213/uber-hack-teen-slack-google-cloud-credentials-powershell",
          "publishedOn": "2022-09-16T08:48:17.000Z",
          "wordCount": 12264,
          "title": "Uber apparently hacked by teen, employees thought it was a joke",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/lHax91y3Noi1_AheJhxW8d_UL68=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/13175209/acastro_180927_1777_uber_0002.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/15/23329654/california-governor-gavin-newsom-ab-2273-social-media-children-code-law-signed",
          "author": null,
          "description": "Photo by Justin Sullivan/Getty Images\n    \n\n  \nCalifornia Governor Gavin Newsom has signed the California Age-Appropriate Design Code Act, a law mandating additional safeguards for minors on social media. The bill, AB 2273, passed the state legislature in August, and it’s slated to go into effect on July 1st, 2024.\nAB 2273’s supporters pitched it as a supplement to federal online child protection laws, which apply to children under 13. The law raises the age bar to 18, and it covers web services “likely” to get underage visitors, not just those aimed at kids. These sites must assess the potential harms for children on their platform, limit data collection and sharing for these users, and attempt to estimate the age of children on the platform. A press release from Newsom’s office...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/15/23329654/california-governor-gavin-newsom-ab-2273-social-media-children-code-law-signed",
          "publishedOn": "2022-09-15T20:47:59.000Z",
          "wordCount": 11707,
          "title": "Gavin Newsom signs California social media overhaul for minors",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/i_lpfrx58j7j-gMMoRvqkaRzpj4=/0x0:5528x3692/1200x628/filters:focal(2764x1846:2765x1847)/cdn.vox-cdn.com/uploads/chorus_asset/file/23983525/1414504112.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/15/23355418/uber-lyft-gig-economy-ftc-lina-khan-employees-wage-price-fixing",
          "author": null,
          "description": "FTC Chairwoman Lina Khan glances at SEC Chairman Gary Gensler during a House Financial Services Committee hearing. | Photo by Tom Williams / CQ-Roll Call, Inc via Getty Images\n    \n\n  \nThe Federal Trade Commission voted today to put gig economy companies on notice, promising to protect gig workers from unfair contracts, pay, and hours. \nIn a 3-2 vote, Democratic FTC commissioners approved a new policy statement announcing that the agency would “use the full portfolio of laws it enforces to prevent unfair, deceptive, anticompetitive and otherwise unlawful practices affecting gig workers.” \nSpecifically, the FTC said it would go after companies that misrepresent a worker’s potential earnings or wrongfully use artificial intelligence to evaluate worker productivity. The agency also plans to investigate the industry for evidence of wage-fixing between companies. \n“No matter how gig companies choose to classify them, gig...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/15/23355418/uber-lyft-gig-economy-ftc-lina-khan-employees-wage-price-fixing",
          "publishedOn": "2022-09-15T20:08:04.000Z",
          "wordCount": 12269,
          "title": "The FTC promises to investigate gig companies over wage-fixing",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/W0evMFISf3xZagBvjwlc1tsEFPw=/0x0:7829x5220/1200x628/filters:focal(3915x2610:3916x2611)/cdn.vox-cdn.com/uploads/chorus_asset/file/24026572/1240746545.jpg"
        }
      ]
    },
    {
      "title": "Ars Technica",
      "feedUrl": "https://arstechnica.com/feed/",
      "siteUrl": "https://arstechnica.com",
      "articles": [
        {
          "id": "https://arstechnica.com/?p=1882005",
          "author": "Dan Goodin",
          "description": "Threat actor has connections to hackers backed by North Korean government.",
          "link": "https://arstechnica.com/?p=1882005",
          "publishedOn": "2022-09-16T00:37:16.000Z",
          "wordCount": 1325,
          "title": "Trojanized versions of PuTTY utility being used to spread backdoor",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2021/02/evil-packet-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881746",
          "author": "Jennifer Ouellette",
          "description": "\"I say we sit here and wait for death.... some combination of sitting and death.\"",
          "link": "https://arstechnica.com/?p=1881746",
          "publishedOn": "2022-09-15T23:35:04.000Z",
          "wordCount": 1878,
          "title": "HBO drops official trailer for Avenue 5’s second and final season",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/avenueTOP-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881985",
          "author": "Beth Mole",
          "description": "The meeting follows years of mounting data on inaccuracies and potential harms.",
          "link": "https://arstechnica.com/?p=1881985",
          "publishedOn": "2022-09-15T23:04:13.000Z",
          "wordCount": 1587,
          "title": "Dangerously wrong oxygen readings in dark-skinned patients spur FDA scrutiny",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-628300138-760x380.jpeg"
        },
        {
          "id": "https://arstechnica.com/?p=1881804",
          "author": "Sam Machkovech",
          "description": "In-depth analysis has us wondering what is going on with Halo's stewardship.",
          "link": "https://arstechnica.com/?p=1881804",
          "publishedOn": "2022-09-15T22:26:18.000Z",
          "wordCount": 1723,
          "title": "Halo Infinite’s canceled split-screen campaign can be uncanceled by exploit",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/in-space-no-one-can-hear-you-split-screen-coop-halo-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880190",
          "author": "Jennifer Ouellette",
          "description": "Maya ritual enemas, constipated scorpions, and moose crash test dummies feature.",
          "link": "https://arstechnica.com/?p=1880190",
          "publishedOn": "2022-09-15T22:00:26.000Z",
          "wordCount": 1824,
          "title": "Here are the winners of the 2022 Ig Nobel Prizes",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/ignobles-2022-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881936",
          "author": "John Timmer",
          "description": "Most of the West Coast will need floating hardware to harvest offshore wind.",
          "link": "https://arstechnica.com/?p=1881936",
          "publishedOn": "2022-09-15T21:39:51.000Z",
          "wordCount": 1816,
          "title": "US launches program to boost floating wind turbines",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1350384252-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881775",
          "author": "Benj Edwards",
          "description": "New search engine combs through harvested images used to train Stable Diffusion, others.",
          "link": "https://arstechnica.com/?p=1881775",
          "publishedOn": "2022-09-15T21:04:08.000Z",
          "wordCount": 1788,
          "title": "Have AI image generators assimilated your art? New tool lets you check",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/haveibeentrained_search_results-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881861",
          "author": "Ashley Belanger",
          "description": "A Patreon partner explains why CSAM may still appear on Patreon.",
          "link": "https://arstechnica.com/?p=1881861",
          "publishedOn": "2022-09-15T20:32:32.000Z",
          "wordCount": 1747,
          "title": "Patreon denies child sex trafficking claims in viral TikTok “conspiracy” theory",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1232306335-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881857",
          "author": "Kyle Orland",
          "description": "Mast1c0re hijacks weaknesses in Sony's own PS2-on-PS4 game emulator.",
          "link": "https://arstechnica.com/?p=1881857",
          "publishedOn": "2022-09-15T20:14:10.000Z",
          "wordCount": 1679,
          "title": "Console hacker reveals PS4/PS5 exploit that is “essentially unpatchable”",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/getty-ps5-cdr-01-760x380.png"
        },
        {
          "id": "https://arstechnica.com/?p=1881649",
          "author": "Kevin Purdy",
          "description": "Electron-based Teams apps can be easily mined for tokens and used for phishing.",
          "link": "https://arstechnica.com/?p=1881649",
          "publishedOn": "2022-09-15T17:27:30.000Z",
          "wordCount": 1604,
          "title": "Microsoft Teams stores cleartext auth tokens, won’t be quickly patched",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/50779003257_d5ef47f87d_o-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881404",
          "author": "Samuel Axon",
          "description": "The dream of the '90s is alive on Discord.",
          "link": "https://arstechnica.com/?p=1881404",
          "publishedOn": "2022-09-15T17:20:01.000Z",
          "wordCount": 1414,
          "title": "Discord’s new feature looks a bit like Internet forums—with a dash of Reddit",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2018/12/discord-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881627",
          "author": "Ron Amadeo",
          "description": "The group has launched several successful projects, but now it's focusing on AI.",
          "link": "https://arstechnica.com/?p=1881627",
          "publishedOn": "2022-09-15T17:09:00.000Z",
          "wordCount": 1504,
          "title": "More Google cost cutting cancels half of the Area 120 projects",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/13-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881588",
          "author": "Benj Edwards",
          "description": "Adept's ACT-1 has learned how to automate complex UI tasks in web apps using an AI model.",
          "link": "https://arstechnica.com/?p=1881588",
          "publishedOn": "2022-09-15T16:52:22.000Z",
          "wordCount": 1750,
          "title": "New AI assistant can browse, search, and use web apps like a human",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/act1_hero_1-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881665",
          "author": "Jon Brodkin",
          "description": "Ethereum replaces proof-of-work with proof-of-stake, making miners unnecessary.",
          "link": "https://arstechnica.com/?p=1881665",
          "publishedOn": "2022-09-15T16:39:52.000Z",
          "wordCount": 1908,
          "title": "Ethereum completes the “Merge,” which ends mining and cuts energy use by 99.95%",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/getty-blockchain-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881710",
          "author": "WIRED",
          "description": "Yurii Shchyhol gives a rare interview about the state of the online conflict with Russia.",
          "link": "https://arstechnica.com/?p=1881710",
          "publishedOn": "2022-09-15T16:34:58.000Z",
          "wordCount": 1609,
          "title": "Ukraine’s cyberwar chief sounds like he’s winning",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/yuri-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881626",
          "author": "John Timmer",
          "description": "DNA may enable computation in storage on massive data sets.",
          "link": "https://arstechnica.com/?p=1881626",
          "publishedOn": "2022-09-15T16:28:34.000Z",
          "wordCount": 1795,
          "title": "Why are hard drive companies investing in DNA data storage?",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1352375746-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881623",
          "author": "Ashley Belanger",
          "description": "Update: Seesaw said less than 0.5 percent of accounts were spammed with Goatse.",
          "link": "https://arstechnica.com/?p=1881623",
          "publishedOn": "2022-09-15T15:57:04.000Z",
          "wordCount": 1709,
          "title": "Hack of popular parent-teacher app left users wide open to infamous shock image [Updated]",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1266301908-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881611",
          "author": "Jonathan M. Gitlin",
          "description": "Now that there's an industry standard, automakers are starting to deploy the tech.",
          "link": "https://arstechnica.com/?p=1881611",
          "publishedOn": "2022-09-15T15:34:05.000Z",
          "wordCount": 1517,
          "title": "Easier than a plug: Wireless EV charging gets ready for prime time",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/WiTricity-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1881544",
          "author": "Beth Mole",
          "description": "Sans human data, mouse study offers first direct comparison of the two omicron boosters.",
          "link": "https://arstechnica.com/?p=1881544",
          "publishedOn": "2022-09-14T23:23:50.000Z",
          "wordCount": 1816,
          "title": "Moderna-backed mouse study offers first head-to-head BA.5, BA.1 booster data",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/GettyImages-1422322378-760x380.jpeg"
        },
        {
          "id": "https://arstechnica.com/?p=1881340",
          "author": "Sam Machkovech",
          "description": "Plus, a wrap-up of Sony's TGS 2022 biggies: God of War: Ragnarok, Tekken 8.",
          "link": "https://arstechnica.com/?p=1881340",
          "publishedOn": "2022-09-14T22:48:58.000Z",
          "wordCount": 2060,
          "title": "Our biggest remaining PlayStation VR2 questions have been answered",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/horizon-vr-01-760x380.png"
        }
      ]
    },
    {
      "title": "Business Latest",
      "feedUrl": "https://www.wired.com/feed/category/business/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "63223fe940fe1e8870aa3ad0",
          "author": "Caitlin Harrington",
          "description": "A preliminary agreement prevented a total shutdown, but many supply chains still face delays and disruption caused by staff shortages.",
          "link": "https://www.wired.com/story/a-us-rail-strike-was-averted-but-the-crisis-is-far-from-over/",
          "publishedOn": "2022-09-15T21:02:20.000Z",
          "wordCount": 19346,
          "title": "A US Rail Strike Was Averted—but the Crisis Is Far From Over",
          "imageUrl": "https://media.wired.com/photos/6322602f74ce5b82a68ef210/191:100/w_1280,c_limit/Looming-US-Rail-Worker-Strike-Business-1423407361.jpg"
        },
        {
          "id": "6320a9edc9bb1af7ef249735",
          "author": "Vittoria Elliott",
          "description": "The Russian blockade and bombardments are cutting off thousands of tons of grain, threatening the food supply in countries that rely on wheat exports.",
          "link": "https://www.wired.com/story/satellites-ukraine-russia-grain/",
          "publishedOn": "2022-09-15T18:53:09.000Z",
          "wordCount": 19218,
          "title": "Satellite Data Shows How Russia Has Destroyed Ukrainian Grain",
          "imageUrl": "https://media.wired.com/photos/632235fcc4d3ebc9237bc5c6/191:100/w_1280,c_limit/Satellite-Images-Reveal-Scale-of-Russian-Grain-Blockades-Business-1241878175.jpg"
        },
        {
          "id": "6320f8e900704d14b5ffb882",
          "author": "Matt Laslo",
          "description": "Peiter “Mudge” Zatko’s allegations about the social media platform renewed a sense of urgency for lawmakers to rein in Big Tech.",
          "link": "https://www.wired.com/story/peiter-mudge-zatko-twitter-senate-judiciary-testimony/",
          "publishedOn": "2022-09-14T19:01:41.000Z",
          "wordCount": 18763,
          "title": "The Twitter Whistleblower’s Testimony Has Senators Out for Blood",
          "imageUrl": "https://media.wired.com/photos/632115df20bc56769c4130e7/191:100/w_1280,c_limit/Congress's%20takeaways%20from%20the%20Twitter%20whistleblower%20hearing-GettyImages-1423404059.jpg"
        },
        {
          "id": "631a39e1f1e5c40d2b1bc5f4",
          "author": "Gideon Lichfield",
          "description": "WIRED’s editor in chief considers Silicon Valley’s visions for the future of governance, plus more thoughts on this month’s headlines.",
          "link": "https://www.wired.com/story/who-gets-to-build-the-next-software-stack-of-civilization/",
          "publishedOn": "2022-09-14T11:00:00.000Z",
          "wordCount": 19512,
          "title": "Who Gets to Build the Next Software Stack of Civilization?",
          "imageUrl": "https://media.wired.com/photos/6321090e74ce5b82a68ef205/191:100/w_1280,c_limit/system-update-september.jpg"
        },
        {
          "id": "631fc39f8990652479ff3848",
          "author": "Matt Burgess",
          "description": "Exposing wrongdoing is risky on the best of days. Whistleblower Aid cofounder John Tye explains the extensive steps needed to keep people safe.",
          "link": "https://www.wired.com/story/whistleblower-safety-mudge-twitter-senate-hearing/",
          "publishedOn": "2022-09-13T11:00:00.000Z",
          "wordCount": 19725,
          "title": "How Whistleblowers Navigate a Security Minefield",
          "imageUrl": "https://media.wired.com/photos/631fc39f00704d14b5ffb878/191:100/w_1280,c_limit/How-Whistleblowers-Navigate-a-Security-Minefield-Security-GettyImages-1242680586.jpg"
        },
        {
          "id": "631b9e5a40fe1e8870aa3a2f",
          "author": "Adrienne So",
          "description": "The Pacific Northwest is due for a massive quake. I trained to help rescue efforts in the aftermath—by racing around the city on an electric kid hauler.",
          "link": "https://www.wired.com/story/when-the-big-one-hits-portland-cargo-bikers-will-save-you/",
          "publishedOn": "2022-09-13T10:00:00.000Z",
          "wordCount": 32833,
          "title": "When the Big One Hits Portland, Cargo Bikers Will Save You",
          "imageUrl": "https://media.wired.com/photos/631f95dbf1e5c40d2b1bc63d/191:100/w_1280,c_limit/bikeprep-topart.jpg"
        },
        {
          "id": "631f59fc40fe1e8870aa3a70",
          "author": "Morgan Meaker",
          "description": "In France, the gig economy platform welcomed thousands of immigrants during the pandemic, unions say. Now it’s deactivating them en masse.",
          "link": "https://www.wired.com/story/uber-eats-paris-protests/",
          "publishedOn": "2022-09-12T16:16:34.000Z",
          "wordCount": 20471,
          "title": "Undocumented Workers Protest Uber Eats Crackdown",
          "imageUrl": "https://media.wired.com/photos/631f59fb36c33c0247a2f06e/191:100/w_1280,c_limit/Paris-Uber-Eats-Undocumented-Workers-Business-1211132636.jpg"
        },
        {
          "id": "6315e68a44c07c3774c4cba0",
          "author": "Khari Johnson",
          "description": "The US regulator is eager to end unfair use of artificial intelligence and commercial surveillance, but experts remain skeptical.",
          "link": "https://www.wired.com/story/ftc-ai-regulation/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 21309,
          "title": "The FTC Is Closing in on Runaway AI",
          "imageUrl": "https://media.wired.com/photos/631a70b320bc56769c413043/191:100/w_1280,c_limit/business-ftc-ai.jpg"
        },
        {
          "id": "631a3a6cc9bb1af7ef2496bd",
          "author": "Steven Levy",
          "description": "Plus: Reminiscing on Steve Jobs, a question for his loved ones, and a meltdown on the West Coast.",
          "link": "https://www.wired.com/story/plaintext-silicon-valley-evil-twin-tiktok/",
          "publishedOn": "2022-09-09T13:00:00.000Z",
          "wordCount": 23461,
          "title": "Silicon Valley Is Obsessed With Its Evil Twin, TikTok",
          "imageUrl": "https://media.wired.com/photos/631a647720bc56769c41302d/191:100/w_1280,c_limit/Silicon-Valley-Obsessed-With-Evil-Twin-Business-1421429054.jpg"
        },
        {
          "id": "631a0c94f1e5c40d2b1bc5f1",
          "author": "Caitlin Harrington",
          "description": "The tech giants' corporate offices across the US  drew demonstrations over an Israeli government cloud contract that opponents say could have military uses.",
          "link": "https://www.wired.com/story/google-and-amazon-want-more-defense-contracts-despite-worker-protests/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 21065,
          "title": "Google and Amazon Seek Defense Contracts, Despite Worker Protests",
          "imageUrl": "https://media.wired.com/photos/631a83e08990652479ff37e5/191:100/w_1280,c_limit/Google-Project-Nimbus-Tech-Worker-Protests-Business-1394579808.jpg"
        },
        {
          "id": "63193523c9bb1af7ef2496bc",
          "author": "Beth Mole, Ars Technica",
          "description": "The once dominant ecigarette company faces more legal challenges and FDA scrutiny after a probe into whether it deceptively marketed to children and teens.",
          "link": "https://www.wired.com/story/juul-teen-vaping-438-million-dollar-settlement/",
          "publishedOn": "2022-09-08T21:45:00.000Z",
          "wordCount": 18865,
          "title": "Juul Will Pay $438.5M for Its Role in Underage Vaping",
          "imageUrl": "https://media.wired.com/photos/631a3aa862435d269fdbda8d/191:100/w_1280,c_limit/Juul-Settles-Youth-Vaping-Probe-Business-1182904739.jpg"
        },
        {
          "id": "631a289b36c33c0247a2f013",
          "author": "Chris Stokel-Walker",
          "description": "The UK's tech-savvy head of state was queen of a thousand memes.",
          "link": "https://www.wired.com/story/how-the-internet-will-remember-the-queen/",
          "publishedOn": "2022-09-08T17:42:34.000Z",
          "wordCount": 20909,
          "title": "Queen Elizabeth II Has Died. Her Internet Legacy Will Live On",
          "imageUrl": "https://media.wired.com/photos/631a289bc4d3ebc9237bc51f/191:100/w_1280,c_limit/QueenEliz_culture_GettyImages-1401936511.jpg"
        },
        {
          "id": "630e5fc38eb3383ad69a2480",
          "author": "Anthony Lydgate",
          "description": "Balaji Srinivasan—technologist, investor, prophet, troll—says let the old world sink. Find your tribe and build your bespoke society, or get left behind.",
          "link": "https://www.wired.com/story/balaji-srinivasan-ditch-chaos-country-cloud/",
          "publishedOn": "2022-09-06T10:00:00.000Z",
          "wordCount": 51194,
          "title": "Would You Ditch All This Chaos for a Country in the Cloud?",
          "imageUrl": "https://media.wired.com/photos/630e61933dfe1372fb611109/191:100/w_1280,c_limit/WI100122_FF_Sovereign_01.jpg"
        },
        {
          "id": "630f873cd24d6c0f1431f888",
          "author": "Arielle Pardes",
          "description": "Startup incubator Y Combinator birthed big names like Airbnb and Stripe. Incoming CEO Garry Tan says he’ll tap the program’s alumni network to generate new tech giants.",
          "link": "https://www.wired.com/story/silicon-valleys-most-powerful-mafia-gets-a-new-boss/",
          "publishedOn": "2022-09-02T11:00:00.000Z",
          "wordCount": 19694,
          "title": "Silicon Valley’s Most Powerful ‘Mafia’ Gets a New Boss",
          "imageUrl": "https://media.wired.com/photos/63111628f64c675d6d1a5121/191:100/w_1280,c_limit/Garry-Tan-YCombinator-Business-R0MKB3.jpg"
        },
        {
          "id": "63111ad53dfe1372fb611160",
          "author": "Lauren Goode",
          "description": "Some people have ditched dating apps—and opted to bare their souls via a public, view-only link instead.",
          "link": "https://www.wired.com/story/date-me-google-docs-and-the-hyper-optimized-quest-for-love/",
          "publishedOn": "2022-09-02T11:00:00.000Z",
          "wordCount": 21375,
          "title": "‘Date Me’ Google Docs and the Hyper-Optimized Quest for Love",
          "imageUrl": "https://media.wired.com/photos/631138719942353dc81f1536/191:100/w_1280,c_limit/Online-Dating-With-Google-Docs-Business-1358995285.jpg"
        },
        {
          "id": "6310e4b9f89e2120665181e8",
          "author": "Aarian Marshall",
          "description": "After two people were injured in the incident, Cruise blocked its robot vehicles from making left turns for several weeks before issuing a software update.",
          "link": "https://www.wired.com/story/gms-cruise-recalls-self-driving-software-involved-in-june-crash/",
          "publishedOn": "2022-09-01T19:34:38.000Z",
          "wordCount": 19148,
          "title": "GM's Cruise Recalls Self-Driving Software Involved in June Crash",
          "imageUrl": "https://media.wired.com/photos/6310e7d2567860ab6c66c66b/191:100/w_1280,c_limit/Cruise-Software-Government-Recall-Business-1238159557.jpg"
        },
        {
          "id": "6310a98d7ec0340e25e8b864",
          "author": "Chris Stokel-Walker",
          "description": "You’ll have 30 minutes to alter your tweets—but only if you subscribe to Twitter Blue.",
          "link": "https://www.wired.com/story/twitter-edit-button-finally/",
          "publishedOn": "2022-09-01T13:00:00.000Z",
          "wordCount": 20683,
          "title": "Twitter Finally Gets an Edit Button",
          "imageUrl": "https://media.wired.com/photos/6310a98df89e2120665181e4/191:100/w_1280,c_limit/Twitter-Gets-An-Edit-Button-Business-495787313.jpg"
        },
        {
          "id": "630506f9cea7c0581e825d21",
          "author": "Khari Johnson",
          "description": "The academic search engine’s policy on name changes is out of step with other search tools and publishers.",
          "link": "https://www.wired.com/story/trans-researchers-want-google-scholar-to-stop-deadnaming-them/",
          "publishedOn": "2022-09-01T11:00:00.000Z",
          "wordCount": 24151,
          "title": "Trans Researchers Want Google Scholar to Stop Deadnaming Them",
          "imageUrl": "https://media.wired.com/photos/630fe159567860ab6c66c667/191:100/w_1280,c_limit/business-deadnames-google.jpg"
        },
        {
          "id": "630ea52f333af8e1504c49a0",
          "author": "Caitlin Harrington",
          "description": "Ariel Koren and fellow Googlers feared the company’s technology could be used against Palestinians. She says pressure from managers forced her to resign.",
          "link": "https://www.wired.com/story/inside-google-worker-protests-of-an-israeli-government-cloud-deal/",
          "publishedOn": "2022-08-31T22:22:18.000Z",
          "wordCount": 19799,
          "title": "Behind Google Worker Protests of an Israeli Government Cloud Deal",
          "imageUrl": "https://media.wired.com/photos/630eaff0567860ab6c66c662/191:100/w_1280,c_limit/Ariel-Koren-Project-Nimbus-Q&A-Business-1359325770.jpg"
        },
        {
          "id": "630913da5d32e4cad34d6eab",
          "author": "Caitlin Harrington",
          "description": "Federal regulators and the White House have been scrambling to prevent poor service and a possible strike from jamming up a vital but often overlooked network.",
          "link": "https://www.wired.com/story/a-us-freight-rail-crisis-threatens-more-supply-chain-chaos/",
          "publishedOn": "2022-08-30T14:00:00.000Z",
          "wordCount": 25219,
          "title": "A US Freight Rail Crisis Threatens More Supply-Chain Chaos",
          "imageUrl": "https://media.wired.com/photos/630d3fff567860ab6c66c658/191:100/w_1280,c_limit/Americas-Crumbling-Railroads-Business-Alamy-2G37YC5.jpg"
        }
      ]
    },
    {
      "title": "Feed: Artificial Intelligence Latest",
      "feedUrl": "https://www.wired.com/feed/tag/ai/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "6320a9edc9bb1af7ef249735",
          "author": "Vittoria Elliott",
          "description": "The Russian blockade and bombardments are cutting off thousands of tons of grain, threatening the food supply in countries that rely on wheat exports.",
          "link": "https://www.wired.com/story/satellites-ukraine-russia-grain/",
          "publishedOn": "2022-09-15T18:53:09.000Z",
          "wordCount": 19218,
          "title": "Satellite Data Shows How Russia Has Destroyed Ukrainian Grain",
          "imageUrl": "https://media.wired.com/photos/632235fcc4d3ebc9237bc5c6/191:100/w_1280,c_limit/Satellite-Images-Reveal-Scale-of-Russian-Grain-Blockades-Business-1241878175.jpg"
        },
        {
          "id": "6315e68a44c07c3774c4cba0",
          "author": "Khari Johnson",
          "description": "The US regulator is eager to end unfair use of artificial intelligence and commercial surveillance, but experts remain skeptical.",
          "link": "https://www.wired.com/story/ftc-ai-regulation/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 21309,
          "title": "The FTC Is Closing in on Runaway AI",
          "imageUrl": "https://media.wired.com/photos/631a70b320bc56769c413043/191:100/w_1280,c_limit/business-ftc-ai.jpg"
        },
        {
          "id": "631134165d32e4cad34d6f3b",
          "author": "Amit Katwala",
          "description": "The Alphabet-backed AI firm is using virtual games to help its digital creations move more like humans.",
          "link": "https://www.wired.com/story/alphabet-deepmind-ai-humanoids-soccer-camp/",
          "publishedOn": "2022-09-02T11:00:00.000Z",
          "wordCount": 20965,
          "title": "Why DeepMind Is Sending AI Humanoids to Soccer Camp",
          "imageUrl": "https://media.wired.com/photos/631134163dfe1372fb611162/191:100/w_1280,c_limit/soccer_HZ_science_GettyImages-520264154.jpg"
        },
        {
          "id": "630506f9cea7c0581e825d21",
          "author": "Khari Johnson",
          "description": "The academic search engine’s policy on name changes is out of step with other search tools and publishers.",
          "link": "https://www.wired.com/story/trans-researchers-want-google-scholar-to-stop-deadnaming-them/",
          "publishedOn": "2022-09-01T11:00:00.000Z",
          "wordCount": 24151,
          "title": "Trans Researchers Want Google Scholar to Stop Deadnaming Them",
          "imageUrl": "https://media.wired.com/photos/630fe159567860ab6c66c667/191:100/w_1280,c_limit/business-deadnames-google.jpg"
        },
        {
          "id": "63042bb3b365e23d4dea581a",
          "author": "Nicole Kobie",
          "description": "The AI-powered online doctor app is ditching its controversial NHS contracts as it focuses on the US market.",
          "link": "https://www.wired.com/story/babylon-disrupted-uk-health-system-then-left/",
          "publishedOn": "2022-08-23T11:00:00.000Z",
          "wordCount": 23315,
          "title": "Babylon Disrupted the UK’s Health System. Then It Left",
          "imageUrl": "https://media.wired.com/photos/63042ca2f06d7dee6f53bbc6/191:100/w_1280,c_limit/Babylon-Leaves-NHS-Business-1253255825.jpg"
        },
        {
          "id": "63000f0a7072d2c1f58788fa",
          "author": "Varsha Bansal",
          "description": "Police in India's capital say they only require an 80 percent accuracy rate for matches, raising new alarm bells for civil liberty advocates.",
          "link": "https://www.wired.com/story/delhi-police-facial-recognition/",
          "publishedOn": "2022-08-21T11:00:00.000Z",
          "wordCount": 18972,
          "title": "The Low Threshold for Face Recognition in New Delhi",
          "imageUrl": "https://media.wired.com/photos/63000f0affbf585589d594df/191:100/w_1280,c_limit/Delhi-Police-Facial-Recognition-Security-GettyImages-1237447046.jpg"
        },
        {
          "id": "62fe7c6d7072d2c1f58788c9",
          "author": "Will Knight",
          "description": "A new generation of AI image tools can reproduce an artist’s signature style. Some creatives fear for their livelihoods.",
          "link": "https://www.wired.com/story/artists-rage-against-machines-that-mimic-their-work/",
          "publishedOn": "2022-08-19T11:00:00.000Z",
          "wordCount": 20895,
          "title": "Algorithms Can Now Mimic Any Artist. Some Artists Hate It",
          "imageUrl": "https://media.wired.com/photos/62feb07c4a65cec78f4b4dab/191:100/w_1280,c_limit/AI-Art-Legal-Issues-Business.jpg"
        },
        {
          "id": "62fd21cd2af3e19bf28d487e",
          "author": "Khari Johnson",
          "description": "Algorithms can amplify patterns of discrimination. Robotics researchers are calling for new ways to prevent mechanical bodies acting out those biases.",
          "link": "https://www.wired.com/story/how-to-stop-robots-becoming-racist/",
          "publishedOn": "2022-08-18T14:00:00.000Z",
          "wordCount": 24055,
          "title": "How to Stop Robots From Becoming Racist",
          "imageUrl": "https://media.wired.com/photos/62fd57104a65cec78f4b4da7/191:100/w_1280,c_limit/business-racist-ai.jpg"
        }
      ]
    },
    {
      "title": "Gear Latest",
      "feedUrl": "https://www.wired.com/feed/category/gear/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "632075bd40fe1e8870aa3a7c",
          "author": "Simon Lucas",
          "description": "Just as Apple announces its new AirPods, here comes the granddaddy of ANC to show everyone how it's really done.",
          "link": "https://www.wired.com/review/bose-quietcomfort-earbuds-ii-review/",
          "publishedOn": "2022-09-15T13:00:00.000Z",
          "wordCount": 14753,
          "title": "Bose’s QuietComfort Earbuds II Boast the Best Noise-Canceling",
          "imageUrl": "https://media.wired.com/photos/6322407974ce5b82a68ef20e/191:100/w_1280,c_limit/Bose-QuietComfort-Buds-II-Gear.jpg"
        },
        {
          "id": "6322236140fe1e8870aa3ac7",
          "author": "WIRED Staff",
          "description": "This week, we talk about the Sony PSVR2, the still-secret next Meta headset, and how virtual reality technology needs to improve to earn mainstream acceptance.",
          "link": "https://www.wired.com/story/gadget-lab-podcast-566/",
          "publishedOn": "2022-09-15T12:00:00.000Z",
          "wordCount": 46724,
          "title": "VR Is Struggling to Grow Out of Its Awkward Phase",
          "imageUrl": "https://media.wired.com/photos/632243a1c4d3ebc9237bc5c8/191:100/w_1280,c_limit/PSVR2-Gadget-Lab-Gear.jpg"
        },
        {
          "id": "5c0d879fa81512446981ce53",
          "author": "Jaina Grey",
          "description": "Lend depth and drama to your gameplay, no matter what device you have.",
          "link": "https://www.wired.com/gallery/best-gaming-headsets/",
          "publishedOn": "2022-09-15T12:00:00.000Z",
          "wordCount": 21132,
          "title": "The Best Wired Gaming Headsets for Every System",
          "imageUrl": "https://media.wired.com/photos/605a7bdf5eded543b9d756dd/191:100/w_2580,c_limit/Gear-Audeze-Penrose-src-Audeze.jpg"
        },
        {
          "id": "6320a8a762435d269fdbdb37",
          "author": "Parker Hall",
          "description": "Your old earbuds might not be cutting it for school or work. Here are some nice discounts on WIRED-tested favorites.",
          "link": "https://www.wired.com/story/headphone-deals-september-2022/",
          "publishedOn": "2022-09-14T16:44:21.000Z",
          "wordCount": 18809,
          "title": "9 Great Headphone Deals to Find Your Autumn Groove",
          "imageUrl": "https://media.wired.com/photos/5f85fd22ac6939f568f953fd/191:100/w_1280,c_limit/Gear-Beats-Studio3---credit-target.jpg"
        },
        {
          "id": "631ff01d40fe1e8870aa3a7b",
          "author": "Julian Chokkattu",
          "description": "Dynamic Island is fun, and the Always-on Display is a nice perk. But the cameras aren’t a huge leap over predecessors.",
          "link": "https://www.wired.com/review/apple-iphone-14-pro-iphone-14-pro-max/",
          "publishedOn": "2022-09-14T13:00:00.000Z",
          "wordCount": 21804,
          "title": "The iPhone 14 Pro Isn't as Big of an Upgrade as Apple Thinks",
          "imageUrl": "https://media.wired.com/photos/632119a7f1e5c40d2b1bc647/191:100/w_1280,c_limit/iPhone-14-Pro-Review-Gear.jpg"
        },
        {
          "id": "63091bb4333af8e1504c497e",
          "author": "Justin Pot",
          "description": "These four alternatives to the newsletter platform offer just as many—if not more—features, and can be easier on your wallet.",
          "link": "https://www.wired.com/story/best-substack-alternatives/",
          "publishedOn": "2022-09-14T12:00:00.000Z",
          "wordCount": 21075,
          "title": "The Best Substack Alternatives",
          "imageUrl": "https://media.wired.com/photos/6320e3e1eecde8c117e7f3f6/191:100/w_1280,c_limit/Substack-Alternatives-Gear.jpg"
        },
        {
          "id": "6320b0fcf1e5c40d2b1bc642",
          "author": "Boone Ashworth",
          "description": "Sony’s first virtual reality device in six years arrives in 2023. Here’s a preview of the PSVR2, and the games that will run on it.",
          "link": "https://www.wired.com/story/sony-psvr2-first-look/",
          "publishedOn": "2022-09-14T12:00:00.000Z",
          "wordCount": 23348,
          "title": "PlayStation VR2: A First Look at the Next-Gen Headset",
          "imageUrl": "https://media.wired.com/photos/6320ebf020bc56769c4130e5/191:100/w_1280,c_limit/Sony-PSVR2-Featured-Gear.jpg"
        },
        {
          "id": "601c24f4e2b4b36f6a1e3b1a",
          "author": "Matt Jancer",
          "description": "March to the beat of your own drum machine with the best service for new music discovery, sharing with friends, and more.",
          "link": "https://www.wired.com/gallery/best-music-streaming-apps/",
          "publishedOn": "2022-09-13T13:00:00.000Z",
          "wordCount": 19466,
          "title": "The Best Music Streaming Apps to Get Your Groove On",
          "imageUrl": "https://media.wired.com/photos/6201c95a2c286ef2d70b5b08/191:100/w_2580,c_limit/Gear-Apple-Music---credit-Matt-Jancer.jpg"
        },
        {
          "id": "631b2b75036b54662b510415",
          "author": "Jeremy White",
          "description": "Land Rover has finally brought out some proper luxury SUV hybrids, and it looks like it was just about worth the wait.",
          "link": "https://www.wired.com/review/range-rover-sport-hybrid-2022/",
          "publishedOn": "2022-09-13T12:00:00.000Z",
          "wordCount": 18598,
          "title": "The New Range Rover Hybrid Gives Off-Roading an Electric Kick",
          "imageUrl": "https://media.wired.com/photos/631f933f62435d269fdbdaef/191:100/w_1280,c_limit/Range-Rover-Hybrid-Review-Gear.png"
        },
        {
          "id": "631b9e5a40fe1e8870aa3a2f",
          "author": "Adrienne So",
          "description": "The Pacific Northwest is due for a massive quake. I trained to help rescue efforts in the aftermath—by racing around the city on an electric kid hauler.",
          "link": "https://www.wired.com/story/when-the-big-one-hits-portland-cargo-bikers-will-save-you/",
          "publishedOn": "2022-09-13T10:00:00.000Z",
          "wordCount": 32833,
          "title": "When the Big One Hits Portland, Cargo Bikers Will Save You",
          "imageUrl": "https://media.wired.com/photos/631f95dbf1e5c40d2b1bc63d/191:100/w_1280,c_limit/bikeprep-topart.jpg"
        },
        {
          "id": "631a4ea4d884b4dcc9416479",
          "author": "Brenda Stolyar, Adrienne So",
          "description": "The latest software for your Apple Watch is here, complete with fresh faces, sleep stages, and low-power mode.",
          "link": "https://www.wired.com/story/apple-watchos-9-new-features/",
          "publishedOn": "2022-09-12T18:00:31.000Z",
          "wordCount": 24726,
          "title": "The Top New Features in Apple’s WatchOS 9",
          "imageUrl": "https://media.wired.com/photos/631f5e52f1e5c40d2b1bc630/191:100/w_1280,c_limit/TA_Power-and-Elevation-Workout-View-SOURCE_-APPLE.jpg"
        },
        {
          "id": "629e135a83c980195cb99f16",
          "author": "Julian Chokkattu, Brenda Stolyar",
          "description": "The latest iPhone update is now available for download, complete with a revamped lock screen, editable Messages, and more.",
          "link": "https://www.wired.com/story/apple-iphone-ios-16-ipados-16-new-features/",
          "publishedOn": "2022-09-12T17:00:00.000Z",
          "wordCount": 29695,
          "title": "The Top New Features in Apple’s iOS and iPadOS 16",
          "imageUrl": "https://media.wired.com/photos/629e50bebb966dfe6e2d39cd/191:100/w_1280,c_limit/iOS-Lock-Screen-Widgets-Hero-Gear.jpg"
        },
        {
          "id": "5ee9319fecb467cf4ea5f592",
          "author": "Adrienne So",
          "description": "Our tips and picks can up your mask game—whether you're heading back to the office or just want to stay safe and stylish.",
          "link": "https://www.wired.com/gallery/best-face-masks/",
          "publishedOn": "2022-09-12T13:00:00.000Z",
          "wordCount": 26536,
          "title": "16 Face Masks We Actually Like to Wear",
          "imageUrl": "https://media.wired.com/photos/60231225daa2245a9ec352eb/191:100/w_2580,c_limit/Gear-Primal-Filter-+-Frame-SOURCE-Primal.jpg"
        },
        {
          "id": "6217a6803a14d44656b0c87e",
          "author": "Simon Hill, Adrienne So",
          "description": "Never miss a delivery. These WIRED-tested picks will help you keep tabs on your front porch from anywhere.",
          "link": "https://www.wired.com/gallery/best-video-doorbells/",
          "publishedOn": "2022-09-11T13:00:00.000Z",
          "wordCount": 22973,
          "title": "The Best Video Doorbell Cameras",
          "imageUrl": "https://media.wired.com/photos/62280910ae2a56ae147566f7/191:100/w_2580,c_limit/Gear-Video-Doorbell_Support_Hero_SOURCE_Arlo.jpg"
        },
        {
          "id": "631a65ef74ce5b82a68ef04a",
          "author": "Joe Ray",
          "description": "Bob the Mini Dishwasher is a (maybe too) tiny countertop machine made for small families living in small spaces.",
          "link": "https://www.wired.com/review/daan-tech-bob-the-mini-dishwasher/",
          "publishedOn": "2022-09-11T12:00:00.000Z",
          "wordCount": 14243,
          "title": "This Tiny, Portable Dishwasher Is Built for the Truly Lazy",
          "imageUrl": "https://media.wired.com/photos/631bc11bd884b4dcc94164e7/191:100/w_1280,c_limit/Bob_green_SOURCE%20Daan%20Tech-2.jpg"
        },
        {
          "id": "602fdcf4ff6e0ab6e8be9319",
          "author": "Scott Gilbertson",
          "description": "Shopping for a notebook can be exasperating. Here’s how to sift through the acronyms, storage options, and extra features to find the best one for you.",
          "link": "https://www.wired.com/story/how-to-buy-the-right-laptop-for-you/",
          "publishedOn": "2022-09-11T12:00:00.000Z",
          "wordCount": 31202,
          "title": "Everything You Need to Know Before You Buy a Laptop",
          "imageUrl": "https://media.wired.com/photos/631bb97dd884b4dcc94164e3/191:100/w_1280,c_limit/How-to-Choose-a-Laptop-Gear-GettyImages-1235728903.jpg"
        },
        {
          "id": "62ffd0e1dfd380f2b1c3cb74",
          "author": "David Nield",
          "description": "From editing to dictation, you can do more with your smartphone's keyboard than you might have realized.",
          "link": "https://www.wired.com/story/7-phone-keyboard-tips/",
          "publishedOn": "2022-09-11T11:00:00.000Z",
          "wordCount": 19276,
          "title": "7 Keyboard Tips for Your Phone",
          "imageUrl": "https://media.wired.com/photos/631be61beecde8c117e7f3d9/191:100/w_1280,c_limit/phone-keyboard-Gear-1347514725-(1).jpg"
        },
        {
          "id": "631a680cc9bb1af7ef2496c1",
          "author": "Boone Ashworth",
          "description": "Plus: Brazil and Apple face off, Google expands its eco-friendly Maps directions, and social sites start prepping for the US midterm elections.",
          "link": "https://www.wired.com/story/android-iphone-rcs-tim-cook-green-bubbles/",
          "publishedOn": "2022-09-10T13:00:00.000Z",
          "wordCount": 19552,
          "title": "Apple Messages Won’t Play Nice With Android Anytime Soon",
          "imageUrl": "https://media.wired.com/photos/631bcb398990652479ff383f/191:100/w_1280,c_limit/iOS-Android-Messages-Roundup-Gear-GettyImages-1399057481.jpg"
        },
        {
          "id": "63080cd05d32e4cad34d6ea5",
          "author": "Haley Sprankle",
          "description": "This is a small but fierce soundbar option for smaller spaces, or those looking to slowly build their sound system up with quality pieces.",
          "link": "https://www.wired.com/review/sonos-ray/",
          "publishedOn": "2022-09-10T12:00:00.000Z",
          "wordCount": 13184,
          "title": "The Sonos Ray Is a Perfect Starter Soundbar",
          "imageUrl": "https://media.wired.com/photos/631bb22274ce5b82a68ef12d/191:100/w_1280,c_limit/Sonos-Ray-Gear.png"
        },
        {
          "id": "631b75d78990652479ff382a",
          "author": "Matt Jancer",
          "description": "Treat your ears with our favorite picks to make music and listen to music, or just sit outside and enjoy the music of nature.",
          "link": "https://www.wired.com/story/weekend-deals-september-10-2022/",
          "publishedOn": "2022-09-10T11:00:00.000Z",
          "wordCount": 20368,
          "title": "12 Weekend Deals on Headphones, Camp Stoves, and More",
          "imageUrl": "https://media.wired.com/photos/6130f9e6c290b31df016d9b8/191:100/w_1280,c_limit/Gear-REI-650-Down-Jacket---credit-REI.jpeg"
        }
      ]
    },
    {
      "title": "Ideas Latest",
      "feedUrl": "https://www.wired.com/feed/category/ideas/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "630fa634333af8e1504c49a1",
          "author": "Paul Ford",
          "description": "Retrocomputing is about more than nostalgic nerdery. It’s also a way to keep your tech in perspective.",
          "link": "https://www.wired.com/story/modern-humans-learn-ancient-software-retrocomputing/",
          "publishedOn": "2022-09-15T13:00:00.000Z",
          "wordCount": 19661,
          "title": "What Modern Humans Can Learn From Ancient Software",
          "imageUrl": "https://media.wired.com/photos/630fa99379f10149f7bb9e38/191:100/w_1280,c_limit/WI100122_ST_Ford_01.jpg"
        },
        {
          "id": "63208fea20bc56769c4130dc",
          "author": "Matt Perault",
          "description": "New privacy and expression laws that vary state to state will be a nightmare for platforms, and for users’ rights.",
          "link": "https://www.wired.com/story/the-end-of-roe-will-spark-a-digital-civil-war/",
          "publishedOn": "2022-09-14T12:00:00.000Z",
          "wordCount": 20430,
          "title": "The End of Roe Will Spark a Digital Civil War",
          "imageUrl": "https://media.wired.com/photos/63212a43c9bb1af7ef2497c0/191:100/w_1280,c_limit/roe-digital-civil-war.jpg"
        },
        {
          "id": "630fb1b9dbc9ebd1c95a7469",
          "author": "Virginia Heffernan",
          "description": "When TV came online in the aughts, it was exciting. Then Facebook took over.",
          "link": "https://www.wired.com/story/i-want-the-internet-tv-we-were-all-promised/",
          "publishedOn": "2022-09-13T13:00:00.000Z",
          "wordCount": 19573,
          "title": "The Vast Wasteland of Internet Television",
          "imageUrl": "https://media.wired.com/photos/631f6121f1e5c40d2b1bc632/191:100/w_1280,c_limit/Heffernan_TV_Internet_Backchannel_IMG_3692_horizontal.jpg"
        },
        {
          "id": "630f9ec45d32e4cad34d6f24",
          "author": "Meghan O'Gieblyn",
          "description": "WIRED’s spiritual advice columnist reassures a literary reader that it’s OK to communicate with images.",
          "link": "https://www.wired.com/story/am-i-wrong-to-judge-talking-in-emoji/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 21706,
          "title": "Am I Wrong to Judge People for Talking to Me in Emoji?",
          "imageUrl": "https://media.wired.com/photos/630fa20cf89e2120665181db/191:100/w_1280,c_limit/WI100122_ST_CloudSupport_LO_01.jpg"
        },
        {
          "id": "62fd1fe9b07577beee1be7f9",
          "author": "Charlotte Kent",
          "description": "Jennifer Lyn Morone became a corporation in hopes of protecting her data privacy. Her experience shows the downfalls of treating data like property.",
          "link": "https://www.wired.com/story/art-data-property-roe/",
          "publishedOn": "2022-09-08T13:00:00.000Z",
          "wordCount": 25658,
          "title": "The Woman Who Became a Company Has Lessons for a Post-Roe World",
          "imageUrl": "https://media.wired.com/photos/63192414977791160bfcd0ac/191:100/w_1280,c_limit/woman-became-company.jpg"
        },
        {
          "id": "6303a03afd602ff2f11e6ffa",
          "author": "Erica Berry",
          "description": "Tech dependence is following many students back to school—but waging a war against devices helps no one.",
          "link": "https://www.wired.com/story/cell-phone-bans-school/",
          "publishedOn": "2022-09-07T11:00:00.000Z",
          "wordCount": 24410,
          "title": "Banning Phones in Class? Not So Fast",
          "imageUrl": "https://media.wired.com/photos/6317e88a00704d14b5ffb7ca/191:100/w_1280,c_limit/phones-in-class.jpg"
        },
        {
          "id": "6306003d1814a994d3a63460",
          "author": "Katherine Cross",
          "description": "Telling people to quit the platform is less effective than stopping influential elites from using the site in harmful ways.",
          "link": "https://www.wired.com/story/twitter-democracy-harm-reduction/",
          "publishedOn": "2022-09-06T13:00:00.000Z",
          "wordCount": 25578,
          "title": "So, You Want Twitter to Stop Destroying Democracy",
          "imageUrl": "https://media.wired.com/photos/631296005d32e4cad34d6f9b/191:100/w_1280,c_limit/twitter-stop-destroying-democracy.jpg"
        },
        {
          "id": "63122b60a4a22698f6d24aae",
          "author": "Kate Knibbs",
          "description": "It’s more than an unproven medical treatment—it’s a view into the antiabortion movement’s larger project.",
          "link": "https://www.wired.com/story/abortion-pill-reversal-essay/",
          "publishedOn": "2022-09-05T13:00:00.000Z",
          "wordCount": 27588,
          "title": "What Abortion Pill ‘Reversal’ Really Accomplishes",
          "imageUrl": "https://media.wired.com/photos/631276b8a4a22698f6d24aba/191:100/w_1280,c_limit/abortion-pill-reversal.jpg"
        },
        {
          "id": "630629f0fd602ff2f11e70a4",
          "author": "Jennifer Conrad",
          "description": "Johns Hopkins' long history with student-spies suggests this most recent incident will not lead to much change—but maybe that's OK.",
          "link": "https://www.wired.com/story/national-security-spies-johns-hopkins/",
          "publishedOn": "2022-09-01T12:00:00.000Z",
          "wordCount": 25258,
          "title": "The Russian Spy in My Econ Class",
          "imageUrl": "https://media.wired.com/photos/63100b03f89e2120665181e1/191:100/w_1280,c_limit/russian-spy-econ-class.jpg"
        },
        {
          "id": "630e23a9567860ab6c66c659",
          "author": "Justin Sherman",
          "description": "The agency’s lawsuit against Kochava should squash the industry’s core defense—and help keep sensitive info off the open market.",
          "link": "https://www.wired.com/story/the-ftc-may-finally-protect-americans-from-data-brokers/",
          "publishedOn": "2022-08-31T12:00:00.000Z",
          "wordCount": 19907,
          "title": "The FTC May (Finally) Protect Americans From Data Brokers",
          "imageUrl": "https://media.wired.com/photos/630ec0bb9fbbe8d3536bfa07/191:100/w_1280,c_limit/ftc-data-brokers.jpg"
        },
        {
          "id": "62fb9c2216995ea7b1a92dd3",
          "author": "Josephine Wolff",
          "description": "Cyberinsurance doesn't cover acts of war. But even as cyberattacks mount, the definition of \"warlike\" actions remains blurry.",
          "link": "https://www.wired.com/story/russia-ukraine-cyberwar-cyberinsurance/",
          "publishedOn": "2022-08-30T13:00:00.000Z",
          "wordCount": 22748,
          "title": "Who Pays for an Act of Cyberwar?",
          "imageUrl": "https://media.wired.com/photos/630d6253f89e2120665181d0/191:100/w_1280,c_limit/who-pays-cyberwar.jpg"
        },
        {
          "id": "62fd5532fd602ff2f11e6fbe",
          "author": "Luke Burgis",
          "description": "What does Athens have to do with Jerusalem—and what do either have to do with Silicon Valley?",
          "link": "https://www.wired.com/story/technology-philosophy-three-city-problem/",
          "publishedOn": "2022-08-28T11:00:00.000Z",
          "wordCount": 29329,
          "title": "The Three-City Problem of Modern Life",
          "imageUrl": "https://media.wired.com/photos/630931d752512a466ff8f66d/191:100/w_1280,c_limit/three-cities.jpg"
        },
        {
          "id": "63053fed3a62afdd20ead128",
          "author": "Ellen Walker",
          "description": "Social media accounts featuring kids are more popular than ever. But labor and privacy laws haven't been updated to safeguard the young stars.",
          "link": "https://www.wired.com/story/child-influencers-exploitation-legal-protection/",
          "publishedOn": "2022-08-25T13:00:00.000Z",
          "wordCount": 21230,
          "title": "Nothing Is Protecting Child Influencers From Exploitation",
          "imageUrl": "https://media.wired.com/photos/6306af56f06d7dee6f53bbda/191:100/w_1280,c_limit/child-influencers-exploitation.jpg"
        },
        {
          "id": "6303f32b4a65cec78f4b4dc1",
          "author": "Yangyang Cheng",
          "description": "Science agencies around the world halted partnerships with Russia after it invaded Ukraine. But such actions are shortsighted and do more harm than good.",
          "link": "https://www.wired.com/story/russia-ukraine-science-collaboration/",
          "publishedOn": "2022-08-24T12:00:00.000Z",
          "wordCount": 30451,
          "title": "Boycotting Russian Scientists Is a Hollow Victory",
          "imageUrl": "https://media.wired.com/photos/630592da7072d2c1f5878921/191:100/w_1280,c_limit/boycotting-russian-scientists.jpg"
        },
        {
          "id": "62fe1739086c20d91ed51ac5",
          "author": "Dan Bouk",
          "description": "The population tally, with its normative ideas of identity and household, counted queerness nearly a century ago—but it needs to go much further.",
          "link": "https://www.wired.com/story/us-census-queerness-data/",
          "publishedOn": "2022-08-23T12:00:00.000Z",
          "wordCount": 36654,
          "title": "How Does Queerness Fit Into the US Census?",
          "imageUrl": "https://media.wired.com/photos/6304294bffbf585589d594ec/191:100/w_1280,c_limit/queerness-us-census.jpg"
        },
        {
          "id": "62fbdef354d910713ee4f2b6",
          "author": "William MacAskill",
          "description": "It's comforting to believe that another advanced civilization would develop if humanity met its end. Not so fast.",
          "link": "https://www.wired.com/story/longtermism-technology-evolution/",
          "publishedOn": "2022-08-22T12:00:00.000Z",
          "wordCount": 20607,
          "title": "If Humans Went Extinct, Would a Similar Species Evolve?",
          "imageUrl": "https://media.wired.com/photos/63002b38cea7c0581e825d14/191:100/w_1280,c_limit/humans-extinct.jpg"
        },
        {
          "id": "62f505f87e7512dc132d1872",
          "author": "Emily Weinstein, Carrie James",
          "description": "Well-meaning messages meant to keep teens safe can backfire. The key is to focus on judgment and agency, not rigid rules for screen time.",
          "link": "https://www.wired.com/story/children-screen-time-psychology/",
          "publishedOn": "2022-08-21T11:00:00.000Z",
          "wordCount": 22240,
          "title": "What Adults Don't Get About Teens and Digital Life",
          "imageUrl": "https://media.wired.com/photos/630029553a62afdd20ead092/191:100/w_1280,c_limit/adults-teens-digital-life.jpg"
        }
      ]
    },
    {
      "title": "Science Latest",
      "feedUrl": "https://www.wired.com/feed/category/science/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "63235cf3036b54662b5104de",
          "author": "Ramin Skibba",
          "description": "These are tantalizing hints that microbes might have lived on Mars billions of years ago, but scientists need to study the rocks back on Earth to be sure.",
          "link": "https://www.wired.com/story/nasas-perseverance-rover-digs-up-organic-molecules-on-mars/",
          "publishedOn": "2022-09-15T20:34:06.000Z",
          "wordCount": 18874,
          "title": "NASA’s Perseverance Rover Digs Up Organic Molecules on Mars",
          "imageUrl": "https://media.wired.com/photos/6323627ad884b4dcc941650d/191:100/w_1280,c_limit/Jerezo_Science_PIA24928.jpg"
        },
        {
          "id": "630d2a44dec8aa69fd32238c",
          "author": "Maryn McKenna",
          "description": "Are the vaccines working, are people changing their social behavior, is the virus burning itself out—and how will we know?",
          "link": "https://www.wired.com/story/monkeypox-cases-in-the-us-are-falling-no-one-knows-why/",
          "publishedOn": "2022-09-15T16:01:46.000Z",
          "wordCount": 21922,
          "title": "Monkeypox Cases in the US Are Falling. No One Knows Why",
          "imageUrl": "https://media.wired.com/photos/63223ac8f2203b5586fabf20/191:100/w_1280,c_limit/monkeypox-Science_GettyImages-1243186301.jpg"
        },
        {
          "id": "63227cb7036b54662b5104dd",
          "author": "Maria Perez Ortiz",
          "description": "A software update can help turbines become less disruptive to their neighbors and distribute the wind more efficiently.",
          "link": "https://www.wired.com/story/wind-turbine-efficiency-algorithm/",
          "publishedOn": "2022-09-15T11:00:00.000Z",
          "wordCount": 20817,
          "title": "Teaching ‘Selfish’ Wind Turbines to Share Can Boost Productivity",
          "imageUrl": "https://media.wired.com/photos/63227cb600704d14b5ffb891/191:100/w_1280,c_limit/windturbines_Science_GettyImages-1203659530.jpg"
        },
        {
          "id": "631b932f40fe1e8870aa3a2e",
          "author": "Ramin Skibba",
          "description": "At a high-profile meeting in Geneva, international negotiators are moving closer toward developing rules for space actors in low Earth orbit and beyond.",
          "link": "https://www.wired.com/story/the-un-wants-to-curb-anti-satellite-missile-tests/",
          "publishedOn": "2022-09-14T13:00:00.000Z",
          "wordCount": 20436,
          "title": "The UN Wants to Curb Anti-Satellite Missile Tests",
          "imageUrl": "https://media.wired.com/photos/6320fe4536c33c0247a2f07a/191:100/w_1280,c_limit/UN_Geneva_missile_science_2EGG8K8.jpg"
        },
        {
          "id": "631f8cd2f1e5c40d2b1bc637",
          "author": "Emily Mullin",
          "description": "Most genetically engineered foods were developed to aid farmers. This one will try to sway over health-conscious produce shoppers.",
          "link": "https://www.wired.com/story/a-gmo-purple-tomato-is-coming-to-grocery-aisles-will-the-us-bite/",
          "publishedOn": "2022-09-14T11:00:00.000Z",
          "wordCount": 21486,
          "title": "A GMO Purple Tomato Is Coming to Stores. Will the US Bite?",
          "imageUrl": "https://media.wired.com/photos/6320e026995b6da54b57ef0c/191:100/w_1280,c_limit/JIC-purple-tomato-4_science_DSC6194.jpg"
        },
        {
          "id": "632121cceecde8c117e7f3f8",
          "author": "Tom Ward",
          "description": "With a long record of environmental campaigning as the Prince of Wales, how will King Charles III’s accession to the throne translate to public policies?",
          "link": "https://www.wired.com/story/king-charles-iii-climate-environmental-activist/",
          "publishedOn": "2022-09-14T11:00:00.000Z",
          "wordCount": 21872,
          "title": "What Charles the ‘Activist King’ Means for the Climate",
          "imageUrl": "https://media.wired.com/photos/632121ccf2203b5586fabf1a/191:100/w_1280,c_limit/KingCharlesIII_science_GettyImages-1423195332.jpg"
        },
        {
          "id": "62f2b3f5922c62d7df489f22",
          "author": "Maggie Chen",
          "description": "The xkcd author and former NASA engineer tackles our questions about science education, solvable climate issues, and his latest What If? book.",
          "link": "https://www.wired.com/story/randall-munroe-is-back-to-answer-your-impossible-questions/",
          "publishedOn": "2022-09-13T12:00:00.000Z",
          "wordCount": 26381,
          "title": "Randall Munroe Is Back to Answer Your Impossible Questions",
          "imageUrl": "https://media.wired.com/photos/631fad3dc9bb1af7ef249732/191:100/w_1280,c_limit/Randall-Munroe-.-Photo-Credit-%C2%A9-Adrianne-Mathiowetz-science.jpg"
        },
        {
          "id": "631fbe7e2e0b3090d8d1485b",
          "author": "Matt Reynolds",
          "description": "For decades, the EU has had some of the tightest restrictions on genetically altered agriculture. That could be about to change.",
          "link": "https://www.wired.com/story/europe-drought-gene-editing/",
          "publishedOn": "2022-09-13T11:00:00.000Z",
          "wordCount": 20561,
          "title": "Europe’s Drought Might Force Acceptance of Gene-Edited Crops",
          "imageUrl": "https://media.wired.com/photos/631fbe7e62435d269fdbdaf1/191:100/w_1280,c_limit/Corn_drought_geneediting_GettyImages-1242449303.jpg"
        },
        {
          "id": "631ba4bb036b54662b510430",
          "author": "Grace Browne",
          "description": "A small number of people appear naturally immune to the coronavirus. Scientists think they might hold the key to helping protect us all.",
          "link": "https://www.wired.com/story/the-mystery-of-why-some-people-dont-get-covid/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 24005,
          "title": "The Mystery of Why Some People Don’t Get Covid",
          "imageUrl": "https://media.wired.com/photos/631ba4bad884b4dcc94164ce/191:100/w_1280,c_limit/Covid_Science_GettyImages-1320740286.jpg"
        },
        {
          "id": "631b97708990652479ff382b",
          "author": "Sabrina Weiss",
          "description": "Storing more water to deal with climate change seems like a no-brainer, but such reservoirs are complex undertakings with environmental issues of their own.",
          "link": "https://www.wired.com/story/new-water-reservoirs/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 21629,
          "title": "New Reservoirs Could Help Battle Droughts, but at What Cost?",
          "imageUrl": "https://media.wired.com/photos/631b9770eecde8c117e7f3af/191:100/w_1280,c_limit/Dams_drought_Science_GettyImages-1242872011.jpg"
        },
        {
          "id": "631bdc41c4d3ebc9237bc5ac",
          "author": "Sophia Chen",
          "description": "The jacket can raise and lower its own hood—without chips or batteries—and might one day help disabled wearers move.",
          "link": "https://www.wired.com/story/fabric-nylon-computer-jacket-disability-aid/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 20762,
          "title": "Forget Silicon. This Computer Is Made of Fabric",
          "imageUrl": "https://media.wired.com/photos/631bdc4162435d269fdbdae9/191:100/w_1280,c_limit/fabric_computer_lede_science_assistive-hood-lift-doffed.jpg"
        },
        {
          "id": "631788b35d32e4cad34d6fe1",
          "author": "Jonathan O'Callaghan",
          "description": "The grainy image of a “super Jupiter” is a sign of what’s to come as the telescope’s observations ramp up.",
          "link": "https://www.wired.com/story/the-webb-space-telescope-snaps-its-first-photo-of-an-exoplanet/",
          "publishedOn": "2022-09-11T12:00:00.000Z",
          "wordCount": 21577,
          "title": "The Webb Space Telescope Snaps Its First Photo of an Exoplanet",
          "imageUrl": "https://media.wired.com/photos/631b8ffb995b6da54b57eeb9/191:100/w_1280,c_limit/Quanta_Lede_Ancient-Antiviral-System_2880x1620_Lede-scaled.jpg"
        },
        {
          "id": "631787a58eb3383ad69a24b0",
          "author": "Hanna Hett",
          "description": "Advocates want the government to allow more climate-related immigration and to consider those migrants “protected persons.”",
          "link": "https://www.wired.com/story/as-the-planet-warms-canada-faces-an-influx-of-climate-refugees/",
          "publishedOn": "2022-09-10T12:00:00.000Z",
          "wordCount": 18709,
          "title": "As the Planet Warms, Canada Faces an Influx of Climate Refugees",
          "imageUrl": "https://media.wired.com/photos/631b8c2bf2203b5586fabee7/191:100/w_1280,c_limit/ClimateDesk_Science_GettyImages-1034062854.jpg"
        },
        {
          "id": "62fe6bacdfd380f2b1c3cb5c",
          "author": "Abby Alten Schwartz",
          "description": "Turns out there’s a neurological reason you can’t stop clicking on YouTube closet purges.",
          "link": "https://www.wired.com/story/why-watching-decluttering-videos-feels-so-good/",
          "publishedOn": "2022-09-09T12:00:00.000Z",
          "wordCount": 20715,
          "title": "Why Watching Decluttering Videos Feels So Good",
          "imageUrl": "https://media.wired.com/photos/631a949af2203b5586fabee1/191:100/w_1280,c_limit/Decluttering-Videos-Gear-GettyImages-1313525250.png"
        },
        {
          "id": "63179da544c07c3774c4cba6",
          "author": "Ramin Skibba",
          "description": "The influential astronomer led the hunt for extraterrestrial signals and helped make the field of astrobiology what it is today.",
          "link": "https://www.wired.com/story/the-legendary-frank-drake-shaped-the-search-for-alien-life/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 22144,
          "title": "The Legendary Frank Drake Shaped the Search for Alien Life",
          "imageUrl": "https://media.wired.com/photos/631a19c100704d14b5ffb826/191:100/w_1280,c_limit/FrankDrake_Science_00_02_06-Frank-Drake.jpg"
        },
        {
          "id": "6318e95fd884b4dcc9416475",
          "author": "Gregory Barber",
          "description": "Scorching temperatures in the Golden State are a test case for a more flexible energy grid.",
          "link": "https://www.wired.com/story/californias-heat-wave-is-a-big-moment-for-batteries/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 20607,
          "title": "California’s Heat Wave Is a Big Moment for Batteries",
          "imageUrl": "https://media.wired.com/photos/631a471b977791160bfcd0b1/191:100/w_1280,c_limit/Grid_Science_GettyImages-641229115-(1).jpg"
        },
        {
          "id": "631135e83dfe1372fb611165",
          "author": "Matt Simon",
          "description": "Enough with the urban vs. rural binary. Bringing agriculture into cities can have huge benefits beyond healthy food.",
          "link": "https://www.wired.com/story/why-its-time-to-make-cities-more-rural/",
          "publishedOn": "2022-09-08T12:00:00.000Z",
          "wordCount": 23532,
          "title": "Rurbanization: It’s Time to Make Cities More Rural",
          "imageUrl": "https://media.wired.com/photos/6318de1fc4d3ebc9237bc506/191:100/w_1280,c_limit/urban_farm_rural_science_GettyImages-1248582254.jpg"
        },
        {
          "id": "63179abeba2a66af641b132d",
          "author": "Emily Mullin",
          "description": "The latest vaccines are designed to target the currently circulating Omicron variants—and head off a winter surge.",
          "link": "https://www.wired.com/story/how-does-a-variant-specific-covid-booster-work/",
          "publishedOn": "2022-09-08T11:00:00.000Z",
          "wordCount": 19982,
          "title": "How Does a Variant-Specific Covid Booster Work?",
          "imageUrl": "https://media.wired.com/photos/6318e54a42c342c49c967a52/191:100/w_1280,c_limit/Vaccine_Science_GettyImages-1356760192.jpg"
        },
        {
          "id": "6318d0a3d884b4dcc9416470",
          "author": "Allison Whitten",
          "description": "Many people report that their aches and pains intensify when they’re trying to sleep, but new research into the circadian clock helps explain this mystery.",
          "link": "https://www.wired.com/story/why-pain-feels-worse-at-night/",
          "publishedOn": "2022-09-07T17:14:37.000Z",
          "wordCount": 21895,
          "title": "Why Pain Feels Worse at Night",
          "imageUrl": "https://media.wired.com/photos/6318d0a274ce5b82a68ef033/191:100/w_1280,c_limit/pain_sleep_science_GettyImages-1403850274.jpg"
        },
        {
          "id": "630d278f52512a466ff8f6d8",
          "author": "Maryn McKenna",
          "description": "Blistering temperatures and the invasion of Ukraine have fed fears of global shortages—but some regions are suffering much more than others.",
          "link": "https://www.wired.com/story/how-drought-and-war-are-really-affecting-the-global-food-supply/",
          "publishedOn": "2022-09-07T11:00:00.000Z",
          "wordCount": 21345,
          "title": "How Drought and War Are Really Affecting the Global Food Supply",
          "imageUrl": "https://media.wired.com/photos/63175d9fdbc9ebd1c95a74c0/191:100/w_1280,c_limit/Drought_Science_GettyImages-1242960793-(1).jpg"
        }
      ]
    },
    {
      "title": "Security Latest",
      "feedUrl": "https://www.wired.com/feed/category/security/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "631b4210eecde8c117e7f368",
          "author": "Matt Laslo",
          "description": "The American Data Privacy and Protection Act could protect people across the country. But first, it has to get past Nancy Pelosi.",
          "link": "https://www.wired.com/story/adppa-roe-democrats-congress/",
          "publishedOn": "2022-09-15T11:00:00.000Z",
          "wordCount": 24429,
          "title": "The Shaky Future of a Post-Roe Federal Privacy Law",
          "imageUrl": "https://media.wired.com/photos/63226c3020bc56769c4130ee/191:100/w_1280,c_limit/security-roe-530562743.jpg"
        },
        {
          "id": "6320f8e900704d14b5ffb882",
          "author": "Matt Laslo",
          "description": "Peiter “Mudge” Zatko’s allegations about the social media platform renewed a sense of urgency for lawmakers to rein in Big Tech.",
          "link": "https://www.wired.com/story/peiter-mudge-zatko-twitter-senate-judiciary-testimony/",
          "publishedOn": "2022-09-14T19:01:41.000Z",
          "wordCount": 18763,
          "title": "The Twitter Whistleblower’s Testimony Has Senators Out for Blood",
          "imageUrl": "https://media.wired.com/photos/632115df20bc56769c4130e7/191:100/w_1280,c_limit/Congress's%20takeaways%20from%20the%20Twitter%20whistleblower%20hearing-GettyImages-1423404059.jpg"
        },
        {
          "id": "6320f08cd884b4dcc94164fe",
          "author": "Chris Stokel-Walker",
          "description": "Yurii Shchyhol gives WIRED a rare interview about running the country’s Derzhspetszviazok and the state of the online conflict with Russia.",
          "link": "https://www.wired.com/story/yurii-shchyhol-urkaine-cyberwar-russia/",
          "publishedOn": "2022-09-14T11:00:00.000Z",
          "wordCount": 20838,
          "title": "Ukraine’s Cyberwar Chief Sounds Like He’s Winning",
          "imageUrl": "https://media.wired.com/photos/6320f08c62435d269fdbdb39/191:100/w_1280,c_limit/Ukraine%E2%80%99s-Cyberwar-Chief-Sounds-Like-He%E2%80%99s-Winning-Security-GettyImages-1242260474-GettyImages-1242283013.jpg"
        },
        {
          "id": "631fc39f8990652479ff3848",
          "author": "Matt Burgess",
          "description": "Exposing wrongdoing is risky on the best of days. Whistleblower Aid cofounder John Tye explains the extensive steps needed to keep people safe.",
          "link": "https://www.wired.com/story/whistleblower-safety-mudge-twitter-senate-hearing/",
          "publishedOn": "2022-09-13T11:00:00.000Z",
          "wordCount": 19725,
          "title": "How Whistleblowers Navigate a Security Minefield",
          "imageUrl": "https://media.wired.com/photos/631fc39f00704d14b5ffb878/191:100/w_1280,c_limit/How-Whistleblowers-Navigate-a-Security-Minefield-Security-GettyImages-1242680586.jpg"
        },
        {
          "id": "631b90a1d884b4dcc94164be",
          "author": "Lily Hay Newman",
          "description": "Safety Check and Lockdown Mode give people in vulnerable situations ways to quarantine themselves from acute risks.",
          "link": "https://www.wired.com/story/apple-ios-16-safety-check-lockdown-mode/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 20586,
          "title": "iOS 16 Has 2 New Security Features for Worst-Case Scenarios",
          "imageUrl": "https://media.wired.com/photos/631bbd66f1e5c40d2b1bc626/191:100/w_1280,c_limit/security-apple-lock.jpg"
        },
        {
          "id": "631bd10a8990652479ff3840",
          "author": "Matt Burgess",
          "description": "Plus: Albania cuts ties with Iran, claims of a TikTok data breach that didn’t happen, and much more.",
          "link": "https://www.wired.com/story/la-school-district-ransomware-albania-iran-security-roundup/",
          "publishedOn": "2022-09-10T13:00:00.000Z",
          "wordCount": 20178,
          "title": "Hackers Target Los Angeles School District With Ransomware",
          "imageUrl": "https://media.wired.com/photos/631bd10a977791160bfcd219/191:100/w_1280,c_limit/LAUSD-Ransomware-Security-GettyImages-1393843200.jpg"
        },
        {
          "id": "631939da8990652479ff376e",
          "author": "Matt Burgess",
          "description": "Samizdat Online syndicates banned news sites by hosting them on uncensored domains—allowing people to access independent reporting.",
          "link": "https://www.wired.com/story/russia-internet-censorship-samizdat-online/",
          "publishedOn": "2022-09-08T11:00:00.000Z",
          "wordCount": 21526,
          "title": "This Clever Anti-Censorship Tool Lets Russians Read Blocked News",
          "imageUrl": "https://media.wired.com/photos/631939da74ce5b82a68ef046/191:100/w_1280,c_limit/This-Clever-Anti-Censorship-Tool-Lets-Russians-Read-Blocked-News-Security-GettyImages-950362554.png"
        },
        {
          "id": "6318d57feecde8c117e7f34a",
          "author": "Matt Burgess",
          "description": "With iOS 16 and macOS Ventura, Apple is introducing passkeys—a more convenient and secure alternative to passwords.",
          "link": "https://www.wired.com/story/apple-passkeys-password-iphone-mac-ios16-ventura/",
          "publishedOn": "2022-09-07T18:45:36.000Z",
          "wordCount": 21068,
          "title": "Apple’s Killing the Password. Here’s Everything You Need to Know",
          "imageUrl": "https://media.wired.com/photos/6318d57fc9bb1af7ef249672/191:100/w_1280,c_limit/security-apple-password.jpg"
        },
        {
          "id": "630f9a9a3dfe1372fb61110f",
          "author": "Lily Hay Newman",
          "description": "US lawmakers keep warning about the popular app. But until they can explain what makes it uniquely dangerous, it’s difficult to tailor a resolution.",
          "link": "https://www.wired.com/story/tiktok-nationa-security-threat-why/",
          "publishedOn": "2022-09-06T11:00:00.000Z",
          "wordCount": 22545,
          "title": "It’s Time to Get Real About TikTok’s Risks",
          "imageUrl": "https://media.wired.com/photos/631253e1ba2a66af641b1326/191:100/w_1280,c_limit/security-tik-tok.jpg"
        },
        {
          "id": "6311923d9fbbe8d3536bfa37",
          "author": "Lily Hay Newman",
          "description": "Plus: An unsecured database exposed face recognition data in China, ‘Cuba’ ransomware knocks out Montenegro, and more.",
          "link": "https://www.wired.com/story/fog-reveal-police-montenegro-ransomware-ftc-lawsuit/",
          "publishedOn": "2022-09-03T13:00:00.000Z",
          "wordCount": 19207,
          "title": "Police Across US Bypass Warrants With Mass Location-Tracking Tool",
          "imageUrl": "https://media.wired.com/photos/631283ea8eb3383ad69a24af/191:100/w_1280,c_limit/Police-Tracking-Fog-Reveal-Security-GettyImages-104263702.jpg"
        },
        {
          "id": "63110e2a44c07c3774c4cb37",
          "author": "Dan Goodin, Ars Technica",
          "description": "Microsoft disclosed the flaw in the Android app’s deep link verification process, which has since been fixed.",
          "link": "https://www.wired.com/story/tiktok-android-app-deep-link-vulnerability/",
          "publishedOn": "2022-09-02T13:00:00.000Z",
          "wordCount": 17104,
          "title": "TikTok Users Were Vulnerable to a Single-Click Attack",
          "imageUrl": "https://media.wired.com/photos/6310e0fef89e2120665181e7/191:100/w_1280,c_limit/The-Issue-with-TikTok-Security-Alamy-WNCK07.jpg"
        },
        {
          "id": "63113564f64c675d6d1a5122",
          "author": "Matt Burgess",
          "description": "Hackers can use Microsoft’s Power Automate to push out ransomware and key loggers—if they get machine access first.",
          "link": "https://www.wired.com/story/windows-11-power-automate-attack/",
          "publishedOn": "2022-09-02T11:00:00.000Z",
          "wordCount": 19451,
          "title": "A Windows 11 Automation Tool Can Easily Be Hijacked",
          "imageUrl": "https://media.wired.com/photos/631135648eb3383ad69a2495/191:100/w_1280,c_limit/security-windows-11.jpg"
        },
        {
          "id": "630fd5408eb3383ad69a2488",
          "author": "Pia Ceres",
          "description": "The California Age-Appropriate Design Code would launch a huge online privacy experiment. And it won’t just affect children.",
          "link": "https://www.wired.com/story/california-aadc-kids-privacy-age-checks/",
          "publishedOn": "2022-09-01T11:00:00.000Z",
          "wordCount": 22281,
          "title": "The US May Soon Learn What a ‘Kid-Friendly’ Internet Looks Like",
          "imageUrl": "https://media.wired.com/photos/630fdf12dbc9ebd1c95a746d/191:100/w_1280,c_limit/California-Age-Appropriate-Design-Code-GettyImages-1388648614.jpg"
        },
        {
          "id": "630f99abba2a66af641b1313",
          "author": "Lily Hay Newman",
          "description": "Researchers found that mobile applications contain keys that could provide access to both user information and private files from unconnected apps.",
          "link": "https://www.wired.com/story/mobile-apps-cloud-credentials-exposed/",
          "publishedOn": "2022-09-01T10:00:00.000Z",
          "wordCount": 18776,
          "title": "Careless Errors in Hundreds of Apps Could Expose Troves of Data",
          "imageUrl": "https://media.wired.com/photos/630fe426333af8e1504c49a8/191:100/w_1280,c_limit/Careless-Errors-in-Hundreds-of-Apps-Are-a-Recipe-for-Disaster-GettyImages-973347832.jpg"
        },
        {
          "id": "62f589f554d910713ee4f264",
          "author": "Omar L. Gallaga",
          "description": "Prepaid phones are looking good as privacy worries peak.",
          "link": "https://www.wired.com/story/how-to-use-burner-phone/",
          "publishedOn": "2022-08-31T13:00:00.000Z",
          "wordCount": 19867,
          "title": "You’re Not Stringer Bell, but You May Still Need a Burner Phone",
          "imageUrl": "https://media.wired.com/photos/630e6f7fba2a66af641b12c6/191:100/w_1280,c_limit/Burner-Phone-Security-GettyImages-1415243111.jpg"
        },
        {
          "id": "630e8353f89e2120665181d8",
          "author": "Kate O'Flaherty",
          "description": "Plus: Chrome patches another zero-day flaw, Microsoft closes up 100 vulnerabilities, Android gets a significant patch, and more.",
          "link": "https://www.wired.com/story/apple-fixed-a-serious-ios-security-flaw-have-you-updated-yet/",
          "publishedOn": "2022-08-31T11:00:00.000Z",
          "wordCount": 19696,
          "title": "Apple Fixed a Serious iOS Security Flaw—Have You Updated Yet?",
          "imageUrl": "https://media.wired.com/photos/630e8353dec8aa69fd322398/191:100/w_1280,c_limit/critical-update-security-august.jpg"
        },
        {
          "id": "6308b75a5d32e4cad34d6ea6",
          "author": "Michael Venutolo-Mantovani",
          "description": "In the last two weeks of the war, an ad hoc team armed with group chats, QR codes, and satellite maps launched a mad dash to save imperiled Afghan allies.",
          "link": "https://www.wired.com/story/inside-shadow-evacuation-kabul-afghanistan/",
          "publishedOn": "2022-08-30T10:00:00.000Z",
          "wordCount": 44951,
          "title": "Inside the Shadow Evacuation of Kabul",
          "imageUrl": "https://media.wired.com/photos/630d0b883dfe1372fb611100/191:100/w_1280,c_limit/WIRED_Afghanistan_Interior2_Resize.jpg"
        },
        {
          "id": "62fd0e3f23d2b53441872fb6",
          "author": "Guillaume Ptak",
          "description": "Anti-Putin media network February Morning has become a central player in the underground fight against the Kremlin.",
          "link": "https://www.wired.com/story/february-morning-russia-ukraine-war/",
          "publishedOn": "2022-08-29T11:00:00.000Z",
          "wordCount": 26597,
          "title": "The Telegram-Powered News Outlet Waging Guerrilla War on Russia",
          "imageUrl": "https://media.wired.com/photos/6303eb981814a994d3a6340b/191:100/w_1280,c_limit/Telegram-Russian-Forces-Security-AP_22173448993355.jpg"
        },
        {
          "id": "630940a4567860ab6c66c656",
          "author": "Matt Burgess",
          "description": "Plus: An Iranian hacking tool steals inboxes, LastPass gets hacked, and a deepfake scammer targets the crypto world.",
          "link": "https://www.wired.com/story/us-propaganda-russia-china-memes-security-roundup/",
          "publishedOn": "2022-08-27T13:00:00.000Z",
          "wordCount": 19567,
          "title": "A US Propaganda Operation Hit Russia and China With Memes",
          "imageUrl": "https://media.wired.com/photos/630940a4f89e2120665180ef/191:100/w_1280,c_limit/Russia-China-Propaganda-Attacks-Security-GettyImages-1399591352.jpg"
        },
        {
          "id": "6307d624f89e2120665180cf",
          "author": "Lily Hay Newman",
          "description": "The phishing attack on the SMS giant exposes the dangers of B2B companies to the entire tech ecosystem.",
          "link": "https://www.wired.com/story/twilio-breach-phishing-supply-chain-attacks/",
          "publishedOn": "2022-08-26T20:05:55.000Z",
          "wordCount": 19367,
          "title": "Why the Twilio Breach Cuts So Deep",
          "imageUrl": "https://media.wired.com/photos/630921ccf64c675d6d1a5056/191:100/w_1280,c_limit/Twilio-Hack-Security-GettyImages-1281229452.jpg"
        }
      ]
    },
    {
      "title": "WIRED Guides Latest",
      "feedUrl": "https://www.wired.com/feed/tag/wired-guide/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": []
    },
    {
      "title": "Product Hunt — The best new products, every day",
      "feedUrl": "https://www.producthunt.com/feed",
      "siteUrl": "https://www.producthunt.com",
      "articles": [
        {
          "id": "https://www.producthunt.com/posts/1v1-for-slack",
          "author": null,
          "description": "https://www.springworks.in/engag...\n\nAnd do show some ❤️ to the makers by supporting the launch on Product Hunt 🙏🏽\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/1v1-for-slack",
          "publishedOn": "2022-09-16T07:01:06.000Z",
          "wordCount": 1026,
          "title": "1v1 for Slack — 1-on-1 meetings- schedule, prep & document. All inside Slack",
          "imageUrl": "https://ph-files.imgix.net/9eee7153-d6f4-4afa-9746-8b24b28fda22.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/flexpdf",
          "author": null,
          "description": "Greetings Hunters!\n\nWe are proud to finally be able to share FlexPDF with you 🎉 🥳! We developed this tool to help publishers convert PDF files to responsive HTML with just a few clicks.\n\nFlexPDF's main target audience will be PDF publishers (magazines, catalogs, brochures, books, guides, etc.) that need a solution to move away from static PDF files to responsive HTML as more than 60% of readers today consume content from their mobile devices.\n\nThe Challenge:\nExisting free tools will convert PDF to HTML, but the results are usually pretty bad for a couple of very important reasons:\n\n1. the HTML code generated is cluttered and not optimized for search engines\n2. there is typically no good ways to navigate content in chapters or articles\n3. content is still absolute and not responsive, which means it breaks on mobile devices\n4. it's hard to edit or include interactive things like audio, video and animations\n5. the results are typically littered with formatting errors, missing words and broken layouts\n\nFlexPDF is Different!\nOur focus is on generating responsive HTML results that look and read great on any device, size and orientation that delivers an excellent mobile experience.\n\n1. the HTML code generated is clean and has the correct syntax \n2. content is separated into chapters/articles and navigation is built into the output including an automatically generated table of contents.\n3. content is responsive which means it looks and reads great on any device, size and orientation\n4. the output can currently be shared in three main ways. You can download the HTML, use an embed code or share a link. All 100% branded to clients.\n5. results are almost 100% error-free \n\nFlexPDF is Version 1.0\nWe are launching here on ProductHunt in hopes of getting some feedback to improve the tool even more. We hope you will find a few minutes to try it out and let us know what you think in the comments.\n\nThanks for all your support. This is a fantastic community!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/flexpdf",
          "publishedOn": "2022-09-16T06:42:52.000Z",
          "wordCount": 1089,
          "title": "FlexPDF — Free PDF to HTML Converter for Publishers",
          "imageUrl": "https://ph-files.imgix.net/d9d1dbbe-44dc-47ad-8e78-49eb77bb9c27.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/middle-point",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/middle-point",
          "publishedOn": "2022-09-16T06:34:35.000Z",
          "wordCount": 1005,
          "title": "Middle Point — Find a middle point among multiple places.",
          "imageUrl": "https://ph-files.imgix.net/dcdcbfc2-8ba7-421b-8b16-afa769fef523.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/binance-research",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/binance-research",
          "publishedOn": "2022-09-16T06:33:15.000Z",
          "wordCount": 898,
          "title": "Binance Research — Institutional-grade analysis and in-depth insights.",
          "imageUrl": "https://ph-files.imgix.net/6dfd2288-45e1-4c0a-bc39-1c93a0810ef8.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/pluto-search",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/pluto-search",
          "publishedOn": "2022-09-16T05:52:17.000Z",
          "wordCount": 990,
          "title": "Pluto Search — Pluto helps you search the web privately 🐶",
          "imageUrl": "https://ph-files.imgix.net/566d0aa4-0f42-484b-9a13-3bef143ffe1c.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/youtube-highlighter-by-glasp",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/youtube-highlighter-by-glasp",
          "publishedOn": "2022-09-16T05:50:28.000Z",
          "wordCount": 991,
          "title": "YouTube Highlighter by Glasp — No more manually typing transcripts!",
          "imageUrl": "https://ph-files.imgix.net/1a110917-912d-4596-a3ca-1e45fa4f0ece.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/creator-hub-3",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/creator-hub-3",
          "publishedOn": "2022-09-16T01:15:45.000Z",
          "wordCount": 948,
          "title": "Creator Hub — Become the creator you could be",
          "imageUrl": "https://ph-files.imgix.net/41238dc9-bf3a-48b5-a0cb-1eccee7b6275.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/opal-3-0",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/opal-3-0",
          "publishedOn": "2022-09-15T22:35:31.000Z",
          "wordCount": 1115,
          "title": "Opal 3.0 — Real focus in real-time, with iOS 16 Screen Time API",
          "imageUrl": "https://ph-files.imgix.net/9b3e9a93-5170-4901-8d70-66aee732421a.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/project-portal-client-dashboard",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/project-portal-client-dashboard",
          "publishedOn": "2022-09-15T21:02:32.000Z",
          "wordCount": 1061,
          "title": "Project Portal & Client Dashboard — Manage client projects in easily customizable portals",
          "imageUrl": "https://ph-files.imgix.net/4b86a37d-429d-4d7c-b90b-3977ef0851c0.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/cal-com-v2-0",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/cal-com-v2-0",
          "publishedOn": "2022-09-15T20:32:45.000Z",
          "wordCount": 943,
          "title": "Cal.com v2.0 — Enterprise-grade scheduling, now free for individuals",
          "imageUrl": "https://ph-files.imgix.net/0fc1058d-e1f7-42a2-969e-69f3b66b17b7.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/shedlight",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/shedlight",
          "publishedOn": "2022-09-15T20:23:55.000Z",
          "wordCount": 934,
          "title": "ShedLight — The influencer review platform.",
          "imageUrl": "https://ph-files.imgix.net/108a7e84-d4f6-480e-ac28-6fbf5125adf8.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/zoom-in-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/zoom-in-2",
          "publishedOn": "2022-09-15T19:13:57.000Z",
          "wordCount": 973,
          "title": "Zoom In — Discover people nearby on Google Maps",
          "imageUrl": "https://ph-files.imgix.net/b73bf063-966a-4732-9638-8c24c9040d82.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/validator-ai",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/validator-ai",
          "publishedOn": "2022-09-15T18:21:13.000Z",
          "wordCount": 936,
          "title": "Validator AI — Get AI business validation for any idea",
          "imageUrl": "https://ph-files.imgix.net/8a21221c-7904-4912-8ec6-5a28d58bd185.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/dashdeals-amex-rewards-for-investors",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/dashdeals-amex-rewards-for-investors",
          "publishedOn": "2022-09-15T16:24:51.000Z",
          "wordCount": 1068,
          "title": "DashDeals: AMEX Rewards For Investors — Earn rewards based on your investments",
          "imageUrl": "https://ph-files.imgix.net/0b33c06b-d882-4577-b6e3-cac9a9f85d59.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/tiktok-now",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/tiktok-now",
          "publishedOn": "2022-09-15T14:32:03.000Z",
          "wordCount": 1020,
          "title": "TikTok Now — A daily photo and video experience",
          "imageUrl": "https://ph-files.imgix.net/7a6b8660-4e16-4213-995f-a670d82ab7a4.webp?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/habit-box",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/habit-box",
          "publishedOn": "2022-09-15T13:16:41.000Z",
          "wordCount": 958,
          "title": "Habit Box — Track and visualize your habits with Notion.",
          "imageUrl": "https://ph-files.imgix.net/c9d7a953-5c53-4728-87b8-1bece4341111.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/showmeyourhotkeys",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/showmeyourhotkeys",
          "publishedOn": "2022-09-15T12:53:39.000Z",
          "wordCount": 959,
          "title": "ShowMeYourHotKeys — Show all shorcuts of applications",
          "imageUrl": "https://ph-files.imgix.net/6efc5f55-c9b0-407d-8c4c-656010f0f839.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/be-your-own-model-by-walmart",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/be-your-own-model-by-walmart",
          "publishedOn": "2022-09-15T11:27:05.000Z",
          "wordCount": 958,
          "title": "Be Your Own Model by Walmart — A virtual dressing room by Walmart",
          "imageUrl": "https://ph-files.imgix.net/f5aba8cc-7216-4492-985e-b2feb4486e8f.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/is-it-webflow",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/is-it-webflow",
          "publishedOn": "2022-09-15T11:00:14.000Z",
          "wordCount": 950,
          "title": "Is it Webflow — Show your clients that sites they love are Webflow powered",
          "imageUrl": "https://ph-files.imgix.net/aba1fa52-557f-4622-a20a-cbfd4b89345f.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/startup-timer",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/startup-timer",
          "publishedOn": "2022-09-15T10:57:57.000Z",
          "wordCount": 913,
          "title": "Startup Timer — Measure Windows boot time",
          "imageUrl": "https://ph-files.imgix.net/627df6ed-df32-41c7-afbd-640d63f2aaeb.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/trustgem",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/trustgem",
          "publishedOn": "2022-09-15T10:22:21.000Z",
          "wordCount": 953,
          "title": "TrustGem — The leading web3 community of trustworthy reviews",
          "imageUrl": "https://ph-files.imgix.net/286f0977-403f-455d-821f-97367b4bc507.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/moonlighter-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/moonlighter-2",
          "publishedOn": "2022-09-15T10:21:47.000Z",
          "wordCount": 990,
          "title": "Moonlighter — 2x Productivity, 2x Income",
          "imageUrl": "https://ph-files.imgix.net/74875e4e-a9be-45f7-87eb-b258f38f6d8f.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/squaddle",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/squaddle",
          "publishedOn": "2022-09-15T10:14:30.000Z",
          "wordCount": 1012,
          "title": "Squaddle — Organise group sports & social activities through WhatsApp",
          "imageUrl": "https://ph-files.imgix.net/1d31b831-7c11-41ad-89c5-c689d72ff6f3.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/theatre-js",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/theatre-js",
          "publishedOn": "2022-09-15T09:57:07.000Z",
          "wordCount": 926,
          "title": "Theatre.js — Animation and 3D editor for JavaScript",
          "imageUrl": "https://ph-files.imgix.net/b4ae4741-56cd-44a1-bc5f-bd92d8391149.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/payabl",
          "author": null,
          "description": "https://payabl.vercel.app\n\nHope this helps you track your expenses and take control of your money.\nLet me know what you think in the comments below!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/payabl",
          "publishedOn": "2022-09-15T09:19:24.000Z",
          "wordCount": 898,
          "title": "Payabl — Take control of your money",
          "imageUrl": "https://ph-files.imgix.net/e0a7ee4c-5045-4e48-b96b-77a488502c4c.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/lets-connect",
          "author": null,
          "description": "contact@letsconnectapp.com).\nYou will only make us better. 😊\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/lets-connect",
          "publishedOn": "2022-09-15T09:11:50.000Z",
          "wordCount": 1001,
          "title": "Lets Connect — Discover your vibe",
          "imageUrl": "https://ph-files.imgix.net/483e53db-8a6e-4bb4-9317-5fc706b01353.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/fittree",
          "author": null,
          "description": "https://fittree.io/nonso (My Fittree link)\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/fittree",
          "publishedOn": "2022-09-15T09:00:49.000Z",
          "wordCount": 914,
          "title": "Fittree — Your workouts everywhere",
          "imageUrl": "https://ph-files.imgix.net/ff1ebbd1-1753-44d6-ad21-f2a579fd28e3.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/cameralyze",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/cameralyze",
          "publishedOn": "2022-09-15T08:45:54.000Z",
          "wordCount": 966,
          "title": "Cameralyze — Build your computer vision application with no-code",
          "imageUrl": "https://ph-files.imgix.net/f23d096b-6c70-4586-9231-af55d3f0dc53.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/image-computer",
          "author": null,
          "description": "https://image.computer\n\nYou'll get a bunch of free credits to play around with it. Once you run out you can buy them with a single payment. No annoying subscriptions or hidden fees.\n\nHere's what it looks like today:\n\n\n\nPlease let me know what you think and how I can improve it!\n\nP.S.\nThe first 50 people to use coupon code PRODUCTHUNT50 when buying credits ( http://image.computer/pricing ) get 50% off.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/image-computer",
          "publishedOn": "2022-09-15T08:42:37.000Z",
          "wordCount": 1025,
          "title": "Image Computer — The easiest way to generate AI images",
          "imageUrl": "https://ph-files.imgix.net/2774fb71-2bd4-400f-ad0c-bd0be9a78282.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/mateai",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/mateai",
          "publishedOn": "2022-09-15T07:56:07.000Z",
          "wordCount": 876,
          "title": "MateAI — Generate copy and design for your email campaigns, faster",
          "imageUrl": "https://ph-files.imgix.net/c116d94d-a2b8-4c6b-b21e-00e5f7330e66.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/zerobalance",
          "author": null,
          "description": "https://znap.link/clubzerobalance\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/zerobalance",
          "publishedOn": "2022-09-15T07:45:45.000Z",
          "wordCount": 988,
          "title": "Zerobalance — End overspending with smart budgeting",
          "imageUrl": "https://ph-files.imgix.net/7ec8265a-fc2a-4200-a1dc-e35ecb086fd2.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/openbanner",
          "author": null,
          "description": "“\n              Hey Product Hunt! 👋\n\nSo I recently decided to join Twitter to build a product in public and during my profile creation, I couldn't figure out what to use as my cover picture.\n\nUpon further research, I saw a lot of those who were successfully building in public had informative Twitter banners rather than a random background picture of cats.\n\nTheir banners explained who they are, what they are building, their current MRR, and their target MRR. Finally, they had a strong Call To Action pointing to the follow button to attract new followers.\n\nI quickly hopped into Canva to create this, but then decided to build a free tool that allows anyone who is building in public to generate these kinds of informative banners. \n\nI hope you guys enjoy it and feedback and suggestions are always welcome!   \n\nCheers!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/openbanner",
          "publishedOn": "2022-09-15T07:24:55.000Z",
          "wordCount": 845,
          "title": "OpenBanner — Simple informative Twitter banner builder for #buildinpublic",
          "imageUrl": "https://ph-files.imgix.net/4f0b0521-6b6e-4ec2-9a7a-abc9a4948c94.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/javascript-for-starters-the-guide",
          "author": null,
          "description": "https://codemarch.gumroad.com/l/...\n\nThankyou!😊\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/javascript-for-starters-the-guide",
          "publishedOn": "2022-09-15T07:16:33.000Z",
          "wordCount": 1070,
          "title": "JavaScript for Starters: The Guide — Learning JavaScript is the best investment you can do today.",
          "imageUrl": "https://ph-files.imgix.net/f79c443b-cf92-4893-9899-9f51a66b762a.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/supportpage",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/supportpage",
          "publishedOn": "2022-09-15T04:35:18.000Z",
          "wordCount": 880,
          "title": "Supportpage — AI powered support pages and ticketing system",
          "imageUrl": "https://ph-files.imgix.net/bcb1b966-3fd0-4bbe-bf22-ca6b353826e3.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/mvncenter",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/mvncenter",
          "publishedOn": "2022-09-15T02:52:51.000Z",
          "wordCount": 993,
          "title": "mvncenter — A better maven search engine and maven tools center",
          "imageUrl": "https://ph-files.imgix.net/d616341d-7dab-4266-882c-380e70f80891.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/tenantcube-credit-report",
          "author": null,
          "description": "support@tenantcube.com!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/tenantcube-credit-report",
          "publishedOn": "2022-09-15T00:59:22.000Z",
          "wordCount": 996,
          "title": "Tenantcube Credit Report — Simple, confident, stress free renting",
          "imageUrl": "https://ph-files.imgix.net/9706a589-5412-4c59-8913-482f87f72191.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/phase-4",
          "author": null,
          "description": "https://www.phase.art/images/cl8...)\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/phase-4",
          "publishedOn": "2022-09-14T22:27:58.000Z",
          "wordCount": 855,
          "title": "Phase — Stable Diffusion GUI and prompt generator",
          "imageUrl": "https://ph-files.imgix.net/b3e7a55e-68ae-498d-86d6-6df138a4c08b.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/world-news-api",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/world-news-api",
          "publishedOn": "2022-09-14T17:54:43.000Z",
          "wordCount": 973,
          "title": "World News API — The only news API you'll ever need",
          "imageUrl": "https://ph-files.imgix.net/3fd72fed-14f7-4f8d-80df-d25eb646a88b.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/igtrack",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/igtrack",
          "publishedOn": "2022-09-14T14:59:28.000Z",
          "wordCount": 951,
          "title": "IGTrack — Check fake followers, track and analyze your followers",
          "imageUrl": "https://ph-files.imgix.net/9b4f2d34-f48f-425e-89df-b52f072c6f22.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/search-trends-22-ebook-by-luigi-s-box",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/search-trends-22-ebook-by-luigi-s-box",
          "publishedOn": "2022-09-14T10:27:18.000Z",
          "wordCount": 1077,
          "title": "Search Trends '22 eBook by Luigi's Box — Discover ecommerce search benchmarks & insights",
          "imageUrl": "https://ph-files.imgix.net/fd483ad5-9cb0-4abc-8c4e-fccbb33fe118.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/brewmymac",
          "author": null,
          "description": "BrewMyMac! Possibly the coolest way to install apps and customize your Mac!\n\nWith BrewMyMac, you can choose from a wide range of apps and tweaks, and install them with a single command. It saves you enormous time searching and downloading apps separately. Your selections are saved on the cloud so you can automate the same process on multiple Macs.\n\nI am a software engineer and architect working for a consulting firm. Over the past seven years, I've used seven MacBooks - four provided by my companies and three by clients. Every time I received a new MacBook, I had to go through the painful process of installing more than 20 apps necessary for my work. I needed to search the Internet for tweaks on how to customize the look'n'feel of my Mac and change its default behaviors to suit my style. That was a tedious process. I often ended up spending 3 or 4 days on that, and I still missed installing some apps and tweaks.\n\nA couple of years ago, I made an Ansible Playbook automating all these. It was a success. It set up my Mac in minutes. But it is a tool for developers only and I wanted to share it with other power users. That's why I made BrewMyMac.\n\nBrewMyMac allows you to install over 10K apps from Homebrew and Homebrew Cask, and Mac apps from App Store. You can customize your Mac with the 49 tweaks provided. After you finish selecting which apps and tweaks to install, it generates a single-line command which you can copy-paste and run in Terminal. That command will handle the rest including the installation of Homebrew and Ansible.\n\nUnder the hood, BrewMyMac is a static website hosted on GitHub Pages. It uses a free no-code service as its database. There is no backend code implementation, making it portable and free to use.\n\nBrewMyMac is an open-source project and is currently in the beta testing phase. I'm excited to hear any comments, questions or feedback.\n\nWebsite: https://brewmymac.sh\nGitHub: https://github.com/ayltai/BrewMyMac\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/brewmymac",
          "publishedOn": "2022-09-14T08:34:01.000Z",
          "wordCount": 1051,
          "title": "BrewMyMac — The coolest way to install apps and customize your Mac",
          "imageUrl": "https://ph-files.imgix.net/d47d6b74-a216-45c8-a9f1-d5db1833db50.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/3-minute-journal",
          "author": null,
          "description": "https://apps.apple.com/us/app/3-...\n\nDohyun\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/3-minute-journal",
          "publishedOn": "2022-09-14T02:40:31.000Z",
          "wordCount": 1027,
          "title": "3 Minute Journal — A faster, better journaling experience using your voice",
          "imageUrl": "https://ph-files.imgix.net/39f2d058-f8bc-446c-85a1-bc488fbd942a.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/ouishopp",
          "author": null,
          "description": "Now you can use OuiShopp to:\n\n✨ Create private, customized shopping sprees.\n✨ Shop LIVE with friends on any online store.\n✨ Give and get advice on specific items.\n✨ Suggest items to your friends that you think they should get.\n✨ Put on your own little fashion show by showing off your purchases on our social feed.\n\nSoon you'll be able to:\n\n🥳 Shop LIVE with your favorite influencers.\n🥳 Shop LIVE with a personal stylist that a store selects for you.\n🥳 Shop on multiple stores and only checkout once.\n\nOh AND, it’s free for users!\n\nInfluencers & Ecommerce Stores will soon be able to integrate with the press of a button and:\n\n🛍️ Host LIVE shopping events with their customers.\n🛍️ Get in front of those who are most likely to start a spree at their store.\n🛍️ Avoid ditched carts and watch shoppers make much faster shopping decisions, aka, major sales boost!\n\n\nWe're so excited to watch you bring shopping sprees back, only this time, online.\n\nWe welcome feedback, questions or simply saying hello!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/ouishopp",
          "publishedOn": "2022-09-13T23:39:29.000Z",
          "wordCount": 1033,
          "title": "OuiShopp — Shop online with friends in real time",
          "imageUrl": "https://ph-files.imgix.net/00ae8a5f-0023-405f-8131-47ec30bf591b.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/day-one-2a996eca-bce6-4538-9346-dc135d2af03a",
          "author": null,
          "description": "@andrew_w_hutton (CEO of Day One) will explain more on the announcement in his comments.\n\nIt’s been so much fun being part of this transition as the team got to talk to hundreds of customers, understand their priorities and preferences and design new offerings inspired by the community feedback. \n\nLet us know if you have questions or comments — stoked to hear from you 😀\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/day-one-2a996eca-bce6-4538-9346-dc135d2af03a",
          "publishedOn": "2022-09-13T21:14:37.000Z",
          "wordCount": 983,
          "title": "Day One — A community and school for emerging entrepreneurs",
          "imageUrl": "https://ph-files.imgix.net/5207e81a-1046-4c52-bbe1-0d3b1684370d.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/awesome-web3",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/awesome-web3",
          "publishedOn": "2022-09-13T19:10:27.000Z",
          "wordCount": 863,
          "title": "Awesome Web3 — Curated, top-notch, free Web3 resources",
          "imageUrl": "https://ph-files.imgix.net/42210347-3a13-405f-98c6-031aa0698fd7.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/my-tabata",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/my-tabata",
          "publishedOn": "2022-09-13T19:07:54.000Z",
          "wordCount": 1054,
          "title": "My Tabata — Get in shape with My Tabata - Interval timer",
          "imageUrl": "https://ph-files.imgix.net/4bf4d216-7949-4617-8d44-45d051c06ebb.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/livenotes",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/livenotes",
          "publishedOn": "2022-09-13T13:23:45.000Z",
          "wordCount": 1060,
          "title": "Livenotes — Real-time note-taking application for revenue teams",
          "imageUrl": "https://ph-files.imgix.net/8741d3fc-5573-43bf-8e44-3714826b5b7a.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/bank-io",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/bank-io",
          "publishedOn": "2022-09-13T05:15:56.000Z",
          "wordCount": 966,
          "title": "Bank.io — Coded fintech mobile app UI kit for iOS 16",
          "imageUrl": "https://ph-files.imgix.net/66117003-6afe-4f81-8e91-f62b404fda0b.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/papyr-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/papyr-2",
          "publishedOn": "2022-09-12T08:18:03.000Z",
          "wordCount": 1003,
          "title": "Papyr — Twitter for reading",
          "imageUrl": "https://ph-files.imgix.net/7aee1983-8909-4551-bf95-5385a342aef7.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/accountit-2-1",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/accountit-2-1",
          "publishedOn": "2022-09-12T04:50:12.000Z",
          "wordCount": 994,
          "title": "Accountit 2.1 — Track your transactions with Accountit as every penny counts",
          "imageUrl": "https://ph-files.imgix.net/96b42109-1b28-498c-986f-4bb6672b11e7.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}