{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news/",
      "articles": [
        {
          "id": "https://www.freecodecamp.org/news/how-to-change-text-color-in-html/",
          "author": "Joel Olawanle",
          "description": "Text plays a significant role on our web pages. This is because it helps users learn what the web page is all about and what they can do there. When you add text to your web pages, this text defaults to a black color. But sometimes you will want to",
          "link": "https://www.freecodecamp.org/news/how-to-change-text-color-in-html/",
          "publishedOn": "2022-09-12T20:45:12.000Z",
          "wordCount": 1646,
          "title": "How to Change Text Color in HTML – Font Style Tutorial",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/cover-template--6-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/the-javascript-dom-a-practical-tutorial/",
          "author": "Ophy Boamah",
          "description": "If you were listening to music on an app and you wanted to pause or skip a song, you'd have to do that through the app. This process is similar to how the Document Object Model or DOM works. Here, the music app represents the DOM because it serves as",
          "link": "https://www.freecodecamp.org/news/the-javascript-dom-a-practical-tutorial/",
          "publishedOn": "2022-09-12T20:19:15.000Z",
          "wordCount": 3785,
          "title": "How the JavaScript DOM Works – A Practical Tutorial",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/DOMpract-2-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-read-and-write-data-using-azure-databricks/",
          "author": "Salim Oyinlola",
          "description": "Azure Databricks is a Microsoft Azure cloud service that provides a scalable platform for data analytics using Apache Spark. It is a fully managed, cloud-based data analytics platform that allows developers to create enterprise-grade data apps more quickly, which accelerates AI and innovation.  In this tutorial, you will cover",
          "link": "https://www.freecodecamp.org/news/how-to-read-and-write-data-using-azure-databricks/",
          "publishedOn": "2022-09-12T18:49:37.000Z",
          "wordCount": 2281,
          "title": "How to Read and Write Data using Azure Databricks",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/download--1-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/chart-js-zooom-plugin/",
          "author": "Swatej Patil",
          "description": "In this tutorial you will learn how to the Add Chart.js Zoom plugin to an Angular application. When you have a lot of data in a chart, you may want to zoom in and see the details. Line charts are a good way to visualise large amounts of data. You",
          "link": "https://www.freecodecamp.org/news/chart-js-zooom-plugin/",
          "publishedOn": "2022-09-12T18:38:17.000Z",
          "wordCount": 1563,
          "title": "How to Add the Chart.js Zoom Plugin to an Angular App",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/chartjsZoom.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/top-30-react-interview-questions-and-concepts/",
          "author": "Beau Carnes",
          "description": "Do you have a React interview coming up? Or do you just want to test your React skills? We just published a course on the freeCodeCamp.org YouTube channel that will help you to prepare for a React interview by teaching you about 30 common React interview questions and concepts. Nishant",
          "link": "https://www.freecodecamp.org/news/top-30-react-interview-questions-and-concepts/",
          "publishedOn": "2022-09-12T17:32:35.000Z",
          "wordCount": 857,
          "title": "Top 30 React Interview Questions and Concepts",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/reactquestions.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/html-background-color-change-bg-color-tutorial/",
          "author": "Joel Olawanle",
          "description": "When you're building web pages, you always want to create unique layouts. You want your web page to be appealing to your users and not jarring to the eye. And to help do that, you can choose background and text colors that blend well and complement each other. By default,",
          "link": "https://www.freecodecamp.org/news/html-background-color-change-bg-color-tutorial/",
          "publishedOn": "2022-09-12T17:30:49.000Z",
          "wordCount": 1695,
          "title": "HTML Background Color – Change BG Color Tutorial",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/cover-template--7-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-tailwind-css-a-beginners-guide/",
          "author": "Soham De Roy",
          "description": "Writing CSS can be really difficult. Period. And I get it – it can be frustrating to nail down your own ideas or the designs you get from your design team. I'm sure many of you have gone through the same pain at least a few times in your development",
          "link": "https://www.freecodecamp.org/news/what-is-tailwind-css-a-beginners-guide/",
          "publishedOn": "2022-09-12T15:38:34.000Z",
          "wordCount": 2811,
          "title": "What is Tailwind CSS? A Beginner's Guide",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Group-69.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/container-orchestration-for-beginners/",
          "author": "Valentine Gatwiri",
          "description": "Container orchestration has been called the next big thing in the world of technology. And it’s easy to see why. Container orchestration helps IT professionals and programmers maximize their applications’ performance. It helps them ensure that multiple containers can work together to handle more tasks at the same time than",
          "link": "https://www.freecodecamp.org/news/container-orchestration-for-beginners/",
          "publishedOn": "2022-09-12T14:57:00.000Z",
          "wordCount": 2469,
          "title": "What is Container Orchestration? How to Manage your Containers with MicroK8s",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/pexels-pixabay-163726.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/module-not-found-error-in-python-solved/",
          "author": "Dillion Megida",
          "description": "When you try to import a module in a Python file, Python tries to resolve this module in several ways. Sometimes, Python throws the ModuleNotFoundError  afterward. What does this error mean in Python? As the name implies, this error occurs when you're trying to access or use a module",
          "link": "https://www.freecodecamp.org/news/module-not-found-error-in-python-solved/",
          "publishedOn": "2022-09-12T14:17:11.000Z",
          "wordCount": 1560,
          "title": "ModuleNotFoundError: no module named Python Error [Fixed]",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/module-not-found-error.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/new-online-courses/",
          "author": "Dhawal Shah",
          "description": "If you haven’t heard, universities around the world are offering their courses online for free (or at least, partially free). These courses are collectively called MOOCs or Massive Open Online Courses. [https://www.classcentral.com/help/moocs] In the past ten years, ~1000 universities have created around tens of thousands of MOOCs. I’ve been keeping",
          "link": "https://www.freecodecamp.org/news/new-online-courses/",
          "publishedOn": "2022-09-10T10:33:00.000Z",
          "wordCount": 9117,
          "title": "200 Universities Just Launched 850+ Free Online Courses. Here’s the Full List.",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2021/08/banner-new-courses.png"
        }
      ]
    },
    {
      "title": "DEV Community 👩‍💻👨‍💻",
      "feedUrl": "https://dev.to/feed",
      "siteUrl": "https://dev.to",
      "articles": [
        {
          "id": "https://dev.to/medusajs/what-are-your-favorite-developer-communities-4ifm",
          "author": "Shahed Nasser",
          "description": "Part of what makes developers love open source solutions are the communities that revolve around that solution. Some are based on Discord, Slack, forums, or other means of communication.\nWhat is your favorite community to be a part of? And what makes it your favorite?\nP.S. 👀: Medusa has a Discord server for the community that welcomes everybody! Join and chat with Medusa's core team and community members learn more about Medusa!",
          "link": "https://dev.to/medusajs/what-are-your-favorite-developer-communities-4ifm",
          "publishedOn": "2022-09-13T10:32:56.000Z",
          "wordCount": 1237,
          "title": "What are your Favorite Developer Communities?",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--VfDe0vrw--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/m4qtggvcflago8tukhwj.jpg"
        },
        {
          "id": "https://dev.to/onlydevs_/5-best-web-development-courses-for-free-3io2",
          "author": "Only Devs",
          "description": "There are many Courses out there on YouTube related to Web development but sometimes it is hard to choose which one is complete and practical, So here are the list of 5 best Web development courses that you can do for free:- \n1- FreeCodeCamp\n2- Foundations of Front-End Web Development\n3- Khan Academy\n4- The Odin Project\n5- CS50's Introduction to Computer Science\nNOTE:- Join the Collaborative Community of Software Developers and get updates on latest job opportunities from some of the best companies out there, and coupon code of some Amazing free courses that will help you to upskill. Moreover there are many senior developers in the community so if you are looking for a referral you can request for the same as well. You can Join the Community on Slack and Discord.",
          "link": "https://dev.to/onlydevs_/5-best-web-development-courses-for-free-3io2",
          "publishedOn": "2022-09-13T10:06:25.000Z",
          "wordCount": 1151,
          "title": "5 Best Web Development Courses for FREE",
          "imageUrl": "https://dev.to/social_previews/article/1191961.png"
        },
        {
          "id": "https://dev.to/neurotech_africa/understanding-how-to-evaluate-textual-problems-32md",
          "author": "Anthony Mipawa",
          "description": "As a data professional, building models is a common topic what differs is just what that model is for? models, should solve certain challenges? then after we consider measuring the quality and performance of these models using evaluation metrics and these are essential to confirm something concerning built models.\nEvaluation metrics are used to measure the quality of the statistical or machine learning model.\nThis article was originally published on the Neurotech Africa blog.\nNeed for evaluation?\n\n\nThe aim of building AI solutions is to apply them to real-world challenges. Mind you, our real world is complicated, so how do we decide which model to use and when? that is when their metrics come into application.\nA failure to know how to justify why your choosing a certain model instead of ot…",
          "link": "https://dev.to/neurotech_africa/understanding-how-to-evaluate-textual-problems-32md",
          "publishedOn": "2022-09-13T09:47:52.000Z",
          "wordCount": 3006,
          "title": "Understanding How to Evaluate Textual Problems",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7ZUcpAta--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/7cd8imge2ce1xnyf0231.jpg"
        },
        {
          "id": "https://dev.to/akram_ak/sass-the-style-you-want-the-code-you-need-5188",
          "author": "Akram A. Abdelbasir",
          "description": "If you are a developer or web designer, chances are you have heard about Sass at one time or another. Sass is just as easy to use as CSS but includes some additional features that make it even more powerful.\nIt's time to start the Sass series. In this first article of the series, we will learn what Sass is and why you need to use it for more efficient web development.\nSass is an extension of the CSS language that adds power and flexibility without getting too complicated. It provides variables, mixins, inheritance, and other handy tools for making CSS more maintainable. Sass also helps with more advanced features like code organization (partials), data-driven styles (looks), and responsive design.\nIn this series, we'll be going over the basics of SASS/SCSS. We'll be covering a lot of ground, from basic syntax to more advanced features. So, if you're new to SASS/SCSS or want to brush up on some old skills, this is the series for you.\nSo let us start with this question\nThat’s a question often asked, and one we can answer with a simple “Yes”. It all comes down to stylesheets vs preprocessors — and it’s important to get things right. SASS (and its more powerful cousin, SCSS) are writing systems that let you write faster, more flexible, and more maintainable code by way of variables, mixins, and nesting.\nSASS was designed by Hampton Catlin and Chris Eppstein.\nThis code, for instance, creates a set of classes twice: once using CSS and once with SCSS.\n\nWrite less and do more with Sass.\nThat's all about this post for today, in the next article, we will learn how to use sass in your project.\nSee You ❤\nPlease feel free to reach out to me at Linkedin if you have any questions.",
          "link": "https://dev.to/akram_ak/sass-the-style-you-want-the-code-you-need-5188",
          "publishedOn": "2022-09-13T09:23:46.000Z",
          "wordCount": 1401,
          "title": "🎨Sass: the style you want, the code you need",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--FnhFjpjc--/c_imagga_scale,f_auto,fl_progressive,h_500,q_66,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/waq8p0s6lnidborp5ly7.gif"
        },
        {
          "id": "https://dev.to/begoon/github-as-a-database-2g0m",
          "author": "Alexander Demin",
          "description": "git is indeed a database. GitHub is a remote database powered by git.\nI needed a way to keep information about certain important events in my code nicely saved for later analysis. What can be better than committing them to a VCS? Timestamps, commit descriptions etc.\nI used local git first and then switched to GitHub. GitHub provides API for all its functionality.\nThe little code below demonstrates how this approach works.\nIt needs two things to be set: GITHUB_TOKEN, which can be generated in your GitHub account and the repo variable with the repository name.\nIt upserts a new file to create a file. Then it upserts it again to modify it. Then it deletes the file.\nThe repository log nicely keeps all these actions in the commit history.\nNote: The PyGithub package needs to be installed first:\np…",
          "link": "https://dev.to/begoon/github-as-a-database-2g0m",
          "publishedOn": "2022-09-13T09:00:36.000Z",
          "wordCount": 1529,
          "title": "GitHub as a database",
          "imageUrl": "https://dev.to/social_previews/article/1191917.png"
        },
        {
          "id": "https://dev.to/nathan20/why-i-stopped-writing-articles-420k",
          "author": "Nathan",
          "description": "It’s no secret that the world today is a fastpaced, highstress environment. We’re constantly bombarded with stimuli and expected to be available 24/7. \nThere are many benefits to taking breaks during your workday. Pausing can help refresh your mind, reduce stress, and boost your overall productivity. \n\nIf you’re feeling like you need a break, there are many different ways to take one. You could step away from your work for a few minutes and take a walk or stretch. \nWhen it comes to productivity, pauses are just as important as the work itself. By taking a few minutes to step away from our work, we can come back feeling refreshed and ready to tackle whatever is next. So next time you feel yourself getting overwhelmed, take a break and see how much better you feel afterwards.\nSo I decided to…",
          "link": "https://dev.to/nathan20/why-i-stopped-writing-articles-420k",
          "publishedOn": "2022-09-13T08:51:56.000Z",
          "wordCount": 1733,
          "title": "Why I stopped writing articles",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--A76KdGaY--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/318yqmanfu31lw7tzc14.png"
        },
        {
          "id": "https://dev.to/hotjar/best-self-review-how-to-process-feedback-in-an-actionable-way-1jai",
          "author": "Susana Martins",
          "description": "Every six months at Hotjar, employees have their best-self review, which consists of a self and peer review. The review forces us all to reflect on two things: how well we’re living up to Hotjar’s core values and how we’re performing against our seniority criteria. We’re required to give examples of things we’ve accomplished during the period, and also think about how we can improve and continue to grow. Our peers are also given an opportunity to share their thoughts and feedback. Finally, we discuss these results at a performance review meeting with our lead.\nAlthough this time can feel tense and high-pressure, ultimately, it helps us grow and develop our skills. To that end, it’s every Hotjarian’s responsibility to find ways of processing all the information given to us in a way that tra…",
          "link": "https://dev.to/hotjar/best-self-review-how-to-process-feedback-in-an-actionable-way-1jai",
          "publishedOn": "2022-09-13T08:49:10.000Z",
          "wordCount": 2054,
          "title": "Best-self review: how to process feedback in an actionable way",
          "imageUrl": "https://dev.to/social_previews/article/1191164.png"
        },
        {
          "id": "https://dev.to/codezeros/how-businesses-can-benefit-from-non-fungible-tokens-nft-541k",
          "author": "Codezeros",
          "description": "We are moving away from traditional platforms or processes and toward more efficient replacements as a result of ongoing digital transformation. Every complicated business demand may be handled with the help of cutting-edge technological innovations, whether it be data verification, supply chain management, or client onboarding.\n\nThe newest developments in blockchain technology that are based on smart contracts are known as non-fungible tokens, or NFTs. We've got you covered if you don't know about Non-Fungible Token Development Services and how they might help you expand your business. We shall examine NFTs and their strong business applications in-depth in this post.\n> How Businesses Can Benefit from NFTs\nNFTs have a number of commercial applications that are specialized in their use and…",
          "link": "https://dev.to/codezeros/how-businesses-can-benefit-from-non-fungible-tokens-nft-541k",
          "publishedOn": "2022-09-13T08:48:54.000Z",
          "wordCount": 1673,
          "title": "How Businesses can benefit from Non-Fungible Tokens (NFT)",
          "imageUrl": "https://dev.to/social_previews/article/1191921.png"
        },
        {
          "id": "https://dev.to/logankilpatrick/why-julia-20-isnt-coming-anytime-soon-and-why-that-is-a-good-thing-3gpp",
          "author": "Logan Kilpatrick",
          "description": "If you have been programming for a while, there’s a good chance you have lived through breaking changes in ecosystems which may have left a bad taste in your mouth. Many people I have met speak disparagingly of the transition the Python ecosystem went through from version 2.X to 3.0. While most would likely agree that it was worth it in the long run, this transition still consumed a significant amount of resources for the ecosystem.\nBut what about Julia? Does having a 1.X version give people the idea that the ecosystem is still too immature? Would a 2.0 release spark mass adoption and be the catalyst for Julia becoming a top 5 programming language?\nIn this article, we will explore why Julia is unlikely to get a 2.0 release anytime soon and why that is actually a good thing for current and …",
          "link": "https://dev.to/logankilpatrick/why-julia-20-isnt-coming-anytime-soon-and-why-that-is-a-good-thing-3gpp",
          "publishedOn": "2022-09-13T07:40:00.000Z",
          "wordCount": 1974,
          "title": "Why Julia 2.0 isn’t coming anytime soon (and why that is a good thing)",
          "imageUrl": "https://dev.to/social_previews/article/1191288.png"
        },
        {
          "id": "https://dev.to/quokkalabs/dominating-web-development-trends-2022-3ema",
          "author": "Quokka Labs",
          "description": "Web development is constantly changing and keeping up with the latest trends in the bone of the body for success. It is a good idea to stay with the trends to stay head-on with challenging markets. After reading this blog, you will be among the top businesses! \nHere I have collected the top dominating web development trends to keep an eye on 2022 and beyond. \nPWAs are on the top list of Web application development trends and are pretty dominating nowadays. PWAs are like real mobile app or native app that works on the web. It runs independently and communicates with clients as a native app. \nPWAs Benefits and advantages to business\nSimple and fast installation\nPower and device storage saving\nSeamless updating and maintenance\nFlexible distribution and quick launch in the market\nAccording to …",
          "link": "https://dev.to/quokkalabs/dominating-web-development-trends-2022-3ema",
          "publishedOn": "2022-09-13T07:36:46.000Z",
          "wordCount": 2271,
          "title": "Dominating Web Development Trends 2022",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--GV8xgQuT--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/oqr854qx3cjo5oj8kjql.jpg"
        },
        {
          "id": "https://dev.to/aws-builders/what-is-amazon-eks-connector--bne",
          "author": "MakendranG",
          "description": "You can use Amazon EKS Connector to register and be a part of any conformant Kubernetes cluster to AWS and visualize it in the Amazon EKS console. You can see the status, configuration, and workload in the Amazon EKS console after a cluster is connected. You can use this feature to view connected clusters, but you can't control them.\n\nThe Amazon EKS Connector can connect the following kinds of Kubernetes clusters to Amazon EKS. The Amazon EKS Connector is also an open supply project on Github. \nThe clusters are on-premises.\nThere are clusters on Amazon Elastic Compute Cloud.\nOther cloud providers have managed clusters.\nUnderstand the following before using Amazon EKS Connector:\nYou should have administrative privileges to the Kubernetes cluster to join the cluster to Amazon EKS.\nBefore con…",
          "link": "https://dev.to/aws-builders/what-is-amazon-eks-connector--bne",
          "publishedOn": "2022-09-13T06:48:12.000Z",
          "wordCount": 1403,
          "title": "What is Amazon EKS Connector ?.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--oqu_b7gd--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/6g0npvr2lb04f3i2g2wy.png"
        },
        {
          "id": "https://dev.to/ivsivak/kontieinier-s-naibolshim-kolichiestvom-vody-4l5f",
          "author": "Ivan",
          "description": "Давайте разберем задачу контейнера с наибольшим количеством воды. Ее можно найти по ссылке Container With Most Water\nДан целочисленный массив значений высоты height размера n, т.е. нарисовано n вертикальных линий.\nНеобходимо найти две линии, которые вместе с осью X образуют контейнер, который содержит наибольшее количество воды.\nВерните в качестве результата максимальное количество воды, которое может храниться в контейнере.\nВходные данные:\nРезультат:\nВходные данные:\nРезультат:\nДля решения этой задачи надо использовать жадный алгоритм с двумя указателями. На каждом шаге необходимо вычислять максимально возможный результат. Для этого мы начнем итерироваться с двух концов контейнера. Продвигаться будем левым или правым указателем в одну итерацию. Выбор указателя будет зависить от того, являе…",
          "link": "https://dev.to/ivsivak/kontieinier-s-naibolshim-kolichiestvom-vody-4l5f",
          "publishedOn": "2022-09-13T06:28:24.000Z",
          "wordCount": 1538,
          "title": "Контейнер с наибольшим количеством воды",
          "imageUrl": "https://dev.to/social_previews/article/1174888.png"
        }
      ]
    },
    {
      "title": "小众软件",
      "feedUrl": "https://feeds.appinn.com/appinns",
      "siteUrl": "https://www.appinn.com",
      "articles": [
        {
          "id": "https://www.appinn.com/?p=43296",
          "author": "青小蛙",
          "description": "锁屏启动 是一款由 @自力hzlzh 刚刚发布的 iOS 16 专属应用，利用 iOS 16 的新功能锁屏小组件，实现在锁屏界面启动健康码、行程码、付款码、快捷指令、任意应用、自定义 URL Sche",
          "link": "https://www.appinn.com/lock-launcher-for-ios-16/",
          "publishedOn": "2022-09-13T04:08:52.000Z",
          "wordCount": 2527,
          "title": "锁屏启动 – iOS 16 锁屏小组件：在锁屏界面启动健康码、行程码、付款码、快捷指令[内购限免]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-13T111615.462.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43289",
          "author": "青小蛙",
          "description": "RSSPush 是一款基于 Docker 部署的自托管服务，它能够将 RSS 实时推送至微信（基于 Server酱，支持关键词过滤），支持 RSSHub 生成的 RSS 地址。近日更是整合了 Appr",
          "link": "https://www.appinn.com/rsspush/",
          "publishedOn": "2022-09-12T09:44:41.000Z",
          "wordCount": 2536,
          "title": "RSSPush – 将 RSS 实时推送至微信，以及大多数主流服务（IFTTT、Telegram、Slack 等）",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-12T132037.471.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43283",
          "author": "稻米鼠",
          "description": "最近写了几枚小脚本，是那种很没有存在感的小脚本，然后恰好遇到了一些令人感慨的事情，所以出来聊聊天。@Appinn 事情的起因在这里：https://meta.appinn.net/t/topic/36",
          "link": "https://www.appinn.com/making-links-better/",
          "publishedOn": "2022-09-11T08:26:40.000Z",
          "wordCount": 2277,
          "title": "[油猴脚本]让链接变得更好系列",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/cover.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43280",
          "author": "青小蛙",
          "description": "来自发现频道，@gezhong.vip 同学发布了一款名为中高风险疫情地区-API接口的在线服务，提供了更容易检索、更直观的各地疫情风险等级查询功能。@Appinn 开发者提到： 由于官方的查询界面太",
          "link": "https://www.appinn.com/arearisklist/",
          "publishedOn": "2022-09-11T07:51:33.000Z",
          "wordCount": 2225,
          "title": "更易检索的「中高风险地区查询」工具，支持 API",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-11T153938.981.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43277",
          "author": "青小蛙",
          "description": "Seal 是一款简单的开源 Android 在线视频下载器、音频提取器，内嵌 yt-dlp 与 aria2c，支持封面、字幕、播放列表等功能，Material Design 3 设计风格。@Appin",
          "link": "https://www.appinn.com/seal-online-video-download/",
          "publishedOn": "2022-09-10T08:18:10.000Z",
          "wordCount": 2420,
          "title": "Seal – 内嵌 yt-dlp 与 aria2c 的开源 Android 在线视频下载器（音频提取）",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-10T153640.513.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43264",
          "author": "青小蛙",
          "description": "今天早上 @alenh 同学的一个帖子：非常喜欢 SimpleDiagrams 软件绘画出来的效果，但苦于软件有使用时间限制，有没有解决方法或类似软件替代，谢谢，让青小蛙才发现这样一款有趣的软件。但开",
          "link": "https://www.appinn.com/simplediagrams-byebye/",
          "publishedOn": "2022-09-09T05:14:30.000Z",
          "wordCount": 2254,
          "title": "记一款有趣软件的离开：SimpleDiagrams",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-09T123537.667.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43254",
          "author": "青小蛙",
          "description": "Linkding 是一款简单易用的自托管网络书签服务，支持 Docker 部署，拥有标签、时光机、存档、稍后阅读、共享书签等功能。@Appinn 感谢 @Hue 在 Munk 的推荐。是的，很像 Pi",
          "link": "https://www.appinn.com/linkding-self-hosted-bookmark-service/",
          "publishedOn": "2022-09-08T07:28:35.000Z",
          "wordCount": 2565,
          "title": "Linkding – 简单易用的自托管网络书签服务，有点像 Pinboard",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-08T150013.504.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43240",
          "author": "青小蛙",
          "description": "是不是每次在制作 PPT 时，都丝毫没有头绪？各种模板东拼西凑没有章法？你和 PPT 高手之间，其实就只差一个 iSlide。 iSlide 是一款口碑优秀的 PPT 插件，海量在线资源库，超 30",
          "link": "https://www.appinn.com/islide-20220910/",
          "publishedOn": "2022-09-07T10:23:31.000Z",
          "wordCount": 2383,
          "title": "教师节特惠，iSlide 买 2 年送 360 天，仅需 98 元起！",
          "enclosure": {
            "url": "https://img3.appinn.net/wp-content/uploads/2022/09/lizhi-islide-7.mp4",
            "length": "74185",
            "type": "video/mp4"
          },
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-07T175559.726.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43231",
          "author": "青小蛙",
          "description": "PowerToys 是微软发布的一款开源小工具集，集成了包括置顶窗口、保持唤醒、颜色选取器、图像大小调整等 15+ 种功能，10个小时前更新 v0.62.0 版本，带来了喜闻乐见的文本提取器 OCR",
          "link": "https://www.appinn.com/powertoys-v0-62-0/",
          "publishedOn": "2022-09-07T04:11:14.000Z",
          "wordCount": 2464,
          "title": "微软官方超实用 15+ 小工具集 PowerToys v0.62.0 发布，新增文本提取器 OCR 功能",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-07T114657.018.jpg"
        },
        {
          "id": "https://www.appinn.com/?p=43224",
          "author": "青小蛙",
          "description": "Copy Dialog Lunar Lander 是一款非常没用的游戏，它会在 Windows 复制文件的时候出现，用户控制方向，模拟月球登陆，度过那无聊的时光。适合于 USB2.0 用户，更快速的用",
          "link": "https://www.appinn.com/copy-dialog-lunar-lander/",
          "publishedOn": "2022-09-06T11:35:48.000Z",
          "wordCount": 2325,
          "title": "Copy Dialog Lunar Lander – 在复制文件时，模拟月球登陆[Windows]",
          "imageUrl": "https://img3.appinn.net/static/wp-content/uploads/2022/09/Appinn-2022-09-06T191329.094.jpg"
        }
      ]
    },
    {
      "title": "Linux 中国◆开源社区",
      "feedUrl": "https://linux.cn/rss.xml",
      "siteUrl": "https://linux.cn/",
      "articles": [
        {
          "id": "https://linux.cn/article-15026-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Rust Linux 驱动程序实现与 C 代码相当的性能\n\r\n在都柏林举行的 2022 年 Linux Plumbers 大会（LPC）的 Rust 小型会议上，介绍了 Rust for Linux 工作的最新状况。Linux 内核已经有了很好的 C 语言编写的 NVMe 驱动，西部数据的测试显示，虽然其开发的 Rust NVMe 驱动仍处于早期阶段，但其驱动性能与 C 编写的驱动一样好。会议上介绍了最新的补丁系列是如何被精简以减轻上游工作的，以及过去一年的各种进展，但是关于 Rust 何时并入主线，会议上并没有披露具体的时间表和进展。\n\r\n\r\n消息来源：Phoronix\n\r\n\r\n\r\n老王点评：非常好的信号，但是大家都更关心什么时候能进入主线。\n\r\n\r\n\n\r\nPyTorch 成为 Linux 基金会的顶级项目\n\r\n开源 Python 机器学习库 PyTorch 成为 Linux 基金会托管的顶级项目，成立 PyTorch 基金会，其理事会的核心成员包括 AMD、AWS、谷歌云、Meta、Azure 和英伟达。PyTorch 最早由 Facebook 创建，自 2017 年以来，已经有超过 2400 名开发者在 PyTorch 基础上创建了 54000 个项目，PyTorch 成为了 AI 研究的主要平台之一。\n\r\n\r\n消息来源：PyTorch\n\r\n\r\n\r\n老王点评：PyTorch 是一个不错的项目，在 LF 的支持下，应该会有更好的发展。\n\r\n\r\n\n\r\n思科承认“阎罗王”勒索团伙泄露了其数据，但表示没有问题\n\r\n5 月份对思科进行了攻击的“阎罗王（Yanluowang）”勒索团伙周末在暗网上公开泄露了盗取的文件。显然，思科选择不支付勒索团伙要求的勒索，这导致被盗数据被公布。思科的威胁情报部门证实了所泄露文件的真实性，并重申其业务没有受到不利影响。然而，“阎罗王”勒索组织说，其窃取了多达 55GB 的数据，其中包括源代码和机密材料等敏感信息。\n\r\n\r\n消息来源：The Register\n\r\n\r\n\r\n老王点评：这组织的名字真是别致，但是到底对思科有没有影响，只有思科自己知道。",
          "link": "https://linux.cn/article-15026-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-13T08:31:03.000Z",
          "wordCount": 504,
          "title": "硬核观察 #758 Rust Linux 驱动程序实现与 C 代码相当的性能",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15025-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "得益于开发者们最近的贡献，在 Ubuntu 中使用自己的强调色是很简单的。\n\r\n\r\n每个 Linux 发行版都有它们默认的主题，具有各自的主色调。强调色用于在各个设置中突出主色调。通常，主色调和强调色应该形成对比和补充。\n\r\n在最近的 GNOME 桌面的更新之后，Ubuntu 桌面在 22.04 LTS 版本中引入了强调色。\n\r\n尽管如何应用它们是显而易见的，但是为了 Linux 的新手，我将解释如何在 Ubuntu 桌面中使用强调色。\n\r\n在 Ubuntu 桌面中应用强调色\n\r\n\r\n从应用菜单中打开 系统设置System Settings\n\r\n进入 外观Appearance 菜单\n\r\n在 风格Style 菜单下，你应该见到一套预设的颜色。\n\r\n选择其中的一个来改变强调色。\n\r\n\r\n一旦更改，强调色将被应用到 GTK 应用程序中的选区和 GTK 控件中，如切换按钮和文件夹的默认外观。\n\r\n默认的强调色是橙色，有十种颜色可供选择，具体如下：\n\r\n\r\n橙色\n\r\n树皮色\n\r\n鼠尾草色\n\r\n橄榄绿\n\r\n铬绿\n\r\n普鲁士绿\n\r\n蓝色\n\r\n紫色\n\r\n品红色\n\r\n红色\n\r\n\r\n\n\r\n（LCTT 译注：树皮色是一种棕色，鼠尾草色是一种灰绿色。）\n\r\n你应该记住一点，深色和浅色的主题的强调色组合可能改变你的桌面的整体外观。\n\r\n以上的特性只是只适用于目前使用 GNOME 桌面的 Ubuntu，而不适用于其它提供原生 GNOME 的发行版，例如 Fedora Workstation。因为有一些内容是由 Ubuntu 团队开发的，并且并没有合并到 GNOME 上游。\n\r\nKubuntu 中的强调色\n\r\n使用带有 KDE Plasma 桌面的 Kubuntu，你可以简单地使用强调色。KDE Plasma 提供了预设的颜色，也有自定义的颜色选择器选项。另外，自 KDE Plasma 5.25 起，强调色可以根据壁纸来改变。\n\r\n为了在 Kubuntu 中改变它，跟着下面的步骤走：\n\r\n\r\n在应用菜单中打开 系统设置System Settings\n\r\n进入 外观Appearance > 全局主题Global Theme > 颜色Colours 标签\n\r\n选择你的强调色\n\r\n\r\n\n\r\n我知道 Lubuntu 与 Xubuntu 并没有这个特性。而且它不太可能很快到来。\n\r\n使用愉快。\n\r\n\r\nvia: https://www.debugpoint.com/ubuntu-accent-colour/\n\r\n作者：Arindam 选题：lkxed 译者：yjacks 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15025-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-12T23:57:55.000Z",
          "wordCount": 532,
          "title": "如何在 Ubuntu 桌面中应用强调色",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15024-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "关于 Unix 及其起源的简短回忆。\n\r\n\r\n\n\r\nUnix 的起源\n\r\n如今，几乎整个世界都运行在 Linux 之上。数以十亿计的移动电话和服务器运行在 Linux 之上。但在 Linux 之前，是 Unix，没有 Unix 就没有现在的 Linux。\n\r\nUnix 的起源可以追溯到人类登陆月球的时候。在 1965 年，三个著名的机构共同开展了一个操作系统研发项目，准备开发一个能够服务多个用户，并共享数据和资源的操作系统。\n\r\n\n\r\n这三个机构是著名的 贝尔电话实验室Bell Telephone Laboratories、通用电气公司General Electric Company（GE）以及麻省理工学院Massachusetts Institute of Technology（MIT）。这个合作项目被称为 “Multics” —— 即“多路传输信息和计算业务Multiplex Information and Computing Service”的缩写。\n\r\n不幸的是，该项目并没有见到成功的曙光，由于系统设计复杂且没有什么成果，贝尔实验室停止了该项目。\n\r\n曾参与该项目开发的贝尔实验室的 肯·汤普森Ken Thompson，也投入到了新的工作中。在 数字设备公司Digital Equipment Corporation（DEC）的一台古老的 PDP-7 计算机上，他重新开始设计了一个新操作系统。不久后，丹尼斯·里奇Dennis Ritchie 也加入了，二人一起设计了分层文件系统、设备文件、命令行解释器以及进程。这就是 Unix 的诞生过程，它的名字是由 Multics 项目的另一名成员 布莱恩·克尼汉Brian Kernighan 给命名的。（LCTT 校注：前不久，80 高龄的布莱恩还为他共同创造的 AWK 添加了新的特性。）\n\r\n接着在 1971 年，Unix 被移…",
          "link": "https://linux.cn/article-15024-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-12T16:26:17.000Z",
          "wordCount": 630,
          "title": "Unix 历史：一个伟大作品的诞生",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15023-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Retbleed 修复导致虚拟机性能降低 70%\n\r\nVMware 在 Linux 内核邮件列表中报告，在内部测试发现，在 ESXi 管理程序上运行使用 5.19 版 Linux 内核的 Linux 虚拟机，使用单一 vCPU 的计算性能下降高达 70%，网络性能下降 30%，存储性能下降高达 13%。而关闭了 5.19 版内核中的 Retbleed 补救措施后，ESXi 性能恢复到 5.18 版的水平。\n\r\n\r\n消息来源：The Register\n\r\n\r\n\r\n老王点评：许多 VMware 用户可能会在生产中使用 Skylake CPU，这样的性能损失不可能接受，那就只能冒着风险了？虽然这个漏洞并不太容易利用。\n\r\n\r\n\n\r\n停止十年的 Ubuntu 线下峰会将于今年 11 月启动\n\r\nCanonical 曾经在每个 Ubuntu 开发周期中举办 “Ubuntu 开发者峰会”，但那是十年前的事了。后来它在变成了一个线上活动，然后逐渐消失，转而变成支持 Canonical 的内部路线图规划和其他员工之间的开发者冲刺的活动。新的活动现在名叫“Ubuntu 峰会”，即将于 11 月在捷克的布拉格举行。\n\r\n\r\n消息来源：Phoronix\n\r\n\r\n\r\n老王点评：不知道 Ubuntu 峰会会不会带来一些惊喜？总感觉现在每个 Ubuntu 版本的发布都缺乏令人激动的新变化。\n\r\n\r\n\n\r\n微软推出点对点流媒体技术 eCDN 解决方案\n\r\n微软的企业内容交付网络（eCDN）可以提高加入直播流的参与者的数量，使其有可能满足有众多参与者的公司范围的会议。这是一个基于 WebRTC 的解决方案，利用了点对点流媒体技术。微软称，微软 eCDN 可以同时容纳数百万的参与者，而不会使企业网络过载，也不会遇到视频流的质量、安全和隐私方面的麻烦。\n\r\n\r\n消息来源：Redmond Mag\n\r\n\r\n\r\n老王点评：大规模实时流量还是得依赖点对点应用。",
          "link": "https://linux.cn/article-15023-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-12T12:19:00.000Z",
          "wordCount": 494,
          "title": "硬核观察 #757 Retbleed 修复导致虚拟机性能降低 70%",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15022-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "什么是最危险的 Linux 命令？\n\r\n有人无数次问我这个问题，我一直避免回答，因为没有一个明确的危险的 Linux 命令清单。\n\r\n你拥有的工具使你能够控制和修改你的操作系统的每一个方面。我不是想吓唬你，但如果你不熟悉这些命令和工具，你可以很容易地把你的系统摧毁。\n\r\n想象一下家庭中的小孩子的情景。孩子有许多方法可以伤害自己。但这是否意味着不应允许孩子离开婴儿床？那会对她的成长造成损害。\n\r\n这就是父母设定界限和引导孩子的地方。不要靠近火堆，不要把手指戳到电源插座上……随着孩子的成长和经验的积累，她可以把炉子打开，在壁炉里生火，插上电源线。\n\r\n同样，如果你知道一些已知的风险命令，你可能会避免落入巨魔的陷阱，他们试图欺骗你运行命令，扰乱你的系统。\n\r\n当你积累了经验，知道了这些命令和工具的含义和用法，用愚蠢和棘手的命令破坏你的系统的机会就会减少。\n\r\n我的同事 Sreenath 收集了一些流行的危险 Linux 命令。让我们看看它们是如何干掉你的 Linux 系统的。\n\r\n\r\n免责警告：如果你不清楚你在做什么，请勿尝试本文提及的这些命令，否则后果自负。\n\r\n\r\n1、rm -rf /*\n\r\n这个可能是在各种社交媒体上盘旋的最臭名昭著的命令。你会经常发现巨魔们在各种讨论中提及这个。\n\r\nrm 命令用来删除文件/目录。标志 -r 和 -f 表示递归地删除指定目录内的所有文件。现在，如果没有 root 权限，这个命令不会造成任何伤害。\n\r\n运行 sudo rm -rf / 命令也不会产生任何问题，因为大多数发行版提供了一个故障安全选项。你需要指定 --no-preserve-root 才能实际运行它。\n\r\nsudo rm -rf / --no-preserve-root\r\n\n\r\n然而，一个更简单的版本可以是这样的：\n\r\nsudo rm -rf /*\r\n\n\r\n它将开始递归地删除根目…",
          "link": "https://linux.cn/article-15022-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-12T10:47:24.000Z",
          "wordCount": 683,
          "title": "10 大可以摧毁你的 Linux 的命令",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15021-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "浏览器广告拦截器明年将被削弱\n\r\n浏览器的广告拦截器和其他隐私工具是建立在 MV2 规范之上的。但谷歌在 2018 年开始为 Chromium 浏览器扩展开发 MV3 规范，并计划在明年 1 月停止支持 MV2。在谷歌看来，在 MV2 下的扩展对浏览器中打开的页面有太多的控制和访问。如果这些附加组件中的一个变成了流氓软件，它可以在你访问这些网页时收集关于你的各种敏感数据。主流的广告拦截器基于 MV3 推出的测试版表明，基于 MV3 开发的扩展功能明显变弱，比如说不能支持动态规则，广告出现闪烁等。\n\r\n\r\n消息来源：The Register\n\r\n\r\n\r\n老王点评：谷歌表面上促进隐私的努力，最终将损害促进隐私的扩展。这究竟是为了隐私考虑，还是为了广告考虑？\n\r\n\r\n\n\r\n默认搜索引擎设置为谷歌引来反垄断审查\n\r\n美国司法部称，谷歌每年向苹果、三星电子和其他电信巨头支付数十亿美元，成为大多数浏览器和所有美国手机的默认搜索引擎，以维持其作为第一大搜索引擎的地位。谷歌的合同构成了司法部具有里程碑意义的反垄断诉讼的基础，该诉讼指控该公司违反反垄断法，试图维持其在线搜索的垄断地位。\n\r\n\r\n消息来源：彭博社\n\r\n\r\n\r\n老王点评：至少在我们这里，我们不（能）用谷歌。\n\r\n\r\n\n\r\n支持者就 Tornado Cash 制裁问题起诉美国财政部\n\r\nTornado Cash 的六名用户周四对美国财政部、部长和其他官员提起诉讼，原因是美国财政部在 8 月份决定对该服务进行制裁。用户声称制裁的决定超出了政府的权限，侵犯了他们在美国宪法下的言论自由和财产权利。此案的结果涉及美国政府是否可以对公开的软件代码实施制裁这一新颖的法律问题，可能会对未来该行业产生影响。\n\r\n\r\n消息来源：Fortune\n\r\n\r\n\r\n老王点评：捍卫代码自由的权利。",
          "link": "https://linux.cn/article-15021-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-11T09:36:41.000Z",
          "wordCount": 460,
          "title": "硬核观察 #756 浏览器广告拦截器明年将被削弱",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15020-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "关于如何在 Ubuntu 和其他 Linux 中使用 Etcher 工具创建可引导 USB 的快速简单教程。\n\r\n\r\nEtcher 是由 Balena 创建的实用程序，它可以使用 .iso 文件创建可启动的 USB 和 SD 卡，其独特的方式让你的生活变得轻松。在本指南中，我将向你展示下载和安装 Etcher 的步骤。\n\r\n虽然对某些人来说有点过于简单，但对其他人来说可能很难。因此才有了本指南。\n\r\nEtcher 主要用于刷写（写入） Linux 操作系统的 .iso 镜像，例如 Ubuntu、Linux Mint .iso 镜像等。但理想情况下，它也应该适用于任何其他 .iso 文件。\n\r\n还有其他实用程序可用于创建可引导的 USB 驱动器，比如我之前写过 指南 的 Unetbootin。\n\r\n但话虽如此，在我看来，Etcher 更快、更干净、更好。它很少失败。成功率很高。\n\r\n在我解释这些步骤之前，快速回顾一下它的功能。\n\r\nEtcher 的功能\n\r\n\r\n创建可启动 USB 驱动器的清晰的 3 步过程\n\r\n自动检测 USB\n\r\n选择文件，选择目标，快速写入\n\r\n克隆驱动器\n\r\n选择本地下载的 .iso 文件或直接从 URL 下载\n\r\n干净而友好的用户界面\n\r\n跨平台：Linux、Windows 和 macOS\n\r\n内置 JS，electron 应用\n\r\n适用于 Linux 的独立 AppImage 可执行文件\n\r\n\r\n安装 Etcher\n\r\nEtcher 适用于所有平台。因此，你可以在所有 Linux 发行版、macOS 和 Windows 中使用以下方法轻松安装它。\n\r\n首先，进入以下链接。\n\r\n\r\n下载 ETCHER\n\r\n\r\n适用于所有 Linux 发行版\n\r\n从上面的链接下载 AppImage 可执行文件。然后通过“右键单击->属性”将权限更改为可执行。然后运行文…",
          "link": "https://linux.cn/article-15020-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-11T04:31:00.000Z",
          "wordCount": 644,
          "title": "在 Linux 中使用 Etcher 创建可启动 USB – 下载和使用指南",
          "imageUrl": null
        },
        {
          "id": "https://linux.cn/article-15019-1.html?utm_source=rss&utm_medium=rss",
          "author": "linux@linux.cn (linux)",
          "description": "Stable Diffusion 是一个“文本到图像”的人工智能模型。近日，Stable AI 公司向公众开放了它的预训练模型权重。当输入一个文字描述时，Stable Diffusion 可以生成 512×512 像素的图像，这些图像如相片般真实，反映了文字描述的场景。\n\r\n这个项目先是经历了早期的代码发布，而后又向研究界有限制地发布了模型权重，现在模型权重已经向公众开放。对于最新版本，任何人都可以在为普通消费者设计的硬件上下载和使用 Stable Diffusion。该模型不仅支持文本到图像的生成，而且还支持图像到图像的风格转换和放大。与之一同发布的还有 DreamStudio 测试版，这是一个用于该模型的 API 和 Web 用户界面。\n\r\nStable AI 公司表示：\n\r\n\r\n“Stable Diffusion 是一个文本到图像的模型，它将使数十亿人在几秒钟内创造出令人惊叹的艺术。它在速度和质量上的突破意味着它可以在消费者级的 GPU 上运行。这将允许研究人员和公众在一系列条件下运行它，并使图像生成普及化。我们期待着有围绕这个模型和其他模型的开放生态系统出现，以真正探索潜伏空间的边界。”\n\r\n\r\nLatent Diffusion 模型（LDM）是 Stable Diffusion 模型建立的一种图像生成方法。LDM 通过在潜伏表示空间latent representation space中迭代“去噪”输入来创建图像，然后将表示解码为完整的图像，这与其他著名的图像合成技术，如生成对抗网络（GAN）和 DALL-E 采用的自动回归方法不同。最近的 IEEE/CVF 计算机视觉和模式识别会议（CVPR）上有一篇关于 LDM 的论文，它是由慕尼黑路德维希-马克西米利安大学的机器视觉和学习研究小组创建的。今年早些时候，InfoQ 也报道的另一个基于扩散的图片生成 AI 是谷歌的 Imagen 模型。\n\r\nStable Diffusion 可以支持众多的操作。与 DALL-E 类似，它可以生成一个高质量的图像，并使其完全符合所需图像的文字描述。我们也可以使用一个直观的草图和所需图像的文字描述，从而创建一个看起来很真实的图像。类似的“图像到图像”的能力可以在 Meta AI 的 Make-A-Scene 模型中找到，该模型刚发布不久。\n\r\n一些人公开分享了 Stable Diffusion 创建的照片的例子，Stable AI 的首席开发人员 Katherine Crowson 也在 Twitter 上分享了许多照片。毫无疑问，基于人工智能的图片合成技术将对艺术家和艺术界产生影响，这令一些观察家感到担忧。值得注意的是，在 Stable Diffusion 发布的同一周，一幅由人工智能生成的作品在科罗拉多州博览会的艺术竞赛中获得了最高荣誉。\n\r\nStable Diffusion 的源代码可以在 GitHub 上查阅。\n\r\n\r\nvia: https://www.opensourceforu.com/2022/09/image-generation-model-stable-diffusion-is-now-open-source/\n\r\n作者：Laveesh Kocher 选题：lkxed 译者：lkxed 校对：wxy\n\r\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
          "link": "https://linux.cn/article-15019-1.html?utm_source=rss&utm_medium=rss",
          "publishedOn": "2022-09-11T04:06:42.000Z",
          "wordCount": 515,
          "title": "图像生成模型 Stable Diffusion 现已开源",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "先知安全技术社区",
      "feedUrl": "https://xz.aliyun.com/feed",
      "siteUrl": "https://xz.aliyun.com/forum/",
      "articles": [
        {
          "id": "https://xz.aliyun.com/t/11669",
          "author": null,
          "description": "某后台管理系统的审计",
          "link": "https://xz.aliyun.com/t/11669",
          "publishedOn": "2022-09-09T15:56:45.000Z",
          "wordCount": 272,
          "title": "某后台管理系统的审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11684",
          "author": null,
          "description": "关于那WebSocket劫持的二三事",
          "link": "https://xz.aliyun.com/t/11684",
          "publishedOn": "2022-09-08T15:55:34.000Z",
          "wordCount": 907,
          "title": "关于那WebSocket劫持的二三事",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11682",
          "author": null,
          "description": "一些BAT的XSS实例（三）中级篇",
          "link": "https://xz.aliyun.com/t/11682",
          "publishedOn": "2022-09-07T15:54:00.000Z",
          "wordCount": 311,
          "title": "一些BAT的XSS实例（三）中级篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11659",
          "author": null,
          "description": "红队开发基础-基础免杀(四)",
          "link": "https://xz.aliyun.com/t/11659",
          "publishedOn": "2022-09-06T15:55:00.000Z",
          "wordCount": 445,
          "title": "红队开发基础-基础免杀(四)",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11653",
          "author": null,
          "description": "揭开新型窃密软件的面纱：伪装成CDR画图应用安装包",
          "link": "https://xz.aliyun.com/t/11653",
          "publishedOn": "2022-09-06T15:54:00.000Z",
          "wordCount": 285,
          "title": "揭开新型窃密软件的面纱：伪装成CDR画图应用安装包",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11664",
          "author": null,
          "description": "Linux提权基础分享和讨论",
          "link": "https://xz.aliyun.com/t/11664",
          "publishedOn": "2022-09-06T15:53:35.000Z",
          "wordCount": 2882,
          "title": "Linux提权基础分享和讨论",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11671",
          "author": null,
          "description": "CVE-2020-28413 MantisBT SQL注入漏洞分析",
          "link": "https://xz.aliyun.com/t/11671",
          "publishedOn": "2022-09-05T15:55:21.000Z",
          "wordCount": 1264,
          "title": "CVE-2020-28413 MantisBT SQL注入漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11681",
          "author": null,
          "description": "一些BAT的XSS实例（二）进阶篇",
          "link": "https://xz.aliyun.com/t/11681",
          "publishedOn": "2022-09-05T15:54:50.000Z",
          "wordCount": 262,
          "title": "一些BAT的XSS实例（二）进阶篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11672",
          "author": null,
          "description": "JAVA常用框架SQL注入审计",
          "link": "https://xz.aliyun.com/t/11672",
          "publishedOn": "2022-09-05T15:54:25.000Z",
          "wordCount": 1732,
          "title": "JAVA常用框架SQL注入审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11677",
          "author": null,
          "description": "一些BAT的XSS实例（一）基础篇",
          "link": "https://xz.aliyun.com/t/11677",
          "publishedOn": "2022-09-01T09:00:03.000Z",
          "wordCount": 278,
          "title": "一些BAT的XSS实例（一）基础篇",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11662",
          "author": null,
          "description": "利用Nginx、Tyk Gateway API和CloudFlare防火墙隐藏C2设施",
          "link": "https://xz.aliyun.com/t/11662",
          "publishedOn": "2022-08-31T14:55:35.000Z",
          "wordCount": 467,
          "title": "利用Nginx、Tyk Gateway API和CloudFlare防火墙隐藏C2设施",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11667",
          "author": null,
          "description": "域内批量获取敏感文件",
          "link": "https://xz.aliyun.com/t/11667",
          "publishedOn": "2022-08-31T14:54:03.000Z",
          "wordCount": 991,
          "title": "域内批量获取敏感文件",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11660",
          "author": null,
          "description": "CVE-2022-31197 PostgreSQL JDBC SQL注入分析",
          "link": "https://xz.aliyun.com/t/11660",
          "publishedOn": "2022-08-30T15:40:39.000Z",
          "wordCount": 291,
          "title": "CVE-2022-31197 PostgreSQL JDBC SQL注入分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11627",
          "author": null,
          "description": "ADCS攻击笔记",
          "link": "https://xz.aliyun.com/t/11627",
          "publishedOn": "2022-08-29T14:15:00.000Z",
          "wordCount": 509,
          "title": "ADCS攻击笔记",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11658",
          "author": null,
          "description": "ThinkPHP 5.0.X代码审计",
          "link": "https://xz.aliyun.com/t/11658",
          "publishedOn": "2022-08-29T13:51:41.000Z",
          "wordCount": 1495,
          "title": "ThinkPHP 5.0.X代码审计",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11652",
          "author": null,
          "description": "【云攻防系列】从攻击者视角聊聊K8S集群安全（上）",
          "link": "https://xz.aliyun.com/t/11652",
          "publishedOn": "2022-08-29T13:49:00.000Z",
          "wordCount": 475,
          "title": "【云攻防系列】从攻击者视角聊聊K8S集群安全（上）",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11655",
          "author": null,
          "description": "给木马带双眼睛",
          "link": "https://xz.aliyun.com/t/11655",
          "publishedOn": "2022-08-29T13:48:52.000Z",
          "wordCount": 329,
          "title": "给木马带双眼睛",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11651",
          "author": null,
          "description": "利用 PHP-FPM 做内存马的方法",
          "link": "https://xz.aliyun.com/t/11651",
          "publishedOn": "2022-08-29T13:45:00.000Z",
          "wordCount": 359,
          "title": "利用 PHP-FPM 做内存马的方法",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11647",
          "author": null,
          "description": "Flask Pin码构造详解",
          "link": "https://xz.aliyun.com/t/11647",
          "publishedOn": "2022-08-24T16:00:48.000Z",
          "wordCount": 665,
          "title": "Flask Pin码构造详解",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11628",
          "author": null,
          "description": "CVE-2022-34265 Django SQL 注入漏洞调试分析",
          "link": "https://xz.aliyun.com/t/11628",
          "publishedOn": "2022-08-24T15:58:17.000Z",
          "wordCount": 1189,
          "title": "CVE-2022-34265 Django SQL 注入漏洞调试分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11643",
          "author": null,
          "description": "一文入门 soot",
          "link": "https://xz.aliyun.com/t/11643",
          "publishedOn": "2022-08-24T15:57:08.000Z",
          "wordCount": 621,
          "title": "一文入门 soot",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11639",
          "author": null,
          "description": "聊一聊基于\"ebpf xdp\"的rootkit",
          "link": "https://xz.aliyun.com/t/11639",
          "publishedOn": "2022-08-23T16:10:42.000Z",
          "wordCount": 427,
          "title": "聊一聊基于\"ebpf xdp\"的rootkit",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11640",
          "author": null,
          "description": "论如何优雅的注入Java Agent内存马",
          "link": "https://xz.aliyun.com/t/11640",
          "publishedOn": "2022-08-23T15:59:38.000Z",
          "wordCount": 4217,
          "title": "论如何优雅的注入Java Agent内存马",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11633",
          "author": null,
          "description": "Shiro 历史漏洞分析",
          "link": "https://xz.aliyun.com/t/11633",
          "publishedOn": "2022-08-23T15:58:08.000Z",
          "wordCount": 1862,
          "title": "Shiro 历史漏洞分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11631",
          "author": null,
          "description": "Mysql蜜罐反制Cobalt Strike",
          "link": "https://xz.aliyun.com/t/11631",
          "publishedOn": "2022-08-22T12:14:06.000Z",
          "wordCount": 653,
          "title": "Mysql蜜罐反制Cobalt Strike",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11625",
          "author": null,
          "description": "对云函数隐藏C2技术的防御反制思路",
          "link": "https://xz.aliyun.com/t/11625",
          "publishedOn": "2022-08-22T12:13:05.000Z",
          "wordCount": 618,
          "title": "对云函数隐藏C2技术的防御反制思路",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11623",
          "author": null,
          "description": "\"容器逃逸失败\"案例分析",
          "link": "https://xz.aliyun.com/t/11623",
          "publishedOn": "2022-08-17T16:00:09.000Z",
          "wordCount": 809,
          "title": "\"容器逃逸失败\"案例分析",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11636",
          "author": null,
          "description": "【云攻防系列】玩转eBPF---关于内核运行时安全的那些事儿",
          "link": "https://xz.aliyun.com/t/11636",
          "publishedOn": "2022-08-17T15:54:00.000Z",
          "wordCount": 326,
          "title": "【云攻防系列】玩转eBPF---关于内核运行时安全的那些事儿",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11612",
          "author": null,
          "description": "记一次web登录通杀渗透测试",
          "link": "https://xz.aliyun.com/t/11612",
          "publishedOn": "2022-08-17T15:49:04.000Z",
          "wordCount": 309,
          "title": "记一次web登录通杀渗透测试",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11613",
          "author": null,
          "description": "Executor内存马的实现（二）",
          "link": "https://xz.aliyun.com/t/11613",
          "publishedOn": "2022-08-15T16:01:59.000Z",
          "wordCount": 1884,
          "title": "Executor内存马的实现（二）",
          "imageUrl": null
        },
        {
          "id": "https://xz.aliyun.com/t/11610",
          "author": null,
          "description": "从JDBC attack到detectCustomCollations利用范围扩展",
          "link": "https://xz.aliyun.com/t/11610",
          "publishedOn": "2022-08-15T15:55:00.000Z",
          "wordCount": 558,
          "title": "从JDBC attack到detectCustomCollations利用范围扩展",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "dev.to top (month)",
      "feedUrl": "https://rsshub.app/dev.to/top/month",
      "siteUrl": "https://dev.to/top/month",
      "articles": [
        {
          "id": "https://dev.to/github/why-are-people-developing-inside-containers-38o6",
          "author": "Rizèl Scarlett, GitHub",
          "description": "#github #beginners #cloud #docker",
          "link": "https://dev.to/github/why-are-people-developing-inside-containers-38o6",
          "publishedOn": "2022-09-09T20:49:53.000Z",
          "wordCount": 3612,
          "title": "Why are people developing inside containers?",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--7lFVUHWD--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/58pr74ygicsvwc84lzko.png"
        },
        {
          "id": "https://dev.to/wiseai/30-pytricks-ive-learned-by-joining-the-real-python-mailing-list-227i",
          "author": "Mahmoud Harmouch",
          "description": "#python #beginners",
          "link": "https://dev.to/wiseai/30-pytricks-ive-learned-by-joining-the-real-python-mailing-list-227i",
          "publishedOn": "2022-09-08T20:16:08.000Z",
          "wordCount": 3864,
          "title": "30 PyTricks I've Learned By Joining the Real Python Mailing List.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s---uxRo6-R--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://cdn.pixabay.com/photo/2016/07/13/08/48/mobile-phone-1513945_960_720.jpg"
        },
        {
          "id": "https://dev.to/madza/12-modern-ui-components-to-inspire-your-future-designs-4ni4",
          "author": "Madza",
          "description": "#webdev #design #ui #inspiration",
          "link": "https://dev.to/madza/12-modern-ui-components-to-inspire-your-future-designs-4ni4",
          "publishedOn": "2022-09-08T16:08:58.000Z",
          "wordCount": 2073,
          "title": "12 Modern UI Components to Inspire Your Future Designs 😍✨",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--hbquREjm--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/scnrm2bxol261sqbs5nk.png"
        },
        {
          "id": "https://dev.to/surajondev/50-awesome-tools-for-web-developers-5gan",
          "author": "Suraj Vishwakarma",
          "description": "#javascript #webdev #beginners #react",
          "link": "https://dev.to/surajondev/50-awesome-tools-for-web-developers-5gan",
          "publishedOn": "2022-09-08T11:31:33.000Z",
          "wordCount": 3150,
          "title": "50+ Awesome tools for Web Developers",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--8iFoZSNU--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/584lu1fv3nsoulybolcx.png"
        },
        {
          "id": "https://dev.to/devsyedmohsin/javascript-tips-and-tricks-you-need-to-know-1g2k",
          "author": "Syed Mohsin Raza",
          "description": "#webdev #javascript #programming #beginners",
          "link": "https://dev.to/devsyedmohsin/javascript-tips-and-tricks-you-need-to-know-1g2k",
          "publishedOn": "2022-09-08T11:16:33.000Z",
          "wordCount": 2017,
          "title": "JavaScript Tips And Tricks Every Developer Should know 💯 🚀️",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--ihSk23fE--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/hl22lqwcsrc92kvcap9y.png"
        },
        {
          "id": "https://dev.to/valeriavg/me-react-5-years-in-15-minutes-58od",
          "author": "Valeria",
          "description": "#react #beginners #javascript #webdev",
          "link": "https://dev.to/valeriavg/me-react-5-years-in-15-minutes-58od",
          "publishedOn": "2022-09-08T07:10:08.000Z",
          "wordCount": 4860,
          "title": "Me & React: 5 years in 15 minutes",
          "imageUrl": "https://dev.to/social_previews/article/1182435.png"
        },
        {
          "id": "https://dev.to/j471n/detect-when-users-switch-tabs-using-javascript-3mi3",
          "author": "Jatin Sharma",
          "description": "#javascript #webdev #tutorial #beginners",
          "link": "https://dev.to/j471n/detect-when-users-switch-tabs-using-javascript-3mi3",
          "publishedOn": "2022-09-07T04:00:01.000Z",
          "wordCount": 3171,
          "title": "Detect When Users Switch Tabs using JavaScript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--sh7elrYU--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qudvzomd2qg2su4d9a5n.png"
        },
        {
          "id": "https://dev.to/zevir/the-complete-list-of-heroku-alternatives-to-consider-1l8o",
          "author": "Zevi Reinitz",
          "description": "#heroku #webdev #programming #devops",
          "link": "https://dev.to/zevir/the-complete-list-of-heroku-alternatives-to-consider-1l8o",
          "publishedOn": "2022-09-06T15:21:05.000Z",
          "wordCount": 4602,
          "title": "The Complete List of Heroku Alternatives to Consider",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--vhb83Cu9--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ym56sdt5nhkglna6tse8.jpg"
        },
        {
          "id": "https://dev.to/novu/building-a-live-event-alert-system-with-react-socketio-and-push-notifications-2jg5",
          "author": "Nevo David, novu",
          "description": "#javascript #react #programming #webdev",
          "link": "https://dev.to/novu/building-a-live-event-alert-system-with-react-socketio-and-push-notifications-2jg5",
          "publishedOn": "2022-09-05T14:36:26.000Z",
          "wordCount": 5053,
          "title": "Building a live-event alert system with React, Socket.io, and Push Notifications 🚀",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--EHHuJVoh--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/nbmmt0sax2e28wluvsyl.png"
        },
        {
          "id": "https://dev.to/kaspera/we-measured-the-ssr-performance-of-6-js-frameworks-heres-what-we-found-1ck0",
          "author": "kaspera",
          "description": "#javascript #react #performance #webdev",
          "link": "https://dev.to/kaspera/we-measured-the-ssr-performance-of-6-js-frameworks-heres-what-we-found-1ck0",
          "publishedOn": "2022-09-05T06:35:44.000Z",
          "wordCount": 4232,
          "title": "We measured the SSR performance of 6 JS frameworks - here's what we found",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--am_cPbMF--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/c1vlghlhjps2toxu0m25.jpg"
        },
        {
          "id": "https://dev.to/codewithtee/15-array-methods-in-javascript-1p1m",
          "author": "Tabassum Khanum",
          "description": "#javascript #webdev #beginners #programming",
          "link": "https://dev.to/codewithtee/15-array-methods-in-javascript-1p1m",
          "publishedOn": "2022-09-04T18:05:05.000Z",
          "wordCount": 4075,
          "title": "15+ Array Methods in Javascript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--E2de0xXe--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vtkz5a0fnln38z578ikg.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/6-must-have-chrome-extensions-for-web-developers-1ma2",
          "author": "Tapajyoti Bose",
          "description": "#webdev #javascript #productivity #programming",
          "link": "https://dev.to/ruppysuppy/6-must-have-chrome-extensions-for-web-developers-1ma2",
          "publishedOn": "2022-09-04T06:15:00.000Z",
          "wordCount": 2331,
          "title": "6 must-have Chrome Extensions for Web Developers 🚀🌐",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--2XIBrsLR--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ba1979d6k9jju5e6ia6p.png"
        },
        {
          "id": "https://dev.to/sarath_pm/git-cheatsheet-414e",
          "author": "Sarath P M",
          "description": "#git #programming #github #codenewbie",
          "link": "https://dev.to/sarath_pm/git-cheatsheet-414e",
          "publishedOn": "2022-09-03T13:35:05.000Z",
          "wordCount": 3444,
          "title": "Git Cheatsheet",
          "imageUrl": "https://dev.to/social_previews/article/1178295.png"
        },
        {
          "id": "https://dev.to/heyjtk/big-o-notation-basics-made-dead-simple-1c9m",
          "author": "JTK",
          "description": "#softwareengineering #algorithms #coding",
          "link": "https://dev.to/heyjtk/big-o-notation-basics-made-dead-simple-1c9m",
          "publishedOn": "2022-09-02T19:06:38.000Z",
          "wordCount": 4881,
          "title": "Big O notation basics made dead simple",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--3OHOMm_M--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ia3qpqezyrd0lyr5j6dg.jpg"
        },
        {
          "id": "https://dev.to/surajondev/awesome-github-repositories-for-web-developer-part-2-1h8b",
          "author": "Suraj Vishwakarma",
          "description": "#github #webdev #javascript #beginners",
          "link": "https://dev.to/surajondev/awesome-github-repositories-for-web-developer-part-2-1h8b",
          "publishedOn": "2022-09-01T11:36:22.000Z",
          "wordCount": 3086,
          "title": "Awesome GitHub Repositories for Web Developer - Part 2",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--HfSsorGN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/n562actscws9k9rfsvpq.png"
        },
        {
          "id": "https://dev.to/whitep4nth3r/whats-the-difference-between-and-in-css-23p4",
          "author": "Salma Alam-Naylor",
          "description": "#css #webdev #beginners",
          "link": "https://dev.to/whitep4nth3r/whats-the-difference-between-and-in-css-23p4",
          "publishedOn": "2022-09-01T09:41:50.000Z",
          "wordCount": 2830,
          "title": "What's the difference between : and :: in CSS?",
          "imageUrl": "https://dev.to/social_previews/article/1181288.png"
        },
        {
          "id": "https://dev.to/francescoxx/how-to-learn-web3-september-2022-3h9h",
          "author": "Francesco Ciulla",
          "description": "#web3 #blockchain #beginners #programming",
          "link": "https://dev.to/francescoxx/how-to-learn-web3-september-2022-3h9h",
          "publishedOn": "2022-09-01T06:03:23.000Z",
          "wordCount": 5937,
          "title": "How to Learn Web3 (September 2022)",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--L7sp3K03--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ir3ojvhv20khaipk7x9l.jpg"
        },
        {
          "id": "https://dev.to/meshvpatel18/top-heroku-alternatives-for-free-46g1",
          "author": "Meshv Patel",
          "description": "#heroku #webdev #programming",
          "link": "https://dev.to/meshvpatel18/top-heroku-alternatives-for-free-46g1",
          "publishedOn": "2022-08-31T13:49:56.000Z",
          "wordCount": 4739,
          "title": "Top Heroku Alternatives for free",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--r_6FrH43--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/6p9g6fa8h6n8w0wfx453.png"
        },
        {
          "id": "https://dev.to/devdevcharlie/building-an-aircraft-radar-system-in-javascript-4ml8",
          "author": "Charlie Gerard",
          "description": "#javascript #webusb #rtlsdr",
          "link": "https://dev.to/devdevcharlie/building-an-aircraft-radar-system-in-javascript-4ml8",
          "publishedOn": "2022-08-29T16:00:41.000Z",
          "wordCount": 3830,
          "title": "Building an aircraft radar system in JavaScript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--bbckrCHJ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://res.cloudinary.com/devdevcharlie/image/upload/v1661734283/Group_36_i7nacq.png"
        },
        {
          "id": "https://dev.to/refine/5-most-common-usestate-mistakes-react-developers-often-make-3aig",
          "author": "Necati Özmen, refine",
          "description": "#react #webdev #programming #opensource",
          "link": "https://dev.to/refine/5-most-common-usestate-mistakes-react-developers-often-make-3aig",
          "publishedOn": "2022-08-29T09:26:00.000Z",
          "wordCount": 5649,
          "title": "5 Most Common useState Mistakes React Developers Often Make",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--icsJRQJA--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/8hwypzqq79uayyyj6ff9.png"
        },
        {
          "id": "https://dev.to/j471n/i-made-all-countries-flags-using-html-css-4cnc",
          "author": "Jatin Sharma",
          "description": "#css #webdev #html #beginners",
          "link": "https://dev.to/j471n/i-made-all-countries-flags-using-html-css-4cnc",
          "publishedOn": "2022-08-28T09:08:00.000Z",
          "wordCount": 6272,
          "title": "I made all countries' flags using HTML & CSS",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Gd_3mxyQ--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/bq099o7ud7g1xj3fa2at.png"
        },
        {
          "id": "https://dev.to/ruppysuppy/7-neat-tricks-for-js-that-you-probably-did-not-know-358d",
          "author": "Tapajyoti Bose",
          "description": "#javascript #webdev #programming #productivity",
          "link": "https://dev.to/ruppysuppy/7-neat-tricks-for-js-that-you-probably-did-not-know-358d",
          "publishedOn": "2022-08-28T05:02:31.000Z",
          "wordCount": 2816,
          "title": "7 neat tricks for JS that you probably did not know",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--WA6O6eXN--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/f263nocop0yni6w4d3ot.jpg"
        },
        {
          "id": "https://dev.to/daveson217/free-alternatives-to-heroku-3jh9",
          "author": "David Babalola",
          "description": "#help #heroku #webdev #python",
          "link": "https://dev.to/daveson217/free-alternatives-to-heroku-3jh9",
          "publishedOn": "2022-08-26T10:28:07.000Z",
          "wordCount": 5208,
          "title": "Free Alternatives to Heroku",
          "imageUrl": "https://dev.to/social_previews/article/1176747.png"
        },
        {
          "id": "https://dev.to/ondrejsevcik/20-principles-i-learned-from-10-years-of-developing-software-5354",
          "author": "Ondrej Sevcik",
          "description": "#beginners #programming #career",
          "link": "https://dev.to/ondrejsevcik/20-principles-i-learned-from-10-years-of-developing-software-5354",
          "publishedOn": "2022-08-25T17:38:25.000Z",
          "wordCount": 4102,
          "title": "20 principles I learned from 10 years of developing software",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--NnA9zcAf--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/xceonypgt9lwtyf4636x.png"
        },
        {
          "id": "https://dev.to/yuridevat/how-i-got-my-first-job-as-a-developer-by-making-simple-projects-seem-big-48oi",
          "author": "𝕁𝕦𝕝𝕚𝕒 👩🏻‍💻",
          "description": "#codenewbie #career #motivation",
          "link": "https://dev.to/yuridevat/how-i-got-my-first-job-as-a-developer-by-making-simple-projects-seem-big-48oi",
          "publishedOn": "2022-08-25T12:20:36.000Z",
          "wordCount": 6111,
          "title": "How I got my first job as a developer by making simple projects seem big",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--JK0WqSaY--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rarbgb13upbv6x9lo6rm.png"
        },
        {
          "id": "https://dev.to/shadowfaxrodeo/why-your-website-should-be-under-14kb-in-size-398n",
          "author": "Nathaniel",
          "description": "#todayilearned #webperf #webdev #performance",
          "link": "https://dev.to/shadowfaxrodeo/why-your-website-should-be-under-14kb-in-size-398n",
          "publishedOn": "2022-08-25T00:22:00.000Z",
          "wordCount": 4632,
          "title": "Why your website should be under 14kb in size",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--1cttSxyj--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/8ik8z1bn8pw7pde9kdsh.png"
        },
        {
          "id": "https://dev.to/mteheran/typescript-ultimate-guide-for-beginners-1dlo",
          "author": "Miguel Teheran",
          "description": "#typescript #javascript #guide",
          "link": "https://dev.to/mteheran/typescript-ultimate-guide-for-beginners-1dlo",
          "publishedOn": "2022-08-24T16:06:52.000Z",
          "wordCount": 3362,
          "title": "TypeScript: Ultimate guide for beginners",
          "imageUrl": "https://dev.to/social_previews/article/1175262.png"
        },
        {
          "id": "https://dev.to/wadecodez/5-fresh-project-ideas-for-web-developers-15l2",
          "author": "Wade Zimmerman",
          "description": "#webdev #javascript #css #beginners",
          "link": "https://dev.to/wadecodez/5-fresh-project-ideas-for-web-developers-15l2",
          "publishedOn": "2022-08-24T01:37:00.000Z",
          "wordCount": 2322,
          "title": "5 Refreshing Project Ideas for Web Devs",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--6ZgH4RYx--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vfasli39mv4th7plqhci.png"
        },
        {
          "id": "https://dev.to/madza/18-useful-github-repositories-every-developer-should-bookmark-2n99",
          "author": "Madza",
          "description": "#webdev #design #productivity #github",
          "link": "https://dev.to/madza/18-useful-github-repositories-every-developer-should-bookmark-2n99",
          "publishedOn": "2022-08-23T12:35:14.000Z",
          "wordCount": 3545,
          "title": "18 Useful GitHub Repositories Every Developer Should Bookmark 👍💯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--YZm-Jo7E--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ofoahawoba7xwkazx3jh.png"
        },
        {
          "id": "https://dev.to/novu/building-a-chat-browser-notifications-with-react-websockets-and-web-push-1h1j",
          "author": "Nevo David, novu",
          "description": "#react #node #javascript #programming",
          "link": "https://dev.to/novu/building-a-chat-browser-notifications-with-react-websockets-and-web-push-1h1j",
          "publishedOn": "2022-08-22T15:11:00.000Z",
          "wordCount": 5262,
          "title": "Building a chat - Browser Notifications with React, Websockets and Web-Push 🤯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--9NqzXLjP--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/zitw40s2hspakrlfmy86.png"
        },
        {
          "id": "https://dev.to/irreverentmike/5-tools-i-add-to-every-new-web-project-for-seo-and-analytics-58f2",
          "author": "Mike Bifulco",
          "description": "#webdev #javascript #seo #productivity",
          "link": "https://dev.to/irreverentmike/5-tools-i-add-to-every-new-web-project-for-seo-and-analytics-58f2",
          "publishedOn": "2022-08-22T14:56:00.000Z",
          "wordCount": 4687,
          "title": "SEO tools I used to grow my sites to 20k+ visitors/month",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--XxgssCZp--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rmv9r0mhafv79co0if0g.png"
        },
        {
          "id": "https://dev.to/joelbonetr/speech-recognition-with-javascript-59g1",
          "author": "JoelBonetR",
          "description": "#javascript #webdev #tutorial #programming",
          "link": "https://dev.to/joelbonetr/speech-recognition-with-javascript-59g1",
          "publishedOn": "2022-08-22T09:23:00.000Z",
          "wordCount": 2790,
          "title": "Speech Recognition with JavaScript",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--q07qCeuf--/c_imagga_scale,f_auto,fl_progressive,h_500,q_66,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/fg7d21fl5gqpngmiwb40.gif"
        },
        {
          "id": "https://dev.to/patilganesh1010/a-practical-guide-to-brainjs-nfk",
          "author": "Ganesh Patil",
          "description": "#javascript #opensource #webcomponents",
          "link": "https://dev.to/patilganesh1010/a-practical-guide-to-brainjs-nfk",
          "publishedOn": "2022-08-22T05:20:00.000Z",
          "wordCount": 2564,
          "title": "A Practical Guide to Brain.js",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--27qs_4wY--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/6zxdg4k1tx4ixy82y4th.png"
        },
        {
          "id": "https://dev.to/pragativerma18/youre-not-using-http-status-codes-right-pc6",
          "author": "Pragati Verma",
          "description": "#codenewbie #webdev #computerscience #api",
          "link": "https://dev.to/pragativerma18/youre-not-using-http-status-codes-right-pc6",
          "publishedOn": "2022-08-21T20:17:00.000Z",
          "wordCount": 4350,
          "title": "You're Not Using HTTP Status Codes Right",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--NkOI-IC6--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/hwsth9hcuj6gjr93eu8y.png"
        },
        {
          "id": "https://dev.to/dawsoncodes/beautify-github-profile-5a3",
          "author": "Dawson Codes",
          "description": "#github #webdev #programming #career",
          "link": "https://dev.to/dawsoncodes/beautify-github-profile-5a3",
          "publishedOn": "2022-08-21T19:45:00.000Z",
          "wordCount": 3568,
          "title": "Beautify GitHub profile",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--wldQTiuy--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/b0s3feqi49x5ycw0bvy6.jpg"
        },
        {
          "id": "https://dev.to/ioanat94/dos-and-donts-of-creating-your-portfolio-website-2h4p",
          "author": "Ioana Tiplea",
          "description": "#beginners #portfolio #design #webdev",
          "link": "https://dev.to/ioanat94/dos-and-donts-of-creating-your-portfolio-website-2h4p",
          "publishedOn": "2022-08-21T05:43:00.000Z",
          "wordCount": 5082,
          "title": "Do's and Don'ts of Creating Your Portfolio Website",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--WfL0cbqq--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/80syci6u0b56vvj0z6k7.jpg"
        },
        {
          "id": "https://dev.to/hugaomarques/a-arquitetura-simples-lb",
          "author": "Hugo Marques",
          "description": "#arquiteturalimpa #sistemasdistribuidos #aws #systemdesign",
          "link": "https://dev.to/hugaomarques/a-arquitetura-simples-lb",
          "publishedOn": "2022-08-20T18:59:15.000Z",
          "wordCount": 7014,
          "title": "A Arquitetura simples",
          "imageUrl": "https://dev.to/social_previews/article/1170796.png"
        },
        {
          "id": "https://dev.to/lico/react-ts-dont-repeat-the-type-when-you-pass-functions-as-props-use-their-types-5h6h",
          "author": "SeongKuk Han",
          "description": "#react #typescript #webdev #beginners",
          "link": "https://dev.to/lico/react-ts-dont-repeat-the-type-when-you-pass-functions-as-props-use-their-types-5h6h",
          "publishedOn": "2022-08-19T03:08:00.000Z",
          "wordCount": 2340,
          "title": "React TS: Don't repeat the type when you pass functions as props, use their types.",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Nzix1Sm2--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ariysc4jtiw7d020or2n.png"
        },
        {
          "id": "https://dev.to/bytehide/visual-studio-codes-new-editor-sticky-scroll-feature-never-get-lost-in-the-code-again-1dob",
          "author": "ByteHide",
          "description": "#news #vscode #beginners #programming",
          "link": "https://dev.to/bytehide/visual-studio-codes-new-editor-sticky-scroll-feature-never-get-lost-in-the-code-again-1dob",
          "publishedOn": "2022-08-18T13:34:00.000Z",
          "wordCount": 4217,
          "title": "Visual Studio Code's New Editor Sticky Scroll Feature - Never Get Lost In The Code Again!😍",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--KSAUmkkn--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/unwqie2g73nlewbasmst.png"
        },
        {
          "id": "https://dev.to/chegerose/5-enhancements-that-will-boost-your-nodejs-app-3pj5",
          "author": "Rose Chege",
          "description": "#node #performance #javascript #programming",
          "link": "https://dev.to/chegerose/5-enhancements-that-will-boost-your-nodejs-app-3pj5",
          "publishedOn": "2022-08-18T10:13:00.000Z",
          "wordCount": 3771,
          "title": "5 enhancements that will boost your Node.js app",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--iffLzmlg--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/arii3ff4d1awwzado9bt.jpg"
        },
        {
          "id": "https://dev.to/aviyel/9-no-code-tools-you-should-definitely-try-in-2022-33ol",
          "author": "Pramit Marattha, Aviyel Inc",
          "description": "#productivity #nocode #beginners #webdev",
          "link": "https://dev.to/aviyel/9-no-code-tools-you-should-definitely-try-in-2022-33ol",
          "publishedOn": "2022-08-18T09:13:00.000Z",
          "wordCount": 4178,
          "title": "9 No-Code Tools You should definitely try in 2022 🔥💯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--c-WCiahL--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qip87ybn1kxmiaaeyql8.png"
        },
        {
          "id": "https://dev.to/dcodeyt/5-javascript-events-you-need-to-know-1jjl",
          "author": "Dom (dcode)",
          "description": "#javascript #webdev #beginners",
          "link": "https://dev.to/dcodeyt/5-javascript-events-you-need-to-know-1jjl",
          "publishedOn": "2022-08-17T22:58:04.000Z",
          "wordCount": 1658,
          "title": "5 JavaScript Events You NEED To Know 🌏",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--tFRObNac--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/gucfmv9t4edb3i2onys1.jpg"
        },
        {
          "id": "https://dev.to/madza/14-killer-web-applications-to-boost-your-productivity-5ah1",
          "author": "Madza",
          "description": "#webdev #javascript #coding #productivity",
          "link": "https://dev.to/madza/14-killer-web-applications-to-boost-your-productivity-5ah1",
          "publishedOn": "2022-08-17T15:11:19.000Z",
          "wordCount": 3939,
          "title": "14 Killer Web Applications to Boost Your Productivity 🚀💯",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--IXGZTi3K--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/jhhasvo92nkd0sltyt85.png"
        },
        {
          "id": "https://dev.to/github/how-to-run-a-frontend-workshop-in-codespaces-2ede",
          "author": "Rizèl Scarlett, GitHub",
          "description": "#github #tutorial #cloud #webdev",
          "link": "https://dev.to/github/how-to-run-a-frontend-workshop-in-codespaces-2ede",
          "publishedOn": "2022-08-17T14:29:00.000Z",
          "wordCount": 4181,
          "title": "How to run a frontend workshop in Codespaces",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--Qz-g8zWH--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/orxbylv04z8364vu8ilk.png"
        },
        {
          "id": "https://dev.to/nexxeln/my-developer-workflow-using-wsl-tmux-and-neovim-55f5",
          "author": "Shoubhit Dash",
          "description": "#productivity #vim",
          "link": "https://dev.to/nexxeln/my-developer-workflow-using-wsl-tmux-and-neovim-55f5",
          "publishedOn": "2022-08-16T15:53:54.000Z",
          "wordCount": 4875,
          "title": "My developer workflow using WSL, tmux and Neovim",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--dnoW6OOg--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ue2ce6py0dpz3m4pdd5k.png"
        },
        {
          "id": "https://dev.to/hr21don/20-crazy-useful-google-extensions-you-should-be-using-5bpe",
          "author": "Helitha Rupasinghe",
          "description": "#productivity #beginners #programming #webdev",
          "link": "https://dev.to/hr21don/20-crazy-useful-google-extensions-you-should-be-using-5bpe",
          "publishedOn": "2022-08-16T09:07:00.000Z",
          "wordCount": 3582,
          "title": "20+Crazy Useful Google Chrome Extensions You Should Be Using",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--GecGHhID--/c_imagga_scale,f_auto,fl_progressive,h_500,q_66,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/2mor5udn5ufg5u5tbuni.gif"
        },
        {
          "id": "https://dev.to/novu/building-a-chat-app-with-socketio-and-react-2edj",
          "author": "Nevo David, novu",
          "description": "#react #node #javascript #programming",
          "link": "https://dev.to/novu/building-a-chat-app-with-socketio-and-react-2edj",
          "publishedOn": "2022-08-15T14:18:46.000Z",
          "wordCount": 9731,
          "title": "Building a chat app with Socket.io and React 🚀",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--SvjQGXwq--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/8ylxpg8dsaos9a1flawq.png"
        },
        {
          "id": "https://dev.to/aviyel/top-9-ways-to-become-a-successful-self-taught-developer-48cm",
          "author": "Pramit Marattha, Aviyel Inc",
          "description": "#programming #beginners #webdev #productivity",
          "link": "https://dev.to/aviyel/top-9-ways-to-become-a-successful-self-taught-developer-48cm",
          "publishedOn": "2022-08-15T06:57:00.000Z",
          "wordCount": 3700,
          "title": "Top 9 ways to become a successful self-taught developer",
          "imageUrl": "https://res.cloudinary.com/practicaldev/image/fetch/s--_BMVCepr--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/9pcdg4x8aknt1bwh57st.png"
        }
      ]
    },
    {
      "title": "少数派 -- Matrix",
      "feedUrl": "https://rsshub.app/sspai/matrix",
      "siteUrl": "https://sspai.com/matrix",
      "articles": [
        {
          "id": "https://sspai.com/post/75692",
          "author": "中年程序猿汪二",
          "description": "中年的汪二眼里已经没有了光，头顶却越来越光，脱贫没脱掉，却脱了发，还和颈椎病斗争了多年，最终还是和颈椎病共存了。\n汪二有个儿子，每当小儿写作业的时候，就在后面，天天唠叨抬头。汪二摸了摸硬直的颈椎想：此生因为颈椎没能成为乔布斯，下一代不能在此再折一次啊。\n\n汪二在某宝上买了一些防止小朋友写作业低头的产品，有物理挡着的，有智能硬件提醒的，都不甚理想，小儿要不是完美避开了物理障碍，就是把电拨了。\n为了呵护下一代的乔布斯，也为了当代打工人还能为祖国健康工作三十年，幸福生活一辈子！\n汪二挥洒着中年程序猿的余晖，花了数月写了一个新的App，它叫顶瓜瓜！\n如何使用\n打开App，放在桌前手机支架，角度随意，只要能拍到头即可，然后脑袋上会顶个西瓜，姿势不正确的时候，西瓜会掉下来。\n \n \n当你低头了，离桌子太近了，歪头了，它会用有多种方式提醒你，屏幕闪烁和语音提醒（可选择鸭子叫，或真人发声），如果你有Apple Watch，手表会振动。\n\n灵敏度松严可调，建议在写作业时调松，用电脑时调严一点。\n\n在公司里，为了打工人在使用时避免被老板当成在玩自拍，App 设计了10几个花式 Animoji 拟我表情头套可选（也可能更像在玩自拍），随着使用时长增加还可逐步解锁更多表情。\n\n除了可以顶西瓜，当然你也可以顶个榴莲、书、花瓶、鸟窝、皇冠等。不要低头！低头皇冠会掉！打碎了贵重的花瓶也不好啊。\n除此之外，它也是一个蕃茄钟应用，你可以选择不同时长来使用，完了有完善的统计功能可供日后分析。在App 上可查看当日/月/年/近7日/近30日专注时间，以及不良坐姿统计，数据存储采用 iCloud Private Database ，它仅由你自己可以查看自己的数据，最大化保护你的隐私，并支持多设备数据同步。\n小组件\n支持 iOS 16 锁屏小组件和 iOS 14 桌面小组件\n\n作为一个AR应用，顶瓜瓜上线的第二天就获得了 App Store 推荐啦！🎉\n\n关于用户隐私\nApp 使用 iOS 系统的机器学习，完全本地运算，无需联网，你也不用担心衣装不整时使用会被汪二偷看，另外和汪二的其他作品一样，无广告，无事绝不推送，绝不推送，送。。。\n支持设备\nApp 利用了设备的搭载的前置原深感（TrueDepth）相机，需要 iPhone X 或 iPad Pro 11-inch及后续机型才能使用(即支持FaceID)。更多参考：https://support.apple.com/HT209183\n致谢\n感谢仍在日本读书的青年才俊 Megabits（PomNow作者），设计师狳魚，YaoYao 用户群的大力支持。\n下载地址：\nhttps://apps.apple.com/app/id1629577265 或 App Store 搜索： 顶瓜瓜\n有个18元的Pro 内购，欢迎大家提出一些毫无原则的鼓励，和冲动的付款。如果你觉得毫无用处，就当手工耿的发明也行。",
          "link": "https://sspai.com/post/75692",
          "publishedOn": "2022-09-13T07:01:54.000Z",
          "wordCount": 512,
          "title": "这款 App 想再次尝试拯救下你的脖子",
          "imageUrl": "https://cdn.sspai.com/2022/09/13/771d815607f60a6d0bda5d0ee3dc4a52.png"
        },
        {
          "id": "https://sspai.com/post/75690",
          "author": "红酒皇",
          "description": "本文参与数字文具盒征文活动。\n产生学术外脑的需求\n自大一使用数字化笔记伊始，我就开始钻研如何更好地阅读“课本”。每一门课程推荐阅读的参考书目，最后都通过我的[知识处理流程]成为我知识仓库的一部分。相应的，作为知识处理载体的 MarginNote 是以书目为主要处理对象进行加工的。我对任一知识的理解，都以文本为土地生长于文本，也正因为如此，它们始终无法脱离文本。当我在想到某一点时，我总会进而联想到这是在书中的第几章。这恰是因为我所阅读的参考书目，本身为了阐述这一理论时，已经形成一套体系，通过作者对理论的理解串而联之，因此我想要从中抓取的不过是我对于作者自建的知识系统的读取（以及批注）。这使得我对知识的理解方便快捷许多，因为每一知识之间的联系已经植根于文本之中了，我的学习过程更接近于摘取树木结出的果子。\n当开始进行理论课题研究后，我就不再能直接参考一套现有的体系，而必须要创造一套“知识系统”，使其能完整地说明这一课题对象的方方面面。只有具有了足够扎实的土壤，也就是与课题相关的足够知识，才能够创造出一棵身形完整的树木。这时候我需要从知识仓库的储备中选择合适的对象，说明其中的联系，哪颗葡萄长在哪根藤上，才能够写出一篇言之凿凿详实陈告的学术论文。\n学术论文是厚积薄发，其内容相较于写作之人所掌握的知识必然是瓢水量海。因此，一篇优秀的学术论文背后离不开一个硕大的知识仓库。如果我们能够借用之前学习的思路，也找到一个载体能够更好地帮助我们进行这样的知识处理和储存，那么最后的输出步骤也会相应地高效清晰很多。\n这样一个用以进行专业知识输出的载体，我称之为「外脑」。\n外脑的作用并非是取代我的脑子替我进行思考，而是尽可能地储存和展示我记忆的内容和产生的思考。它作为知识处理的辅助工具，清除的是我在课题研究中容易遇到的障碍，比如\n\n较为冷僻的概念和定义容易被遗忘和模糊\n两个概念之间的关联还没有明确或记录…",
          "link": "https://sspai.com/post/75690",
          "publishedOn": "2022-09-12T15:02:12.000Z",
          "wordCount": 605,
          "title": "数字工具盒｜用 Obsidian 来打造你的学术外脑",
          "imageUrl": ""
        },
        {
          "id": "https://sspai.com/post/75682",
          "author": "玉树芝兰",
          "description": "Stable Diffusion 的人工智能绘画能力，我在之前已经不止一次给你展示过了。\n \n \n目前， Stable Diffusion 的代码和模型都已开源。按理说，每一个感兴趣的用户，都应该正在开心地尝试作画。但是，这种模型执行起来，需要足够的算力支持。前些日子，你还得需要一块专业级 GPU 来运行它。我买不起专业 GPU 怎么办呢？就从 Google Colab 租了云 GPU 来用。为此，还交了钱订阅 Colab Pro 。\n\n而随着最近 PyTorch 对苹果 ARM 芯片支持的完善，你现在完全可以在自己的 M1/M2 Mac 上面运行 Stable Diffusion ，来获得绘图结果了。\n想想看，不花一分钱去租或者买 GPU ，就能在本地出图。那岂不是相当于把一个插画师随身携带了？想想都兴奋。\n但问题是，在上周，为了实现这个功能，你还需要按照别人提供的详细教程，在本地安装一系列的软件包。\n\n设置上稍微出点儿问题，往往就会让小白用户手足无措。\n\n嘿，我明明只是打算输入文本生成图像，为什么需要达到计算机二级终端命令行操作水平才行？\n这个痛点，不只是想尝鲜的新手会有，就连专业人士也会觉得很麻烦。这么多年被图形界面宠坏了，大伙儿早就更习惯了窗口交互。连换个描述语，都要在一行行代码里面做文本替换，不愉快。\n\n今天我偶然看到了一个新的 Github 项目，叫做 Diffusion Bee ，可以有效解决咱们这个痛点 —— 终于，在 M1/M2 Mac 上面，图形界面开箱即用。不需要手动安装依赖、命令行输入参数，更不用对报错调试…… 总之，你可以直接用 Stable Diffusion 来画图了！\n\n项目链接在这里。你需要做的，就是点击这个硕大无朋的 Download 按钮，下载安装包。\n\n然后，双击打开软件包，拖拽图标，即可完成安装。\n\n执行安装后的软件包，软件开启。\n…",
          "link": "https://sspai.com/post/75682",
          "publishedOn": "2022-09-12T08:41:07.000Z",
          "wordCount": 616,
          "title": "如何在你的 M1/M2 Mac 本地运行 Stable Diffusion？",
          "imageUrl": "https://cdn.sspai.com/2022/09/12/6fee57e54f3299ce6ffec7bb781b4e26.png"
        },
        {
          "id": "https://sspai.com/post/75666",
          "author": "陳川端",
          "description": "Matrix 首页推荐\nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。\n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\n在最初打造 work-life balance 的居家空间时，物件的采购上确实更接近科技爱好者的「实用主义」，比如 BenQ 和 Wit 的灯具，极米的投影，甚至是全屋各个插座配置的多口氮化镓充电头等等，从实际体验到购买参考上的价值角度，每一件都很适合作为社区里「新玩意」栏目中的内容进行分享。\n\n但「器材」带来的兴奋很快就会过去，分享欲被时间消解，最近的购买也渐渐转向了那些「谈不上多有用，但就是喜欢」的东西，索性就用一个合集，整理一下最近带回家的「朋友们」。\n「红磨坊的舞会」油画&Pantasy 拼奇积木神奈川冲浪里\n前段时间的高温天气着实难熬，因为旅行家里空了几天，返沪时才发现在客厅的长杆蜡烛都被融弯，于是下定决心要换上一些「蓝色系」的点缀，试图在视觉上让自己有清凉的感觉。\n\n抱着这样的想法最近频繁逛了市集、旧货仓库和线下家居店，终于找到一副以深蓝色为基色的油画 ——「红磨坊的舞会」（Auguste Renoir Bal du moulin de la Galette）。原作来自法国印象派画家雷诺阿，这一副卡通版本的画家卖家自己也不太清楚，似乎是在某次展览中撤下的作品，尺寸为 150cm x 90cm。第一眼见到就无比喜欢，清爽浪漫的童话感觉很适合用来调和目前客厅的沉闷，秒付款带回家后立刻替换了原先的主装饰画，现在从房间出来一眼就能看到这一簇蓝色，令人身心愉悦。\n\n照片里的另一抹蓝色是之前一同西北旅行的队友寄来的礼物，我们曾相约在未来走遍国内还未涉足的地方，但不久后他就入职了 Pantasy 拼奇积木，这两年屡次邀约都因为工作忙…",
          "link": "https://sspai.com/post/75666",
          "publishedOn": "2022-09-10T09:11:02.000Z",
          "wordCount": 531,
          "title": "谈不上多有用，但就是喜欢：从实用主义走向恋物情结",
          "imageUrl": "https://cdn.sspai.com/2022/09/10/ce85c6ebbaaa258455a654a0e68c4544.jpg"
        },
        {
          "id": "https://sspai.com/post/75275",
          "author": "北鸮",
          "description": "「大厂」应用在你的想象中是什么样子？动辄 10G 的占用空间，还是让老旧设备突发高热的迟缓动效？\n我们总是看到这样的例子——当一家软件公司开始做大做强，用户量飞速上涨之后，他们的产品往往就走向一条不可挽回的庞杂之路。开发团队试图用更多的新功能和更大的饼圈住更多用户，越来越臃肿的界面和逐渐扩充的体积也让用着老设备的用户更加痛苦。\n不过大厂也并非所有产品都如此不堪，总有一些优质应用，因为顶着「大厂」的帽子让用户望而却步。这篇文章就简单介绍几个由头部开发商开发的小应用，希望这些好产品能得到它们应有的认识。\n微软数学：你手机里的数学老师\n平台：iOS / Android / 网页\n\n微软数学是一款用来求解数学方程式的 App——但它不止于此。通过拍照、手写或者是键盘输入待求解的方程式，它不仅可以帮你求出结果，还可以查看详细求解过程，必要时还会附加图片，再也不怕答案里的「略」。\n书签、历史记录功能都很完善，App 还提供了测验功能，可以根据运算过的方程式生成类似的题目，帮助你巩固知识点。详细的功能我们在之前的 App+1 文章中有过介绍，如果你常常被数学困扰，微软数学可以让你的学习之路更加轻松。此外，Edge 浏览器已经内置了微软数学，你可以在打开含有数学公式的页面时尝试这一功能。\nLayout：快捷图像拼贴工具\n平台：iOS / Android\n\nLayout 是一款用来拼接图片的 App，开发者是当时推出了多款独立图像编辑应用的 Instagram。Layout 功能简单，操作也很直观，选择图片与给定的拼接模板即可。不过在 Facebook（Meta）再次改变策略后，这些独立应用又都纷纷整合回了 Instagram。2020 年 Instagram 上推出的 Layout 功能就是这款 App 的延伸。\nLayout 上次更新停留在 2018 年末，但其体积小巧，功能粗暴，成图迅…",
          "link": "https://sspai.com/post/75275",
          "publishedOn": "2022-09-10T03:00:00.000Z",
          "wordCount": 583,
          "title": "大厂出品不等于又大又慢，这 6 个小应用值得一试",
          "imageUrl": "https://cdn.sspai.com/article/340461ec-929a-554a-c28d-2b3df71429e6.jpg"
        },
        {
          "id": "https://sspai.com/post/75632",
          "author": "两颗皮蛋",
          "description": "视频文字稿部分\n引子\n2016年秋季发布会\n开头的这段演讲来自于 2019 年的苹果秋季发布会，Tim 在台上说，在苹果创办的这 40 年里，教育深深的植入进了苹果的 DNA。其实回想一下历年来苹果对外的发言，对 DNA 的表述一直是非常谨慎和克制的，尽管苹果做了许多成功的产品，但你很少会听到什么东西构成了苹果的 DNA，在我的印象中只有两个，乔布斯当年说苹果要始终走在科技和人文的交叉口，这算是一个，而 Tim 口中的教育，则是另一个。而今天这期苹果护城河的视频，我们就来聊聊教育。\n坦率来说这个话题其实很早就进入了我们的选题库当中，甚至早于创建这个频道，很早之前我跟零号喝酒的时候就聊起过，你作为一个从业者，是没有办法去忽视苹果在这方面的成就的，但同时我们也知道，这注定不是一个迎合流量的选题，客观上来说，教育这个产品的目标用户不是我，可能也不是看视频的你，做这个选题是很有风险的一件事，有可能费了很大的劲，最后数据非常差。但我后来想清楚了，既然说教育是苹果的 DNA，那我们不妨就看看苹果在教育领域都做了什么，从这些动作和体验的细节上，我们也许就能知道，苹果为何而苹果，他到底哪里不一样。这期视频没有竞品分析，可能在一些细分领域苹果还有一些对手，但把苹果所有的投入放在一起时，尤其在国内的大环境下，苹果其实是没有竞品的，这是苹果真正的护城河。那让我们正式开始。\n人人能创造\n\n我们从苹果官网开始，把官网拉到最下面看索引的部分，可以很清晰的看到五列，代表苹果在国内的所有业务，其中第四列全部都是 to B 的商业业务，这里你就能看到 Apple 与教育的入口。打开之后你就能看到教育业务线有三个分支——基础教育、高等教育和高校学生。\n\n我先来给大家简单说几句后面两个，这两个大家应该是非常熟悉的。高校学生这个，就是大家最熟悉的教育优惠，页面当中会比较详细的介绍利用苹果产品和配套的 app 都可…",
          "link": "https://sspai.com/post/75632",
          "publishedOn": "2022-09-09T09:34:15.000Z",
          "wordCount": 578,
          "title": "创新的源头，苹果的DNA（对话葛越、谢恩伟）",
          "imageUrl": "https://cdn.sspai.com/2022/09/08/63ab40959d0c1c77cf9510a293b96a0c.jpg"
        },
        {
          "id": "https://sspai.com/post/75574",
          "author": "牛肉炒饭",
          "description": "「本文参与数字文具盒征文活动」\n\n自我介绍和学习内容\n第一次在少数派发文，简单介绍下自己。我从事轨道客车研发工作，就职于吉林长春国企大厂。懂得同学应该知道坐标了，不懂但感兴趣的同学欢迎私聊骚扰^_^。虽已毕业多年，因为从事研发工作的原因，还是要学习输入许多新技能和知识。借着少数派“我的数字文具盒”征文活动，作为非“学术”仅“研究”人员的我，也来蹭蹭热度。\n本文要和大家分享我在备考剑桥商务英语（下文用“BEC”缩写代替）高级学习备考过程中使用到的几个数字文具。考BEC高级的初衷简单到有些俗气：通过考试，公司每月发1000软妹币的外语补助，每两年需要重考一次。（让大家见笑了）\n出于一切为了钱财的本我思想，我开启了BEC的备考通关之路。本文仅和大家分享备考过程中使用的工具（硬件和软件），不涉及到备考应试的相关技巧。我也会整理关于BEC学习及应试方法的文章发在少数派上，感兴趣的同学可以关注一波。\n\n帮我通关BEC的数字文具们\n10.5寸ipad pro配合一代apple pencil是我数字文具的基础载体。2018年入手的这一套组合，现在用起来体验依然良好。\n数字文具一：GoodNotes\n我使用Goodnotes做BEC网课的课堂笔记。电子笔记对于字迹不好且排版混乱人士（是我自己没错了）极其友善。\n作为一个写字丑星人，我无论怎么注意排版和字迹，笔记的可读性都差到不行。上学时的课堂笔记混乱到没有人性，每次拿自己笔记复习时，我的内心都无比emo。“记的这些破玩意，鬼才愿意看。哪里来的自信用这么好看的本子呢？还不如随便用张纸，写完就扔来得痛快！”这样的想法从小到大，有过不止一次。\n时代在发展，社会在进步！使用电子笔记可以随时调整笔记排版，虽然依然无法拯救我丑恶的字迹，但笔记整体的可读性大大提高。对于解释性的图片、题目、清单等内容，直接截图到笔记中再调整好大小。笔记质量“真的比之前有了一…",
          "link": "https://sspai.com/post/75574",
          "publishedOn": "2022-09-09T08:38:36.000Z",
          "wordCount": 475,
          "title": "我的剑桥商务英语通关文具盒",
          "imageUrl": "https://cdn.sspai.com/2022/09/06/ec78e9c50db7aa85e5791f51b67122a8.jpg"
        },
        {
          "id": "https://sspai.com/post/75630",
          "author": "LiFE",
          "description": "本文写于 iPhone 14 Pro 发布当日，会在后续考虑对一些过时的内容进行更新，如有谬误欢迎指正。\n在 2022 年，智能手机显然不再是一个噱头十足的产品类别了。但在 Apple 的下一个重大产品类别「Reality」AR 眼镜出现前（或者说成熟前），iPhone 仍然是 Apple 需要全力以赴迭代以吸引消费者更新的产品。而 iPhone 14 Pro 的有趣之处在于：纵然它的硬件特性和我在发布会前预知的几乎完全吻合，我却从发布会前的「不太考虑购入」变成了「计划购入」。\n\n能制造这样的反差，说明其主要吸引力不止硬件特性，而是在各种无法被硬件特性所囊括的设计与解决方案里。\n事实上，硬件特性和其吸引力的相关程度低，是大部分高端产品的共性。而落实到 iPhone 14 Pro 这个产品上，影响其吸引力最重要的便是交互设计与软硬件协同、为专业用户设计解决方案的能力，以及能让它在部分方面「不思进取」的资本。通过今天这篇文章，我想分享一下在 iPhone 14 Pro 发布之后的一些杂思，围绕「iPhone 14 Pro 对我们设计『高端产品』的启示」展开。\n注：这些杂思中可能有一部分我在曾经讲过类似的观点。然而，想到互联网的随机性让我们每次的表达能触及和启发不同的人，便觉得适当重提一些观点也无大碍（甚至不介意日后继续这样做），看过我此前作品的读者还请多多包涵。\n1. 交互设计与软硬件协同\niPhone 14 Pro 上最吸引眼球的便是 Dynamic Island（灵动岛）这个设计。这个设计甚至让我产生了这样的想法：「如果未来的 iPhone 在实现完全的全面屏后、这个设计被取消，我大概会产生类似对 3D Touch 的一点不舍」。\n\n在我看来，从 iPhone 14 Pro 开始，Apple 事实上已经实现了「概念层面的无边泳池」。从 iPhone X 开始，全面屏的界面有…",
          "link": "https://sspai.com/post/75630",
          "publishedOn": "2022-09-09T07:46:07.000Z",
          "wordCount": 819,
          "title": "iPhone 14 Pro 对我们设计「高端产品」的启示",
          "imageUrl": "https://cdn.sspai.com/2022/09/08/5aba8fea58c01327bae2aff2b75d3c5d.png"
        },
        {
          "id": "https://sspai.com/post/75643",
          "author": "老木曾雪菜",
          "description": "前言\n日本作为工业强国之一，其文具产业量成熟而发达，诸多文具品牌都有百年以上的品牌历史，从早期的仿制和借鉴，到如今堪称原创程度极高、做工精巧细致、设计富有灵感和生活趣味，外观符合现代审美，因而被大家所深深喜欢。\n本篇将从品牌+代表现产产品介绍两方面，来和大家详细讲讲日系文具的趣味与实用属性。\n国誉\n\n国誉是一家综合的办公类设备供应商，创立于1905年，有极其丰富的文具产品生产线和办公家具产品供应。创始人黑田善太郎先生以封面纸起家，逐步发展成大型纸质品品牌，进而扩展到其它类别文具和家具行业。近年来也收购了多家国内企业，在我国建厂生产文具产品。\n购买国誉，还是要以他们的纸品、本册最为代表！\n国誉活页本\n\n国誉的活页本堪称是头号招牌，也是率先把活页本灵活收纳+书写的概念引入国内的学生群体，活页结构耐用，多种封面可选，后期还有不硌手的活页结构推出，非常成熟的代表作。\n\n除了结构上的优势，国誉Campus的内页纸质也是非常优秀的存在，设计有不同划线、结构的内页，并且日本进口原纸可能完美双面书写hold住钢笔。\n国誉Campus笔记本\n\n不习惯使用活页本的话，可以选择Campus系列下的笔记本，同样使用进口原纸，书写感受和活页本等同，完全hold住各种墨水~\n需要注意不要买成国誉子品牌Gambol系列，那个完全国产，虽然价格低，但不如Campus。\n国誉自我手账\n\n除了日用向的本子，国誉的自我手账是简易入手账坑的不错产品，有简约耐看的外皮和丰富的内页，可以很好得记录生活~\n每年一本，价格不贵~\n国誉对开笔袋\n\n极简设计的国誉笔袋也是品牌的热门款，拉链质感非常出色，设计简约耐看，适合中学生和办公一族！除了基础款，国誉还有些立式变形笔袋，基本都可以做到好用且耐用，值得推荐！\n国誉空气弹力剪刀\n\n国誉的这款剪刀也是站内神器之一，刃口锋利而耐用，所谓空气弹力是在握持位置增加了两个内握柄，使用感…",
          "link": "https://sspai.com/post/75643",
          "publishedOn": "2022-09-08T23:44:49.000Z",
          "wordCount": 477,
          "title": "你知道哪些日本知名文具品牌：为什么大家都爱日本文具？",
          "imageUrl": "https://cdn.sspai.com/2022/09/09/aaf4a2dcbfbe6a9f859f25cbf082b4a5.png"
        },
        {
          "id": "https://sspai.com/post/75323",
          "author": "Hermanchannn",
          "description": "Matrix 首页推荐\nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。\n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n本文封面来自：Unsplash.com\n\n七月中旬，我坐在拥挤的旅游大巴上，驶出深圳湾口岸前往隔离酒店。不知道是不是因为空调开得不够大以至于空气有点闷热，我的心情也有些沉闷，全然没有回家的兴奋。其实真要想，原因也很明了，因为自己在香港找工作的尝试失败了。\n这篇文章可能会和其他的经验总结有些不一样，因为我是站在一个失败者的角度来回顾和思考这一路上得到的经验教训。为了让自己的尝试有所价值，思考再三，我决定写下这篇文章，希望能帮助有留港工作意愿的朋友。\n本文的感受和经验根据我自己和身边朋友同学的亲身经历总结而成。因为经历和社交圈子有限，本文呈现的内容难免不能覆盖现实生活中的全部情况，请各位姑且听之，多有担待。如果有愿意分享自己经历或者想法的朋友，也欢迎留下自己的声音，共同探讨。\n受访者对于 2021 年香港就业前景看法趋负面（来源）\n专业选择\n我认为找工作是否成功包括两个衡量标准：\n\n能不能找到自己想要的工作；\n找到的工作在待遇、行业前景、个人发展空间等方面符不符合预期。\n\n我相信主观能动性的力量，但是一个人的成功，除了个人的奋斗，还需要考虑其他的客观因素。我认为找工作并不是从投递简历时才开始，甚至不是准备简历的时候开始的。很大程度上，一个人从事的职业在选择所学专业以及选择学习内容的时候就开始逐渐被决定了，甚至无论最后从事的工作和学习的内容有没有直接的联系。\n如果所学专业能更好地匹配当地市场环境和当时大背景的需求，那么找工作确实会显得事半功倍。香港作为一个外向型经济为主导的转口贸易港，如果想要留港工作，那么那些和「钱」字沾边的专业：金融、…",
          "link": "https://sspai.com/post/75323",
          "publishedOn": "2022-09-08T02:11:14.000Z",
          "wordCount": 551,
          "title": "毕业留港找工作，这些建议请笑纳",
          "imageUrl": "https://cdn.sspai.com/2022/08/29/fbb58b501630c17136cf1d98cb343063.jpg"
        },
        {
          "id": "https://sspai.com/post/75624",
          "author": "德坤",
          "description": "历史长河的锚点\n近段期间《梦华录》热播，我在豆瓣上看到网友“黄小胖”吐槽说，“感觉《梦华录》的制作方确实不完全理解北宋官制。”比如顾千帆的父亲说“你十八岁中进士，要是好好干，现在也是个翰林学士了。”事实上翰林学士官职极高，30岁左右的顾千帆正常情况下距离翰林学士还有很远的距离。\n《梦华录》\n同样的，顾千帆“兴平军节度使，参知政事，知苏州事”的父亲，这个“知苏州事”并不一定主政苏州。顾千帆父亲的历史原型可能是丁谓，有一段时间官名为持节苏州诸军事，苏州刺史，这些都不是实际岗位，都是他实际官名平江军节度使的自然延伸。换言之，丁谓当时应该在南京工作，而不是苏州。\n这名网友后来也感叹说：“《梦华录》的编剧就和我们这些普通观众一样，没有明白北宋阶官的制度，望文生义，认为苏州刺史就是苏州的官员，皇城副使就是皇城司的领导。这也是难免的，感觉只有专业人才能弄明白。”这名网友曾经对北宋奇特的官制产生了兴趣，在豆瓣友邻的鼓励下断断续续读了一些科普书籍。那么问题来了，有哪些能打通两宋与当下，专业与科普的书籍呢？或许《在田野看见宋朝》就是其中一本。包伟民先生在本书引言中，就诚恳地认为学术研究应当“走出‘专业’的圈子，以使历史知识能够走近更多的读者”。\n《在田野看见宋朝》，包伟民等著，浙江古籍出版社2022年8月出版。图源：浙江古籍出版社微信公众号\n就我个人而言，这本书之所以吸引我，在于提供了历史长河的锚点。这锚点，可以是距离我家不远的忠亭，可以是我多次穿越而过的鼓楼，可以是陆游的“深巷明朝卖杏花”，也可以是王安石在鄞县（今宁波）的新政实验。刘成国先生评价王安石时说：“所谓参天之木，必有其根；怀山之水，必有其源。”今天杭州背后的江南韵味、世代匠心，很大程度上来自两宋，而我们借助“锚点”回望两宋，也自有一股独特趣味。\n一手材料\n知乎上有网友提问说普通的中文系学生是否有阅读繁体竖排本古籍的必要。有一名网友…",
          "link": "https://sspai.com/post/75624",
          "publishedOn": "2022-09-07T15:10:39.000Z",
          "wordCount": 475,
          "title": "读书笔记141《在田野看见宋朝》",
          "imageUrl": "https://cdn.sspai.com/2022/09/07/a1ec32a3a2881abd1bfefe8ebb5db373.jpg"
        },
        {
          "id": "https://sspai.com/post/75622",
          "author": "锅从天上来",
          "description": "大部分的官方路由固件是功能、驱动固化后编译出来的，那自然缺点也很明显，很多第三方插件能提供的内容就不能用；饿，个人如果想要通过路由器实现更多功能和玩法，就只能借助于类似OpenWRT、Padavan这些第三方开源固件了。OpenWRT的框架化设计和包管理模式使用户有了完全的定制能力，国内很多软路由固件也都是基于OpenWRT深度开发的。\n\n为了解决内网设备的各种需求，就需要这些插件来支持了。我们有两种方法：第一个是主路由更换为软路由或者支持开源固件的硬路由；另一个就是添加一台支持开源固件的路由器，将其作为旁路路由使用。不过现在是千兆接入，一个支持2.5G及以上WAN口的旗舰硬路由，价格完全够搞台软路由的价格了，所以添置旁路路由是更合算过渡方案。\n\n1.第一次升级：两台硬路由的旁路由化尝试\n这次选择了GL.inet的两台支持OpenWRT的小路由：MT1300和SFT1200。SFT1200算是MT1300的SoC国产化后的一个低配版，二者使用了同样的模具设计，仅有颜色不同。\n\n所以二者的一致性还是很高的，同样都是一个千兆WAN口、两个千兆LAN口，有一个USB-A接口，同样都通过USB-C接口供电。\n\n不过SFT1200精简掉了网口的指示灯，并且USB-A的规格也降到了2.0，供电接口同样是使用的USB-C。\n\n另外就是SFT1200取消了TF卡槽，只能够通过USB接口进行存储扩展。MT1300的插槽标注支持128G，实测200G的卡的还是可以正确识别的。\n\n另一侧的模式选择与Reset按键，没有进行改动，二者这侧没有区别。\n\n在外观以外，MT1300的处理器是联发科MT7261A，32+256MB配置；SFT1200的处理器是矽昌SF19A2890，双128配置。不过二者差价在百元左右，这些差异倒也可以接受。\n\n上电待路由器完全启动后，我们就可以连接对应的Wi-Fi了。M…",
          "link": "https://sspai.com/post/75622",
          "publishedOn": "2022-09-07T14:22:46.000Z",
          "wordCount": 523,
          "title": "OpenWRT和软路由？我的踩坑手册就是你的入门指南",
          "imageUrl": "https://cdn.sspai.com/2022/09/07/10e54f861ed12d9e102f625ab45ccec0.jpg"
        },
        {
          "id": "https://sspai.com/post/75619",
          "author": "Fairyex",
          "description": "我前几天无聊在刷哔哩哔哩的时候，看到一个很吸引人的标题「充电，拓展，储存一步到位」，点进去看原来是一家创业公司 X-STATION 发布了一个名字叫「Cyberize 玲珑坞」充电头。看完宣传片后我直呼好家伙，表面上是 GaN 氮化镓 65W 快充头，背地里却偷偷给你最高 1TB 存储，还附带拓展坞和 HDMI 投屏功能，这是什么周星驰行为？\n我平时就喜欢折腾一些奇奇怪怪的东西，这玩意儿还能解决出门带上一堆乱七八糟东西的麻烦，自然跑不掉我的欲（划掉）愿望清单，赶紧弄了个回来体验一下。在体验了一周多之后我想说：\n坏消息 —— 是个缝合怪；\n好消息 —— 全缝上了。\n\nPS：先声明没有恰饭，纯粹是自己的体验，然后已经了解简单情况和基础参数的朋友，可以直接跳到后面的日常使用场景体验和玩法部分，看看有没有你心动的场景。\n\n过一遍外观和简单参数\n虽然说充电头也不太容易长成惊世骇俗的模样，但我们还是先来简单看看外观和一些参数。\n我拿到手的配件非常简单，就充电头，收纳包还有一条线（买手机不送充电头，买充电头居然送收纳包，十分不环保哈哈），收纳包的质感非常像耳机收纳包，不能说毫不相干，只能说一模一样。\n充电头和配件\n首次上手玲珑坞给我的感觉就是很轻巧，居然比 OPPO 自带的快充头还轻，重量大概就和小米送的 30W 快充头差不多（99g）。而且大小也是很正常的充电头大小（663CM），仅仅比小米送的 30W 充电头大一点点，和普通 100W GaN 快充头差不多大小，要知道玲珑坞里面还塞了一个固态硬盘和 HDMI 头，这个体积和重量控制还是可以的。另外两个充电脚也是直角收纳设计，不像普通充电头还要突出两个充电脚，进一步减少体积方便收纳。\n与不同充电头和固态硬盘大小的对比\n另外玲珑坞还自带三个不同颜色的橡胶圈让你套在充电头中间，非常有效防止你财力雄厚买了很多个，然后不小心把装着老师作品的充电…",
          "link": "https://sspai.com/post/75619",
          "publishedOn": "2022-09-07T10:07:16.000Z",
          "wordCount": 723,
          "title": "快充头，但是移动硬盘/拓展坞/投屏神器：X-STATION 玲珑坞是个啥？",
          "imageUrl": "https://cdn.sspai.com/2022/09/07/12d5662e21e3a84330e60fb467b51b62.jpg"
        },
        {
          "id": "https://sspai.com/post/75595",
          "author": "Nee",
          "description": "本文参与数字文具盒征文活动\n我是一名今年九月份入学的计科硕士，虽然才入学几天，但是一些工具已经成为我日常学习，写作输出的一部分，硕士生涯的目标是尽可能发几篇论文，然后找个机会寻个大厂落脚，因此难免要看很多的书，很多的论文。\n话虽如此，我使用各个软件的时间并不长，所以就按照熟悉程度做一个介绍与分享，以及我在使用的过程中遇到的痛点和爽点。\n全局总览\n\n浏览器 Chrome\nChrome 算是我的浏览器终极选择，之前一直用的 Edge，尤其是在 Windows 上，从新版 Edge 推出到前几天，我一直是 Edge 的忠实粉丝，不过由于 macOS 的 bug，让我不得不放弃 Edge，转投邪恶势力 Chrome。\n浏览器是信息最重要的输入接口，每天翻开电脑盖子的第一件事情就是打开浏览器，看看知乎热榜，看看 bilibili 的新动态以及 github 上是否有人给我点 star。其间要是遇到有趣的、有意义的文章我会通过各种剪辑插件将文章保存下来，例如 Cubox 插件和 Webclipper 插件。\nCubox 插件\n这是网页收集箱软件 Cubox 提供的一个网页剪辑插件\nCubox\n插件主要做了三件事：\n\n将网页的网址保存到 Cubox\n在本机深度抓取网页快照（这个功能相当好用，甚至可以抓取到知乎网页里的评论）\n对收集的网页进行简单的分类和标注\nCubox 拓展\nWebclipper 通用网页剪辑插件\n这是一个开源的网页剪辑插件，所有数据都保存在本地，剪辑之后的网页可以分发到多个应用，包括思源笔记，为知笔记，flomo 等。\nWebClipper\n可以手动选取要抓取的区域，并导出为 markdown 格式的文件，且文章内的图片也可以通过图床设置上传。\n对比与分类\n一定有人会想，为什么需要两个网页剪辑软件，这难道不会分散注意力吗？\n确实是这样的，但是我更坚信专门的软件做专门的事…",
          "link": "https://sspai.com/post/75595",
          "publishedOn": "2022-09-07T04:40:38.000Z",
          "wordCount": 572,
          "title": "『我的数字文具盒』研一新生的软件选择",
          "imageUrl": "https://cdn.sspai.com/2022/09/07/82e3151441f63b887b106cad7eaa620d.png"
        },
        {
          "id": "https://sspai.com/post/75576",
          "author": "酱紫表",
          "description": "Matrix 首页推荐\nMatrix 是少数派的写作社区，我们主张分享真实的产品体验，有实用价值的经验与思考。我们会不定期挑选 Matrix 最优质的文章，展示来自用户的最真实的体验和观点。\n文章代表作者个人观点，少数派仅对标题和排版略作修改。\n\n几年前有写过用 Spicetify 修改 Spotify 桌面客户端主题的教程，这几天再次重新装上发现有了挺多大的改进：lyric-plus 支持了网易云和 MusixMatch 歌词；fullAppDisplay 也能实现优雅全屏的播放；安装简化了很多主题也更为丰富。目前的状态已经让我觉得十分好看好用了，就特地再写篇 Spicetify 的教程。\n安装 Spicetify 客户端\nSpotify 在 Linux、Mac、Windows 桌面端都是 CEF (Chromium Embedded Framework) 架构，这给对客户端修改的修改提升了很大的便利和可行性。Spicetify 则是一款开源免费强大能修改 Spotify 客户端的主题、添加插件的命令行工具。Spicetify 官网 有安装教程，这里也是以官网的教程作为参考的。\nMac 或 Linux\ncurl -fsSL https://raw.githubusercontent.com/spicetify/spicetify-cli/master/install.sh | sh\ncurl -fsSL https://raw.githubusercontent.com/spicetify/spicetify-marketplace/main/resources/install.sh | sh\n复制命令在终端里执行就能完成安装。\nWindows\niwr -useb https://raw.githubusercontent.com/spicetify/spicetify-…",
          "link": "https://sspai.com/post/75576",
          "publishedOn": "2022-09-06T08:58:54.000Z",
          "wordCount": 652,
          "title": "给 Spotify 换个好看的皮肤 用上好用的歌词",
          "imageUrl": "https://cdn.sspai.com/2022/09/06/06c242266d714c02ba38459a8784ca87.PNG"
        },
        {
          "id": "https://sspai.com/post/75474",
          "author": "逐山海",
          "description": "8月 24 日，周三原神更新了 3.0 版本，故事推进到了新的国度，草之国-须弥。同时游戏中更新了草元素，补全了开服时定下的七元素基调。\n我从8月26日晚上开始，持续高强度地体验了多天的须弥，并在30日晚上达成须弥目前开放地图100% 探索度，总探索40% 的目标，我感觉是时候来夸夸它了。\n希望这篇文章可以给读者带来几个问题的解答。\n\n原神 3.0 如何？\n原神截止到目前的发展来看，吸引人的点有哪些？\n现在这个时间节点3.0值得入坑吗？\n\n原神 3.0 如何？\n瑕不掩瑜\n原神这个游戏是什么？我相信各位肯定有着自己的判断，毕竟上线已经快要两年，而且持续不断地出圈，从最开始甚至到现在还引起玩家争论不已的抄袭论，到最近的联动引发各种抢眼球的新闻，海外诸多漫展持续不断的产出相关活动以及素材，这款游戏在不断有负面新闻产生的同时也说明了一件事，原神，确实有东西。\n原神核心玩法在于大世界探索，收集宝箱，战斗主打元素反应，营收方式主要以gatcha 角色及武器抽卡为主。\n从上海疫情封控结束后，米哈游的产能呈现了井喷式的态势，这一点从2.8的海岛可以很好的体现出来。\n2.8版本持续约四十几天，可以体验的内容几乎相当于一个小品级游戏的体量，当然不排除这些东西都是2.6因疫情延迟，厚积薄发造成，关于这一点，需要再过几个版本来下评价。\n此次活动主要为四个角色一人一个海岛地图，夹杂有各个角色为主题系列的任务，不重复，且很好的融入了各个角色的特点，进一步的补完了每个角色的人设，其中以皇女、辛焱为最。\n\n皇女，即菲谢尔，直观的一个二次元少女，因为对于幽夜净土的执著追求，导致觉醒了神之眼，唤醒了奥兹——幽夜净土的使者，一只吐槽役的乌鸦。自称为幽夜净土的皇女，因此这个绰号也就留了下来。\n\n而辛焱，在整体剧情中的出现次数过少，且造型为黑皮，摇滚，冲天双马尾，所有的元素都不算大众的喜好因素，给玩家留下的印象则更…",
          "link": "https://sspai.com/post/75474",
          "publishedOn": "2022-09-06T02:19:23.000Z",
          "wordCount": 520,
          "title": "说起原神3.0，我在说什么",
          "imageUrl": "https://cdn.sspai.com/2022/09/01/e9b1de317940e2e7118e6c78d46e3047.jpg"
        },
        {
          "id": "https://sspai.com/post/75503",
          "author": "雯子",
          "description": "Hi，朋友。这个周终于读完了《走出唯一真理观》，翻看笔记时看到了下面这句话，刚好对这个事情也有一些亲身体会，借此契机聊聊这个话题。\n\n所谓的贯通不是用同一套道理概括一切，越是这样笼统地概括，越是无法接近本质，贯通是不同道理之间一种对话的契机。\nPhoto by Yang JunJie on Unsplash\n从抽象到具体\n        去年年底我需要招个实习生帮忙完成一些工作，看到HR推来的几份实习生简历还有点惊讶，现在实习生都这么卷吗？一页纸简历满满当当的实习经历，其中不乏优秀的大公司，实习做的事情看起来也很厉害，比如说“用户生命周期”、“销售转化率”、“曝光量”等等，我们开会经常用的词有一大半就出现了实习生的简历上，让人诚惶诚恐。\n        面试深入交流就会发现同学对运营、用户的理解远不及简历上绚丽的词汇。回答问题时，套用模板方法论的痕迹很明显。比如，如果让你来策划一个活动，你会怎么策划？很多同学会告诉你网上的那些步骤，当你更深入一层追问其中细节时，“你的转化率是哪一个环节到哪一个环节的转化率？数据提升具体是做了什么动作？你为什么要做这个动作？透过这个动作你的思考是什么？”，同学的水平如何就体现出来了。当然，这样深入的细节追问不仅是实习生，哪怕正职员工的面试也会被细细询问。\n        越是细节的追问，越容易发现不同的人对于一件事的理解、思考的深度差异。真正做过、不断思考的人会给你讲得特别清楚，逻辑也会很完善。\n        如果说实习生对专业词汇和术语的大肆应用是这个行业的冰山一角，那么对“方法论”和“底层逻辑”的迷恋大概是互联网行业通病。聪明人太多，相较枯燥的执行更愿意去快速了解各种各样的方法论和底层逻辑，倡导快速达成目标和高效率。从这个角度来方法论也是一个ROI高、快速达成目标的方法。只要知道底层的方法论，就可以看透一切，所向披靡。\n        …",
          "link": "https://sspai.com/post/75503",
          "publishedOn": "2022-09-05T07:43:17.000Z",
          "wordCount": 502,
          "title": "描绘自己的图景，在实践中托住它",
          "imageUrl": "https://cdn.sspai.com/2022/09/02/2135bb501e65aeeda33ba243e13d7fff.jpg"
        },
        {
          "id": "https://sspai.com/post/75531",
          "author": "老麦",
          "description": "这个周末又被封在家里了，去不了咖啡厅工作，客厅里唯一的办公位被麦嫂占领，两个孩子也很无聊，跑老跑去不得消停。于是，我也选择躺平了，一天睡两觉，醒了就刷视频、看电影。但偶尔又会想起公司的事；疫情各地物流受阻，电商收入又要受到影响；定好的品牌视频拍摄，可能又要因为疫情而延期；想着想着，心中又开始焦虑了，就这样在躺平、焦虑，焦虑、躺平之间反反复复，心情更差了。\n其实回头想想，在整个创业过程中，这点焦虑都属于家常便饭，但大部分人可能会困在焦虑之中，难以自拔。今天就聊聊我曾经最焦虑的几个阶段，也许能给大家一点参考吧。\n2015 年，为了公司业务转型，我开始尝试寻找投资人。性格内向且缺乏经验的我，除了要面对外部的各种质疑，还有应对内部的复杂关系，老股东该如何安顿？合伙人该怎样分配？每一次谈话，每一次邮件发出之后，都会让我无比焦虑。那段时间，我经常无意识的在街上暴走，或者去海边呐喊宣泄，情绪一直处于过山车状态，非常抑郁。直到融资搞定之后，我安排的第一件事是去医院做了全面体检，特别担心身体会出现大问题。\n焦虑归焦虑，真正解决问题的方法，还是要不停的尝试，通过理性沟通处理各方的诉求，该留的留，该走的走。突破自己原有的圈层，放开性格包袱，去寻找更多的可能性。所以，最终的融资不是来自投资公司，而是来自客户、同行和用户。\n2017 年，迎来了又一次创业考验，好不容易融到的一点钱，很快就花完了，马上就要进入发不出工资的窘境。现在想想其实也怪自己，拿到投资的一年时间里，过度的沉醉于资本市场逻辑当中，把大部分精力放在 BP 故事里，忽略了公司管理和业务聚焦，且一度自我感觉良好。\n此刻摆在眼前只有两条路：要么想尽一切办法支撑下去，要么选择清算并关闭公司。但这两条路都很难。不能再指望外人援助，靠自己就只能抵押房子，一旦失败，全家归零。想想已经积累数年的内容、用户、品牌，如果选择结束，也很难再有这样的机会了。何况我们确实做着正确且有价值的事情，只是我们还没有掌握更好的商业模式。\n一边筹措资金，一边送走部分团队，一边重新走出去约见客户。让客户了解我们的内在价值，哪怕是很小的客户，哪怕没有预算也无所谓，做好服务，以真诚换真诚。因为有前面的积累，加上团队的努力，半年之后，公司就能自己运转了。\n2020 年，公司业务已经稳定了，且略有盈余，我也终于还完了大部分贷款，总算可以轻装上阵。没想到春节刚过，新冠疫情全面爆发，全体成员隔离在家。刚刚起步的电商业务，直接就休克，客户拜访计划也全都暂停。说内心不慌是不可能的，焦虑情绪也开始了，但天灾面前，似乎也没什么办法。\n既然公司业务上没办法，就做点力所能及的事吧。无意间在工作群里发现了疫况小程序，可以通过地图定位周边疫情风险，我仔细研究发现是之前认识的开发者做的，聊天一问才知道，他也正在发愁中，数据录入、服务器压力，马上就撑不住了。于是我立刻动员了产品开发团队，参与到这个小程序的支持中，重构界面、扩容服务器、招募数据志愿者、紧急制作疫情科普防护内容，每天熬十几个小时，连续一周，竟然把这个小服务提供给三千万人。\n这段时间的无偿投入，虽然没有多少商业收益，却让更多人知道了少数派的存在，展现了团队的价值观，也间接验证了优质内容的多重价值。\n经过这些事情之后，我个人的抗焦虑能力算是大幅提升，并且也建立了应对原则。人非圣贤，孰能无虑，适当的放低预期，知足常乐。另一方面，既然焦虑不可避免，就不要轻易放弃思考和行动。要知道宏观环境下，很多问题都是阶段性和周期性的，它总会过去或者从头再来，但你的人生经历只有一次，你的行动将决定自己未来的走向。不管有多焦虑，都应该先选择承担起当下的责任，因为转机就发生在这个过程之中。\n换个角度来看，这世界上还有很多人，正在面对着各种生存、病痛、离别、各种不可逆转的人生变故，他们可能都还没有焦虑的机会，相对来说，我们依然属于幸运的多数派了。",
          "link": "https://sspai.com/post/75531",
          "publishedOn": "2022-09-05T05:34:54.000Z",
          "wordCount": 479,
          "title": "少数派思考 029：关于对抗焦虑",
          "imageUrl": "https://cdn.sspai.com/2022/09/05/e7063a2c02159d6c3f9e3fdf3731b51a.jpeg"
        },
        {
          "id": "https://sspai.com/post/75520",
          "author": "老木曾雪菜",
          "description": "前言\n如今因为网课、居家办公已经深入生活，打印机除了是企业办公的必备品，也成为了不少家庭书房的一部分。打印机耗材一般是指墨盒、墨粉、墨水、晒鼓等，但最核心的必备品则是复印纸，它是打印载体，对于我们一般家庭使用，都是A4尺寸的复印纸。\n复印纸国家标准的技术指标\n\n我们如今在使用的A4打印纸，执行的是GB/T 24988-2020 《复印纸》，是2021年正式施行的新国标，起草标准的牵头单位为A股上市公司太阳纸业，代表产品为金太阳。消费者比较熟悉的亚太森博品牌也是新国标的起草单位之一。\n复印纸根据参数水平不同分为优等品和合格品，优等品有更为出色的参数表现。在尺寸方面，我们最为熟悉的A4纸的标准尺寸为210*297mm。\n\n技术指标方面，国标规定了定量、厚度、挺度、平滑度、不透明度、D65亮度、可勃值、尘埃度、交货水分等指标的检测。\n定量指标也称为克重，指的是单位面积的质量，我们常说的70g、80g纸，其实单位是g/㎡，对打印纸的质感起决定性作用，对于市面上的大部分产品而言，70g纸适合单面打印，80g纸适合双面打印，90g纸可用于照片打印。\n高定量纸张一般伴随高厚度，但这也和印刷工艺有关，优等品的厚度要求更高。\n挺度指纸张的抗弯曲呢你，高挺度的纸张在打印机中更稳定，更不容易卡纸。\n平滑度则是对纸张表面凹凸特性的测试，变向影响着纸张的最终印刷效果。\n不透明度则是单张反射因数和内反射因数的比值，是纸张不透光能力的体现，高不透明度的纸张在双面打印、书写时更不容易受到背面的影响。\nD65亮度指的是纸张在D65（R457)光源下的内反射因数，体现的是纸张的白度，越接近100%，纸张的白度越高。\n可勃值是反映纸张的吸水能力，吸水少的打印纸在遇到水泼溅时，受到的影响就越小。\n对比产品清单与包装情况\n我一共买来了10款京东热销的知名品牌复印纸，价格从十几元/500张到35元+/500张不等，7…",
          "link": "https://sspai.com/post/75520",
          "publishedOn": "2022-09-03T11:57:38.000Z",
          "wordCount": 490,
          "title": "买了5000张A4纸~我们来谈谈打印用纸那些事",
          "imageUrl": "https://cdn.sspai.com/2022/09/03/b8f186d967ae90ad22e29623ea50d50f.jpg"
        },
        {
          "id": "https://sspai.com/post/75491",
          "author": "GoodNotes",
          "description": "有效的笔记并不只是简单地记录所听所见。\n普通的笔记记录可以帮助巩固加深记忆和信息的过程，除了用自己的话尽可能准确地总结核心概念之外，还有更多思路方法可以进一步优化笔记。\n大多数好学生的共同点是：他们使用特定的记笔记方法。在课前充分准备，在课堂中保持专注、积极参与，在课后高效复习关键概念。备考时也可以少走很多弯路。\n本文中，我们整理了五种最适合大学生的记笔记方法，以及它们的适用场景和优缺点：\n\n大纲法\n康奈尔笔记法\n笔记法\n笔记法\n笔记法\n\n \n1. 大纲法 (The Outline Method)\n大纲法可能是我们最熟悉的一种笔记法：结合项目符号（通常是小黑圆点）来表示不同的主题及其子主题，以大纲的形式构建笔记。开始在页面的最左侧编写主要主题，并使用缩进在下面的项目符号中添加相关的子主题。\n大纲法可以在短时间内将大段信息的结构组织分明，也方便日后回顾时进一步审阅和编辑。\n小红书博主 @百年摸鱼老字号\n \n适用场景：课程/讲座/会议设置有比较清晰的结构和逻辑。\n优点\n\n以逻辑的方式突出讲座的重点\n易于使用让学生集中注意力\n减少审阅和编辑时间\n为笔记提供适当和干净的结构\n\n缺点\n\n不适用于化学或数学等需要结合公式图表的科目\n结构设定较为零散、不遵循特定逻辑的课程/讲座\n\n \n2. 康奈尔笔记法 (The Cornell Method)\n\n我们在之前的一篇文章中介绍过康奈尔笔记法。它与其他方法的区别主要在于页面布局：将页面分为三或四个部分，从顶部的一排标题和日期（可选）开始，底部一排，中间两列。 左列占页面30%的宽度，右列占70%。\n \n右列记录所有实时课堂/会议笔记，左侧较窄的一列则用来补充记录关于笔记的评论、疑问或提示。在课堂/会议结束后，再花一点时间在底部栏补充总结主要思想，进一步加深记忆、消化知识点。\n康奈尔笔记结构\n适用场景：适合所有类型的课堂/讲座/会议，也可以用作…",
          "link": "https://sspai.com/post/75491",
          "publishedOn": "2022-09-01T12:22:38.000Z",
          "wordCount": 545,
          "title": "GoodNotes 教程｜最适合学生的五种实用笔记思路，结构一目了然，复习更高效",
          "imageUrl": "https://cdn.sspai.com/2022/09/02/a9099e34775ff4864aea1608af713aaf.png"
        }
      ]
    },
    {
      "title": "Opensource.com",
      "feedUrl": "https://opensource.com/feed",
      "siteUrl": "https://opensource.com/",
      "articles": [
        {
          "id": "70192 at https://opensource.com",
          "author": "David Both",
          "description": "How I troubleshoot swappiness and startup time on Linux\nDavid Both\nTue, 09/13/2022 - 03:00\n\n            \nI recently experienced another interesting problem in the Linux startup sequence that has a circumvention–not a solution. It started quite unexpectedly.\nI was writing a couple of articles while making some updates to my personal copy of my series of books, \"Using and Administering Linux: Zero to SysAdmin.\" I had four instances of LibreOffice Write open to doing all that. I had three VMs running with VirtualBox to test some of the things I was writing about. I also had LibreOffice Impress open to work on an unrelated presentation. I like to listen to music, so I had one of several tabs in Firefox open to Pandora, my music streaming service of choice. I had multiple Bash shells open using…",
          "link": "https://opensource.com/article/22/9/swappiness-startup-linux",
          "publishedOn": "2022-09-13T07:00:00.000Z",
          "wordCount": 1967,
          "title": "How I troubleshoot swappiness and startup time on Linux",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/gears_devops_learn_troubleshooting_lightbulb_tips_520.png"
        },
        {
          "id": "70190 at https://opensource.com",
          "author": "Nicko Guyer",
          "description": "Open source blockchain development: Get started with Hyperledger FireFly\nNicko Guyer\nTue, 09/13/2022 - 03:00\n\n            \nIt takes more than a blockchain node to build enterprise-grade applications at scale. As a result, developers often find themselves building plumbing from scratch to make their business logic work. The release of Hyperledger FireFly changed blockchain development, offering developers a full stack of tools to build and scale secure web applications using familiar APIs. FireFly’s next-gen platform simplifies development, making it easy to connect across multiple public and private chains while running many use cases simultaneously. Whether you want to build on permissioned chains like Hyperledger Fabric, Corda, or Enterprise Ethereum, or public chains like Ethereum, Poly…",
          "link": "https://opensource.com/article/22/9/blockchain-hyperledger-firefly",
          "publishedOn": "2022-09-13T07:00:00.000Z",
          "wordCount": 2067,
          "title": "Open source blockchain development: Get started with Hyperledger FireFly",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/cube_innovation_process_block_container.png"
        },
        {
          "id": "70189 at https://opensource.com",
          "author": "Vojtech Polasek",
          "description": "Remixing Linux for blind and visually impaired users\nVojtech Polasek\nTue, 09/13/2022 - 03:00\n\n            \nWhen I was around 5 years old, my father brought home our first computer. From that moment on, I knew I wanted to pursue a career in computers. I haven't stopped hanging around them since. During high school, when considering which specific area I wanted to focus on, I started experimenting with hacking, and that was the moment I decided to pursue a career as a security engineer.\nI'm now a software engineer on the security compliance team. I've been at Red Hat for over two years, and I work remotely in the Czech Republic. I've used Linux for about 12 years, mainly Arch Linux and Fedora, but I've also administered Debian, Gentoo, and Ubuntu in the past.\n  \n\n\n      \n   \nImage by: \n(Vojt…",
          "link": "https://opensource.com/article/22/9/linux-visually-impaired-users",
          "publishedOn": "2022-09-13T07:00:00.000Z",
          "wordCount": 2573,
          "title": "Remixing Linux for blind and visually impaired users",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/lightbulb_computer_person_general_.png"
        },
        {
          "id": "70193 at https://opensource.com",
          "author": "David Both",
          "description": "How I recovered my Linux system using a Live USB device\nDavid Both\nMon, 09/12/2022 - 03:00\n\n            \nI have a dozen or so physical computers in my home lab and even more VMs. I use most of these systems for testing and experimentation. I frequently write about using automation to make sysadmin tasks easier. I have also written in multiple places that I learn more from my own mistakes than I do in almost any other way.\nI have learned a lot during the last couple of weeks.\nI created a major problem for myself. Having been a sysadmin for years and written hundreds of articles and five books about Linux, I really should have known better. Then again, we all make mistakes, which is an important lesson: You're never too experienced to make a mistake.\nI'm not going to discuss the details of m…",
          "link": "https://opensource.com/article/22/9/recover-linux-system-live-usb",
          "publishedOn": "2022-09-12T07:00:00.000Z",
          "wordCount": 2182,
          "title": "How I recovered my Linux system using a Live USB device",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/markus-winkler-usb-unsplash.jpg"
        },
        {
          "id": "70168 at https://opensource.com",
          "author": "Nicolas Mengin",
          "description": "Control your home automation remotely with Raspberry Pi and Traefik Hub\nNicolas Mengin\nMon, 09/12/2022 - 03:00\n\n            \nOver the years, several friends have asked me for tips on managing their home networks. In most cases, they are setting up home automation and want to access their services from the outside.\nEvery time I helped them, each made the same comment: \"Are you kidding? It cannot be so complicated to publish one simple application!\"\nPublishing applications that don't put your network or cluster at risk can indeed be quite complicated. When we started working on Traefik Hub—the latest product by Traefik Labs—I knew it would be a game-changer for publishing applications.\nThis article demonstrates the complexity of publishing services and how Traefik Hub makes your life a lot e…",
          "link": "https://opensource.com/article/22/9/home-automation-traefik-raspberry-pi",
          "publishedOn": "2022-09-12T07:00:00.000Z",
          "wordCount": 2483,
          "title": "Control your home automation remotely with Raspberry Pi and Traefik Hub",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/house_home_colors_live_building.jpg"
        },
        {
          "id": "70191 at https://opensource.com",
          "author": "Seth Kenlon",
          "description": "5 ways to resize and optimize images for the web on Linux\nSeth Kenlon\nSat, 09/10/2022 - 03:00\n\n            \nThere was a time when 5 MB was the reasonable maximum size for an email attachment. Today, it's easily possible for a single photo to be 5 MB. Accordingly, the maximum attachment size has increased to, say, 25 MB. But of course file sizes are getting bigger and bigger too, and so eventually the attachment limit will go up too. It's an endless cycle, common in the digital world: the tools are built for today's data, and today's data increases in complexity and size until the tools are revised and improved. You have to contain data, preferably in the smallest packaging possible, so that sharing it online goes faster for everyone. Here are five ways to optimize images for the Internet.\n…",
          "link": "https://opensource.com/article/22/9/resize-optimize-images-web-linux",
          "publishedOn": "2022-09-10T07:00:00.000Z",
          "wordCount": 2323,
          "title": "5 ways to resize and optimize images for the web on Linux",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/web_browser_desktop_devlopment_design_system_computer.jpg"
        },
        {
          "id": "70188 at https://opensource.com",
          "author": "Ray Paik",
          "description": "Open source matters in data analytics: Here's why\nRay Paik\nFri, 09/09/2022 - 03:00\n\n            \nIt's been a little over a year since I wrote my article on Opensource.com, introducing the Cube community. As I worked with our community members and other vendors, I've become more convinced of the benefits of open source in data analytics. I also think it's good to remind ourselves periodically why open source matters and how it provides long-term benefits for everyone.\nBenefits of open source for users and customers\nOne of the first things I heard from the Cube community was that they often received better support in chat from other community members than they did with proprietary software and a paid support plan. Across many open source communities, I find people who are motivated to help o…",
          "link": "https://opensource.com/article/22/9/open-source-data-analytics",
          "publishedOn": "2022-09-09T07:00:00.000Z",
          "wordCount": 1324,
          "title": "Open source matters in data analytics: Here's why",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/metrics_data_dashboard_system_computer_analytics.png"
        },
        {
          "id": "70187 at https://opensource.com",
          "author": "Moshe Zadka",
          "description": "How to use modern Python packaging and setuptools plugins together\nMoshe Zadka\nThu, 09/08/2022 - 03:00\n\n            \nPython packaging has evolved a lot. The latest (\"beta\") uses one file, pyproject.toml, to control the package.\nA minimal pyproject.toml might look like this:\n[build-system]\n= [\"setuptools\"]\n= \"setuptools.build_meta\"\n[project]\n= \"cool_project\"\n= \"1.0.0\"\n\nThe project section\nThe project section is the data about the Python project itself, including fields like name and version, which are required.\nOther fields are often used, including:\ndescription: A one-line description.\nreadme: Location of a README file.\nauthors: Author names and e-mails.\ndependencies: Other packages used by this project.\nThe build-system section\nThough it does not have to be first, the build-system usually…",
          "link": "https://opensource.com/article/22/9/modern-python-packaging-setuptools-plugins",
          "publishedOn": "2022-09-08T07:00:00.000Z",
          "wordCount": 1620,
          "title": "How to use modern Python packaging and setuptools plugins together",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/coffee_python.jpg"
        },
        {
          "id": "70171 at https://opensource.com",
          "author": "Shaun McCance",
          "description": "Open source events: 4 goals to set and how to measure them\nShaun McCance\nWed, 09/07/2022 - 03:00\n\n            \nEvents are an essential component of open source community health. A positive event experience can inspire current contributors and encourage new ones. But how can you tell whether your events are successful?\nWe at the CHAOSS (Community Health Analytics Open Source Software) App Ecosystem Working Group have considered this question for our events to maintain the health of the communities involved. The CHAOSS App Ecosystem includes several projects focused on developing applications for the Linux platform. While currently dominated by the GNOME and KDE communities, it is not defined by them. The app ecosystem, as it stands today, is primarily driven by volunteers with altruistic go…",
          "link": "https://opensource.com/article/22/9/measure-success-your-open-source-event",
          "publishedOn": "2022-09-07T07:00:00.000Z",
          "wordCount": 2582,
          "title": "Open source events: 4 goals to set and how to measure them",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/team_global_people_gis_location.png"
        },
        {
          "id": "70183 at https://opensource.com",
          "author": "Ron McFarland",
          "description": "Applying open organization principles to save factory energy\nRon McFarland\nTue, 09/06/2022 - 03:00\n\n            \nThe problem with energy costs is that most people don't think about them. They just look at their overall bill without considering how the energy was used. By monitoring and measuring energy use through sensors in very specific locations, energy waste can be made transparent and reduced.\nThat's the premise of the book Reinventing Fire: Bold Business Solutions for the New Energy Era, which offers methods to eliminate the use of fossil fuels by 2050 through energy waste reduction. It's also the premise of a story I began in an earlier article about two retired utilities salespeople-turned-consultants who started an open organization community to reduce energy waste in their region…",
          "link": "https://opensource.com/open-organization/22/9/saving-factory-energy-open-organization-principles",
          "publishedOn": "2022-09-06T07:00:00.000Z",
          "wordCount": 3327,
          "title": "Applying open organization principles to save factory energy",
          "imageUrl": "https://opensource.com/sites/default/files/lead-images/devop.png"
        }
      ]
    },
    {
      "title": "The Verge -  All Posts",
      "feedUrl": "https://www.theverge.com/rss/index.xml",
      "siteUrl": "https://www.theverge.com/",
      "articles": [
        {
          "id": "https://www.theverge.com/2022/9/13/23350509/intel-13th-gen-core-i5-i7-i9-specs-leak",
          "author": null,
          "description": "Illustration by Alex Castro / The Verge\n    \n\n  \nIntel has accidentally published the specifications for its 13th Gen Raptor Lake processors. A day after confirming an upcoming 13th Gen CPU will run at 6GHz at stock, Intel published and quickly deleted specs for its Core i5-13600K, Core i7-13700K, and Core i9-13900K CPUs.\nIntel posted the specs to its Canadian website (Google cached view), and Twitter users were quick to spot them. The specs reveal that the top of the line i9 13900K will have 24 cores and 32 threads, with the performance cores running at a maximum frequency of 5.4GHz. The i7 13700K will ship with 16 cores and 24 threads, with up to 5.3GHz on the performance cores. Finally, the i5 13600K comes with 14 cores and 20 threads, and a maximum frequency of 5.1GHz on the...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/13/23350509/intel-13th-gen-core-i5-i7-i9-specs-leak",
          "publishedOn": "2022-09-13T09:18:56.000Z",
          "wordCount": 13474,
          "title": "Intel just leaked its 13th Gen processor specs",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/LcCC3WS2soMQ2gk06LjT00Rm4Kw=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/24002572/acastro_STK094_01.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/13/23350504/sony-xperia-stream-smartphone-cooling-fan-usb-hub-ethernet-hdmi-3-5mm",
          "author": null,
          "description": "The Xperia Stream clips onto the back of Sony’s smartphone. | Image: Sony\n    \n\n  \nSony has launched a smartphone cooling fan accessory that’s designed to lower the temperature of its Xperia 1 IV under intense gaming loads. The Xperia Stream also offers a selection of extra ports in addition to working as a cooling accessory. It’s available to preorder now in Japan for 23,100 yen (around $162) with shipping expected on October 14th. \nThe aim with these kinds of accessories, which have also been produced by the likes of Asus and Razer, is to let a phone’s processor run at higher speeds for longer, by preventing the kinds of high temperatures that can lead to performance throttling. Asus has the AeroActive Cooler for its gaming-focused ROG Phone lineup, while Razer recently released an RGB cooling fan that’s designed to...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/13/23350504/sony-xperia-stream-smartphone-cooling-fan-usb-hub-ethernet-hdmi-3-5mm",
          "publishedOn": "2022-09-13T08:51:02.000Z",
          "wordCount": 13853,
          "title": "Sony’s latest smartphone accessory is pretty cool",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/l3Xspp9Nom8N8c5-P3VHEAKz1gg=/0x0:1312x875/1200x628/filters:focal(656x438:657x439)/cdn.vox-cdn.com/uploads/chorus_asset/file/24018302/223GE_Accy_Medium_00_05_D.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/12/23350044/apple-iphone-ios-rapid-response-security",
          "author": null,
          "description": "But doing so obviously leaves your phone unprotected. | Photo by Amelia Holowaty Krales / The Verge\n    \n\n  \nApple will let you remove the security patches installed by iOS 16’s Rapid Security Response system, which can install patches without the need to fully update your iPhone (or even without having to restart it, in some cases). According to a support document spotted by MacRumors, you can remove a Rapid Security Response update by going to Settings > General > About, then tapping on the iOS Version. From there, you’ll be presented with a “Remove Security Update” button.\nThe document doesn’t give any examples of why you’d need to uninstall one of the patches, leaving your phone open to the vulnerability it protects against. It’s easy to imagine a few special circumstances where the feature could be useful, perhaps if one messes up some...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/12/23350044/apple-iphone-ios-rapid-response-security",
          "publishedOn": "2022-09-13T00:14:07.000Z",
          "wordCount": 14178,
          "title": "Apple will let you roll back the iPhone’s security patches",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/njRxlZ86sgSJgQZRrBbnyslkd1A=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23318438/akrales_220309_4977_0305.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/12/23350034/ea-koei-tecmo-next-great-hunting-game-monster-hunter-originals",
          "author": null,
          "description": "Concept art from EA and Koei Tecmo’s new game. | Image: EA\n    \n\n  \nEA and Koei Tecmo are partnering on a new title that they’re describing as “the next great hunting game.” When I first read that description, my thoughts jumped to Big Buck Hunter, the arcade series of hunting games where you shoot wild animals, but looking at the concept art (above), combined with who’s making it, I’m guessing this game will actually be much more like Capcom’s popular Monster Hunter series.\nIn a press release, EA and Koei Tecmo describe this new game as an original IP that “delivers a truly AAA experience based in fantasy feudal Japan.” It will be developed by Koei Tecmo’s Omega Force, which is known for the Dynasty Warriors and Samurai Warriors “musou” action games. And a statement from an EA exec Jeff Gamon says Omega...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/12/23350034/ea-koei-tecmo-next-great-hunting-game-monster-hunter-originals",
          "publishedOn": "2022-09-13T00:02:21.000Z",
          "wordCount": 14280,
          "title": "EA and Koei Tecmo are partnering on ‘the next great hunting game’",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/A37Jar9FXnLLn0tGKeutkogKi5Q=/0x0:4096x1851/1200x628/filters:focal(2048x926:2049x927)/cdn.vox-cdn.com/uploads/chorus_asset/file/24017662/conceptart_EMBARGO_SEPT_12_3PM_PST___11PM_GMT_UK.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/12/23349971/nissan-leaf-bidirectional-charging-approved-v2h-v2g-fermata-energy",
          "author": null,
          "description": "Fermata Energy’s FE-15 bi-directional charger in a commercial use case. | Image: Nissan\n    \n\n  \nNissan has approved the first bidirectional charging system for use with its all-electric Leaf vehicle in the US. The FE-15 charger by Fermata Energy, which can power homes using the EV’s battery, charge it, and send stored energy back to the grid, is the first system of its kind to earn UL 9741 certification for bidirectional charging solutions.\nBack in 2012, Nissan promised its maybe soon-to-be-discontinued EV would eventually share its stored battery power back to your home or the grid during peak hours or even in emergencies. This technology is broadly known as Vehicle-to-Grid (V2G), Vehicle-to-Home (V2H), and Vehicle-to-Load (V2L), which all can be used interchangeably to describe a system that converts EVs to a backup power...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/12/23349971/nissan-leaf-bidirectional-charging-approved-v2h-v2g-fermata-energy",
          "publishedOn": "2022-09-12T22:56:22.000Z",
          "wordCount": 14813,
          "title": "The Nissan Leaf can now officially power homes using bidirectional charging",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/kq3ZC2IXNQc7XpDPlOiQPIFm7u0=/0x0:927x605/1200x628/filters:focal(464x303:465x304)/cdn.vox-cdn.com/uploads/chorus_asset/file/24017514/preview_928x522.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/12/23349810/samsung-odyssey-ark-monitor-available-sale-best-buy",
          "author": null,
          "description": "Photo by Cameron Faulkner / The Verge\n    \n\n  \nSamsung’s behemoth Odyssey Ark, a $3,500 55-inch curved gaming monitor, is going on sale today after a few weeks of being available for preorders. And — somewhat shockingly, given how gaming launches have gone in the past few years — you may actually be able to just walk into a store and buy one. Checking stock at our local Best Buys, several Verge staff members found that stores had one or two models available for pickup today. \nTo be clear, I’m not saying that you should casually spend a month or two’s rent on a mini LED gaming monitor that’s the size of a decent TV. In fact, it feels a little bit wrong that it could even be that easy — there have been nine months of hype building around the Odyssey Ark since its CES 2022 debut, and...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/12/23349810/samsung-odyssey-ark-monitor-available-sale-best-buy",
          "publishedOn": "2022-09-12T22:33:09.000Z",
          "wordCount": 14884,
          "title": "No one can stop you from spending $3,500 on a Samsung Odyssey Ark",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/1szIvNkkCl_RDCr7EcStkUw-4uk=/0x0:2040x1360/1200x628/filters:focal(1105x414:1106x415)/cdn.vox-cdn.com/uploads/chorus_asset/file/23940761/cfaulkner_220804_226108_0001.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/12/23349952/sony-playstation-state-of-play-event-showcase-same-day-nintendo-direct",
          "author": null,
          "description": "The next State of Play is happening soon. | Photo by Vjeran Pavic / The Verge\n    \n\n  \nSony just announced that it will be hosting a PlayStation State of Play video presentation on Tuesday at 6PM ET. The show will be about 20 minutes long and cover games coming to PS5, PS4, and PSVR2.\nThe presentation is taking place ahead of Tokyo Game Show, which kicks off later this week. This State of Play will feature “some great updates from our amazing Japanese partners, along with a few other surprises from developers all around the world,” Sony Interactive Entertainment’s Sid Shuman said in a blog post. \nTuesday promises to be a big day for video game news, as Nintendo’s next big Direct event will be taking place just a few hours earlier at 10AM ET, and Sony acknowledged the situation in a tweet replying to Nintendo’s Direct...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/12/23349952/sony-playstation-state-of-play-event-showcase-same-day-nintendo-direct",
          "publishedOn": "2022-09-12T22:23:26.000Z",
          "wordCount": 13677,
          "title": "PlayStation is hosting a State of Play on the same day as Nintendo’s Direct",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/bzPXSkptg2uE3JUVBy9jmLDKI8w=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/22015304/vpavic_4278_20201030_0247.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/12/23349699/cruise-av-robotaxi-phoenix-austin-gm",
          "author": null,
          "description": "A robot car of the General Motors subsidiary Cruise is on a test drive. | Photo by Andrej Sokolow / picture alliance via Getty Images\n    \n\n  \nCruise, the autonomous vehicle company owned by General Motors, will launch a robotaxi service in Phoenix, Arizona, and Austin, Texas, before the end of 2022, the company’s CEO said today. \nThe company currently operates a ride-hailing service in only one city, San Francisco, where it received permission to begin charging customers for rides earlier this year. That service took years to scale up; Cruise now says it can do the same in two new cities in 90 days. \nThe company has done autonomous testing in Phoenix through a delivery partnership with Walmart. But it has yet to deploy any vehicles in Austin, which Cruise CEO Kyle Vogt said was unprecedented. \n“This is something people thought may take years”\n“In Austin, what I’m really...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/12/23349699/cruise-av-robotaxi-phoenix-austin-gm",
          "publishedOn": "2022-09-12T22:17:10.000Z",
          "wordCount": 14715,
          "title": "Cruise will launch robotaxi services in Phoenix and Austin by the end of the year",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/T4UwPTcxfRrIoOGGPQpGpOOkzDI=/0x0:2559x1664/1200x628/filters:focal(1280x832:1281x833)/cdn.vox-cdn.com/uploads/chorus_asset/file/24016919/1189070708.jpg"
        },
        {
          "id": "https://www.theverge.com/2022/9/12/23349809/peloton-john-foley-co-founder-former-ceo-leaving-company-resign",
          "author": null,
          "description": "Photo by Kimberly White / Getty Images for TechCrunch\n    \n\n  \nPeloton co-founder and former CEO John Foley has resigned as executive chairman of the board, marking the latest big shakeup at the connected fitness company (via The Wall Street Journal). \nThings have been quite turbulent as of late for Peloton. Despite selling products and classes that are widely beloved, the company has had to cut jobs and adjust prices (both decreases and, months later, increases) this year after overextending to meet increased demand during the early part of the pandemic. In its Q4 2022 earnings report in August, the company reported a $1.2 billion operating loss, though current CEO Barry McCarthy positioned its earnings as a sign of “substantial progress.”\nFoley, who was Peloton’s CEO for almost 10 years, stepped...\nContinue reading…",
          "link": "https://www.theverge.com/2022/9/12/23349809/peloton-john-foley-co-founder-former-ceo-leaving-company-resign",
          "publishedOn": "2022-09-12T22:01:22.000Z",
          "wordCount": 14813,
          "title": "Peloton’s co-founder and former CEO rides into the sunset",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/qcVA7XNpckmFWZmjo3QVy-xWH0k=/0x0:5232x3488/1200x628/filters:focal(2616x1744:2617x1745)/cdn.vox-cdn.com/uploads/chorus_asset/file/24017450/1027941602.jpg"
        },
        {
          "id": "https://www.theverge.com/21280354/best-ipad-deals-apple",
          "author": null,
          "description": "Select iPad models go on sale quite regularly. | Photo by Vjeran Pavic / The Verge\n    \n\n  \nWhile some of the best iPad deals typically occur around Black Friday and Cyber Monday, you can still find plenty of great discounts at all times of the year if you know where to look. Whether you’re after the high-end iPad Pro or the most affordable entry-level iPad, there’s likely a sale going on somewhere you may be interested in.\nOf course, it’s difficult to know exactly where you can find the most notable deals unless you’re scouring the major retailers on a daily basis. But that’s often what our deal hunters at The Verge are doing each and every day, so let us help you out. Below, we’ve listed the best deals you can get on each iPad model that is currently available, including the latest ones equipped with Apple’s powerful M1 chip.\nContinue reading…",
          "link": "https://www.theverge.com/21280354/best-ipad-deals-apple",
          "publishedOn": "2022-09-12T21:36:43.000Z",
          "wordCount": 17101,
          "title": "Here are the best iPad deals right now",
          "imageUrl": "https://cdn.vox-cdn.com/thumbor/yAV1aZujt9-baq3c8uSq4UXCXo8=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/21975641/vpavic_4244_20201020_0013.jpg"
        }
      ]
    },
    {
      "title": "Ars Technica",
      "feedUrl": "https://arstechnica.com/feed/",
      "siteUrl": "https://arstechnica.com",
      "articles": [
        {
          "id": "https://arstechnica.com/?p=1880622",
          "author": "Ron Amadeo",
          "description": "Google hasn't made a laptop in 3 years, and won't be making one anytime soon.",
          "link": "https://arstechnica.com/?p=1880622",
          "publishedOn": "2022-09-12T22:07:15.000Z",
          "wordCount": 1529,
          "title": "Google’s cost-cutting kills Pixelbook division",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/pixelbookgo11-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880695",
          "author": "Kyle Orland",
          "description": "\"We'll see if [NFT]s really answer the players' needs,\" CEO says.",
          "link": "https://arstechnica.com/?p=1880695",
          "publishedOn": "2022-09-12T21:47:11.000Z",
          "wordCount": 1733,
          "title": "Ubisoft is pretending it was never really that interested in NFTs",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2021/12/ubisoft-nft-headache-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880604",
          "author": "Benj Edwards",
          "description": "PyTorch, which powers Tesla Autopilot and 150K other projects, will join the Linux Foundation.",
          "link": "https://arstechnica.com/?p=1880604",
          "publishedOn": "2022-09-12T21:33:28.000Z",
          "wordCount": 1414,
          "title": "Meta spins off PyTorch Foundation to make AI framework vendor neutral",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/pythorch_hero_1-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880637",
          "author": "Andrew Cunningham",
          "description": "Apple's past and present OSes are all getting updates today.",
          "link": "https://arstechnica.com/?p=1880637",
          "publishedOn": "2022-09-12T20:45:55.000Z",
          "wordCount": 1503,
          "title": "Apple releases iOS 15.7 for old devices and people who don’t want iOS 16 yet",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/iOS-15-760x380.png"
        },
        {
          "id": "https://arstechnica.com/?p=1880536",
          "author": "Sam Machkovech",
          "description": "Retailer leak suggests games from arcade to Jaguar; surprises apparently still await.",
          "link": "https://arstechnica.com/?p=1880536",
          "publishedOn": "2022-09-12T20:38:25.000Z",
          "wordCount": 1860,
          "title": "The 103 classic games that did, and didn’t, make the Atari 50 anniversary cut",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/atari-50-760x380.png"
        },
        {
          "id": "https://arstechnica.com/?p=1880588",
          "author": "Andrew Cunningham",
          "description": "Raptor Lake boosts clocks, cache, and core counts on the same Intel 7 process.",
          "link": "https://arstechnica.com/?p=1880588",
          "publishedOn": "2022-09-12T20:01:12.000Z",
          "wordCount": 1684,
          "title": "The clock speed wars are back as Intel brags about hitting 6 GHz with 13th-gen CPUs",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/intel-core-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880593",
          "author": "Jonathan M. Gitlin",
          "description": "Science needs sustainable, boring growth, but we just get flashy ill-formed initiatives.",
          "link": "https://arstechnica.com/?p=1880593",
          "publishedOn": "2022-09-12T18:45:03.000Z",
          "wordCount": 1593,
          "title": "Dear Mr. President: Seriously, please stop with these science “moonshots”",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/presidential-moonshots-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880509",
          "author": "Scharon Harding",
          "description": "Roku OS 11.5 with \"Continue Watching\" also en route.",
          "link": "https://arstechnica.com/?p=1880509",
          "publishedOn": "2022-09-12T18:10:44.000Z",
          "wordCount": 1715,
          "title": "Roku announces a cheaper subwoofer, updates $30 Express streaming device",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/66237085-03f1-4779-a089-1f96736bc774-760x380.png"
        },
        {
          "id": "https://arstechnica.com/?p=1880381",
          "author": "Andrew Cunningham",
          "description": "Intel's lineup will likely be competing with new GPUs from AMD and Nvidia soon.",
          "link": "https://arstechnica.com/?p=1880381",
          "publishedOn": "2022-09-12T17:52:36.000Z",
          "wordCount": 1832,
          "title": "Intel publishes Arc GPU specifications as their launch creeps ever-nearer",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/arc-gpus-2-2-760x380.jpeg"
        },
        {
          "id": "https://arstechnica.com/?p=1880488",
          "author": "Jon Brodkin",
          "description": "Starlink says speed tests and $600 dish cost aren't good reasons to deny funding.",
          "link": "https://arstechnica.com/?p=1880488",
          "publishedOn": "2022-09-12T17:25:22.000Z",
          "wordCount": 1593,
          "title": "Starlink appeals FCC rejection of $886M grant, calls reversal “grossly unfair”",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/getty-starlink-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880382",
          "author": "Ars Staff",
          "description": "The vehicles it showed off at Monterey Car Week were far from production-ready",
          "link": "https://arstechnica.com/?p=1880382",
          "publishedOn": "2022-09-12T17:18:44.000Z",
          "wordCount": 1785,
          "title": "Remember Faraday Future? We rode in its new EV, and it wasn’t great",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/Faraday-V03-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880438",
          "author": "Kevin Purdy",
          "description": "It's the first time genuine iPhone batteries have cost more than $70 since 2017.",
          "link": "https://arstechnica.com/?p=1880438",
          "publishedOn": "2022-09-12T17:11:34.000Z",
          "wordCount": 1375,
          "title": "Apple raises iPhone 14 battery costs above pre-Batterygate levels",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/iphone_13_battery-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880442",
          "author": "Ron Amadeo",
          "description": "Plus: Wild rumors say the phone might launch before the end of the year.",
          "link": "https://arstechnica.com/?p=1880442",
          "publishedOn": "2022-09-12T16:47:19.000Z",
          "wordCount": 1449,
          "title": "Get your first look at the OnePlus 11 Pro and its round camera bump",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/5-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880346",
          "author": "Benj Edwards",
          "description": "Smaller art communities are banning image synthesis amid a wider art ethics debate.",
          "link": "https://arstechnica.com/?p=1880346",
          "publishedOn": "2022-09-12T16:36:10.000Z",
          "wordCount": 1823,
          "title": "Flooded with AI-generated images, some art communities ban them completely",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/stable_diffusion_on_lexica-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880383",
          "author": "Eric Berger",
          "description": "There were no passengers on board this flight carrying scientific instruments.",
          "link": "https://arstechnica.com/?p=1880383",
          "publishedOn": "2022-09-12T15:39:52.000Z",
          "wordCount": 1606,
          "title": "After Blue Origin’s rocket explodes, its spacecraft makes a dramatic escape",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/LIVE-Blue-Origin-New-Shepard-23-Cargo-Launch-1-23-0-screenshot-760x380.png"
        },
        {
          "id": "https://arstechnica.com/?p=1880419",
          "author": "Financial Times",
          "description": "Streaming giant will launch three new mobile games next year based on Ubisoft hits.",
          "link": "https://arstechnica.com/?p=1880419",
          "publishedOn": "2022-09-12T15:14:25.000Z",
          "wordCount": 1623,
          "title": "Netflix partners with Ubisoft to bolster fledgling gaming division",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/valiant-hearts-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1866485",
          "author": "Ars Contributors",
          "description": "The Carte du Ciel provided signposts for how future astronomical discoveries would be made.",
          "link": "https://arstechnica.com/?p=1866485",
          "publishedOn": "2022-09-12T11:00:50.000Z",
          "wordCount": 1813,
          "title": "How an enormous project attempted to map the sky without computers",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/08/GettyImages-90732326-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880298",
          "author": "Jennifer Ouellette",
          "description": "Also: trailer for Werewolf by Night, new footage from Loki S2, The Marvels, and more.",
          "link": "https://arstechnica.com/?p=1880298",
          "publishedOn": "2022-09-12T07:00:41.000Z",
          "wordCount": 1649,
          "title": "Nick Fury takes the spotlight in first trailer for Secret Invasion",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/furyTOP-760x380.jpg"
        },
        {
          "id": "https://arstechnica.com/?p=1880284",
          "author": "Eric Berger",
          "description": "Seasonal activity is running 50 percent below normal levels.",
          "link": "https://arstechnica.com/?p=1880284",
          "publishedOn": "2022-09-11T14:01:45.000Z",
          "wordCount": 1855,
          "title": "This should be the absolute peak of hurricane season—but it’s dead quiet out there",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/AtlanticCampfire-760x380.png"
        },
        {
          "id": "https://arstechnica.com/?p=1880204",
          "author": "Jeff Dunn",
          "description": "Dealmaster also includes the AirPods Max, Disney+, and HyperX gaming headsets.",
          "link": "https://arstechnica.com/?p=1880204",
          "publishedOn": "2022-09-11T13:27:08.000Z",
          "wordCount": 2620,
          "title": "Today’s best deals: HBO Max subscriptions, Apple iPads, and more",
          "imageUrl": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/dealmaster091022-760x380.jpg"
        }
      ]
    },
    {
      "title": "Business Latest",
      "feedUrl": "https://www.wired.com/feed/category/business/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "631b9e5a40fe1e8870aa3a2f",
          "author": "Adrienne So",
          "description": "The Pacific Northwest is due for a massive quake. I trained to help rescue efforts in the aftermath—by racing around the city on an electric kid hauler.",
          "link": "https://www.wired.com/story/when-the-big-one-hits-portland-cargo-bikers-will-save-you/",
          "publishedOn": "2022-09-13T10:00:00.000Z",
          "wordCount": 33181,
          "title": "When the Big One Hits Portland, Cargo Bikers Will Save You",
          "imageUrl": "https://media.wired.com/photos/631f95dbf1e5c40d2b1bc63d/191:100/w_1280,c_limit/bikeprep-topart.jpg"
        },
        {
          "id": "631f59fc40fe1e8870aa3a70",
          "author": "Morgan Meaker",
          "description": "In France, the gig economy platform welcomed thousands of immigrants during the pandemic, unions say. Now it’s deactivating them en masse.",
          "link": "https://www.wired.com/story/uber-eats-paris-protests/",
          "publishedOn": "2022-09-12T16:16:34.000Z",
          "wordCount": 20187,
          "title": "Undocumented Workers Protest Uber Eats Crackdown",
          "imageUrl": "https://media.wired.com/photos/631f59fb36c33c0247a2f06e/191:100/w_1280,c_limit/Paris-Uber-Eats-Undocumented-Workers-Business-1211132636.jpg"
        },
        {
          "id": "6315e68a44c07c3774c4cba0",
          "author": "Khari Johnson",
          "description": "The US regulator is eager to end unfair use of artificial intelligence and commercial surveillance, but experts remain skeptical.",
          "link": "https://www.wired.com/story/ftc-ai-regulation/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 20932,
          "title": "The FTC Is Closing in on Runaway AI",
          "imageUrl": "https://media.wired.com/photos/631a70b320bc56769c413043/191:100/w_1280,c_limit/business-ftc-ai.jpg"
        },
        {
          "id": "631a3a6cc9bb1af7ef2496bd",
          "author": "Steven Levy",
          "description": "Plus: Reminiscing on Steve Jobs, a question for his loved ones, and a meltdown on the West Coast.",
          "link": "https://www.wired.com/story/plaintext-silicon-valley-evil-twin-tiktok/",
          "publishedOn": "2022-09-09T13:00:00.000Z",
          "wordCount": 23393,
          "title": "Silicon Valley Is Obsessed With Its Evil Twin, TikTok",
          "imageUrl": "https://media.wired.com/photos/631a647720bc56769c41302d/191:100/w_1280,c_limit/Silicon-Valley-Obsessed-With-Evil-Twin-Business-1421429054.jpg"
        },
        {
          "id": "631a0c94f1e5c40d2b1bc5f1",
          "author": "Caitlin Harrington",
          "description": "The tech giants' corporate offices across the US  drew demonstrations over an Israeli government cloud contract that opponents say could have military uses.",
          "link": "https://www.wired.com/story/google-and-amazon-want-more-defense-contracts-despite-worker-protests/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 20992,
          "title": "Google and Amazon Seek Defense Contracts, Despite Worker Protests",
          "imageUrl": "https://media.wired.com/photos/631a83e08990652479ff37e5/191:100/w_1280,c_limit/Google-Project-Nimbus-Tech-Worker-Protests-Business-1394579808.jpg"
        },
        {
          "id": "63193523c9bb1af7ef2496bc",
          "author": "Beth Mole, Ars Technica",
          "description": "The once dominant ecigarette company faces more legal challenges and FDA scrutiny after a probe into whether it deceptively marketed to children and teens.",
          "link": "https://www.wired.com/story/juul-teen-vaping-438-million-dollar-settlement/",
          "publishedOn": "2022-09-08T21:45:00.000Z",
          "wordCount": 18795,
          "title": "Juul Will Pay $438.5M for Its Role in Underage Vaping",
          "imageUrl": "https://media.wired.com/photos/631a3aa862435d269fdbda8d/191:100/w_1280,c_limit/Juul-Settles-Youth-Vaping-Probe-Business-1182904739.jpg"
        },
        {
          "id": "631a289b36c33c0247a2f013",
          "author": "Chris Stokel-Walker",
          "description": "The UK's tech-savvy head of state was queen of a thousand memes.",
          "link": "https://www.wired.com/story/how-the-internet-will-remember-the-queen/",
          "publishedOn": "2022-09-08T17:42:34.000Z",
          "wordCount": 20834,
          "title": "Queen Elizabeth II Has Died. Her Internet Legacy Will Live On",
          "imageUrl": "https://media.wired.com/photos/631a289bc4d3ebc9237bc51f/191:100/w_1280,c_limit/QueenEliz_culture_GettyImages-1401936511.jpg"
        },
        {
          "id": "630e5fc38eb3383ad69a2480",
          "author": "Anthony Lydgate",
          "description": "Balaji Srinivasan—technologist, investor, prophet, troll—says let the old world sink. Find your tribe and build your bespoke society, or get left behind.",
          "link": "https://www.wired.com/story/balaji-srinivasan-ditch-chaos-country-cloud/",
          "publishedOn": "2022-09-06T10:00:00.000Z",
          "wordCount": 51112,
          "title": "Would You Ditch All This Chaos for a Country in the Cloud?",
          "imageUrl": "https://media.wired.com/photos/630e61933dfe1372fb611109/191:100/w_1280,c_limit/WI100122_FF_Sovereign_01.jpg"
        },
        {
          "id": "630f873cd24d6c0f1431f888",
          "author": "Arielle Pardes",
          "description": "Startup incubator Y Combinator birthed big names like Airbnb and Stripe. Incoming CEO Garry Tan says he’ll tap the program’s alumni network to generate new tech giants.",
          "link": "https://www.wired.com/story/silicon-valleys-most-powerful-mafia-gets-a-new-boss/",
          "publishedOn": "2022-09-02T11:00:00.000Z",
          "wordCount": 19633,
          "title": "Silicon Valley’s Most Powerful ‘Mafia’ Gets a New Boss",
          "imageUrl": "https://media.wired.com/photos/63111628f64c675d6d1a5121/191:100/w_1280,c_limit/Garry-Tan-YCombinator-Business-R0MKB3.jpg"
        },
        {
          "id": "63111ad53dfe1372fb611160",
          "author": "Lauren Goode",
          "description": "Some people have ditched dating apps—and opted to bare their souls via a public, view-only link instead.",
          "link": "https://www.wired.com/story/date-me-google-docs-and-the-hyper-optimized-quest-for-love/",
          "publishedOn": "2022-09-02T11:00:00.000Z",
          "wordCount": 21304,
          "title": "‘Date Me’ Google Docs and the Hyper-Optimized Quest for Love",
          "imageUrl": "https://media.wired.com/photos/631138719942353dc81f1536/191:100/w_1280,c_limit/Online-Dating-With-Google-Docs-Business-1358995285.jpg"
        },
        {
          "id": "6310e4b9f89e2120665181e8",
          "author": "Aarian Marshall",
          "description": "After two people were injured in the incident, Cruise blocked its robot vehicles from making left turns for several weeks before issuing a software update.",
          "link": "https://www.wired.com/story/gms-cruise-recalls-self-driving-software-involved-in-june-crash/",
          "publishedOn": "2022-09-01T19:34:38.000Z",
          "wordCount": 19046,
          "title": "GM's Cruise Recalls Self-Driving Software Involved in June Crash",
          "imageUrl": "https://media.wired.com/photos/6310e7d2567860ab6c66c66b/191:100/w_1280,c_limit/Cruise-Software-Government-Recall-Business-1238159557.jpg"
        },
        {
          "id": "6310a98d7ec0340e25e8b864",
          "author": "Chris Stokel-Walker",
          "description": "You’ll have 30 minutes to alter your tweets—but only if you subscribe to Twitter Blue.",
          "link": "https://www.wired.com/story/twitter-edit-button-finally/",
          "publishedOn": "2022-09-01T13:00:00.000Z",
          "wordCount": 20540,
          "title": "Twitter Finally Gets an Edit Button",
          "imageUrl": "https://media.wired.com/photos/6310a98df89e2120665181e4/191:100/w_1280,c_limit/Twitter-Gets-An-Edit-Button-Business-495787313.jpg"
        },
        {
          "id": "630506f9cea7c0581e825d21",
          "author": "Khari Johnson",
          "description": "The academic search engine’s policy on name changes is out of step with other search tools and publishers.",
          "link": "https://www.wired.com/story/trans-researchers-want-google-scholar-to-stop-deadnaming-them/",
          "publishedOn": "2022-09-01T11:00:00.000Z",
          "wordCount": 24083,
          "title": "Trans Researchers Want Google Scholar to Stop Deadnaming Them",
          "imageUrl": "https://media.wired.com/photos/630fe159567860ab6c66c667/191:100/w_1280,c_limit/business-deadnames-google.jpg"
        },
        {
          "id": "630ea52f333af8e1504c49a0",
          "author": "Caitlin Harrington",
          "description": "Ariel Koren and fellow Googlers feared the company’s technology could be used against Palestinians. She says pressure from managers forced her to resign.",
          "link": "https://www.wired.com/story/inside-google-worker-protests-of-an-israeli-government-cloud-deal/",
          "publishedOn": "2022-08-31T22:22:18.000Z",
          "wordCount": 19696,
          "title": "Behind Google Worker Protests of an Israeli Government Cloud Deal",
          "imageUrl": "https://media.wired.com/photos/630eaff0567860ab6c66c662/191:100/w_1280,c_limit/Ariel-Koren-Project-Nimbus-Q&A-Business-1359325770.jpg"
        },
        {
          "id": "630913da5d32e4cad34d6eab",
          "author": "Caitlin Harrington",
          "description": "Federal regulators and the White House have been scrambling to prevent poor service and a possible strike from jamming up a vital but often overlooked network.",
          "link": "https://www.wired.com/story/a-us-freight-rail-crisis-threatens-more-supply-chain-chaos/",
          "publishedOn": "2022-08-30T14:00:00.000Z",
          "wordCount": 25140,
          "title": "A US Freight Rail Crisis Threatens More Supply-Chain Chaos",
          "imageUrl": "https://media.wired.com/photos/630d3fff567860ab6c66c658/191:100/w_1280,c_limit/Americas-Crumbling-Railroads-Business-Alamy-2G37YC5.jpg"
        },
        {
          "id": "6308f91f52512a466ff8f663",
          "author": "Aarian Marshall",
          "description": "GM president Mark Reuss talks with WIRED about how to sell EVs, his optimism for robot cars, and why the company shifted more of its supply chain back to the US.",
          "link": "https://www.wired.com/story/gms-president-on-the-automobiles-electric-autonomous-future/",
          "publishedOn": "2022-08-29T11:00:00.000Z",
          "wordCount": 21401,
          "title": "Driving Toward the Automobile’s Electric, Autonomous Future",
          "imageUrl": "https://media.wired.com/photos/630917a75d32e4cad34d6eae/191:100/w_1280,c_limit/GM_QA_Biz_GettyImages-1149495841-(2).jpg"
        },
        {
          "id": "63078d9a52512a466ff8f65e",
          "author": "Steven Levy",
          "description": "Plus: Decades-old security flaws, a wave of startup layoffs, and multiple “thousand-year” rainfalls.",
          "link": "https://www.wired.com/story/plaintext-twitter-meta-whistleblowing-big-tech/",
          "publishedOn": "2022-08-26T13:00:00.000Z",
          "wordCount": 24961,
          "title": "Twitter, Meta, and Blowing the Whistle on Big Tech",
          "imageUrl": "https://media.wired.com/photos/6307d0ad7ec0340e25e8b7a2/191:100/w_1280,c_limit/Peiter-Zatko-Twitter-Whistleblower-Business-1242680559.jpg"
        },
        {
          "id": "6307fb7f8eb3383ad69a23a4",
          "author": "Chris Stokel-Walker",
          "description": "The region’s unified approach to energy predates Russia’s invasion of Ukraine, but countries suffering from shortages may now have to watch gas flow past.",
          "link": "https://www.wired.com/story/europe-set-perfect-conditions-for-energy-crisis/",
          "publishedOn": "2022-08-26T11:00:00.000Z",
          "wordCount": 20410,
          "title": "Europe Set Itself Up for This Energy Crisis",
          "imageUrl": "https://media.wired.com/photos/6307fb7e9fbbe8d3536bf95a/191:100/w_1280,c_limit/Europe-Energy-Crisis-Nord-Stream-Business-1239100686.jpg"
        },
        {
          "id": "6304d638cea7c0581e825d20",
          "author": "Vittoria Elliott",
          "description": "Images have identified 21 facilities that are forcibly detaining thousands of Ukrainians, as well as possible mass grave sites.",
          "link": "https://www.wired.com/story/satellites-show-the-alarming-extent-of-russian-detention-camps/",
          "publishedOn": "2022-08-25T18:00:00.000Z",
          "wordCount": 18790,
          "title": "Satellites Show the Alarming Extent of Russian Detention Camps",
          "imageUrl": "https://media.wired.com/photos/6306b129a9141144fee1853f/191:100/w_1280,c_limit/Russian-Filtration-Camps-Ukraine-Business-1240414662.jpg"
        },
        {
          "id": "630561ab35e945940dec1d1d",
          "author": "Aarian Marshall",
          "description": "Tax credits in the Inflation Reduction Act could incentivize US business owners—beyond big companies like Amazon and Walmart—to buy zero-emission EVs.",
          "link": "https://www.wired.com/story/the-climate-bill-is-poised-to-electrify-delivery-vans-and-trucks/",
          "publishedOn": "2022-08-25T12:00:00.000Z",
          "wordCount": 20668,
          "title": "The Climate Bill Will Electrify More Delivery Vans and Trucks",
          "imageUrl": "https://media.wired.com/photos/6306c1de615ae0acf2549449/191:100/w_1280,c_limit/Climate-Bill-Will-Electrify-Delivery-Vans-Business-Alamy-2JJ04FX.jpg"
        }
      ]
    },
    {
      "title": "Feed: Artificial Intelligence Latest",
      "feedUrl": "https://www.wired.com/feed/tag/ai/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "6315e68a44c07c3774c4cba0",
          "author": "Khari Johnson",
          "description": "The US regulator is eager to end unfair use of artificial intelligence and commercial surveillance, but experts remain skeptical.",
          "link": "https://www.wired.com/story/ftc-ai-regulation/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 20932,
          "title": "The FTC Is Closing in on Runaway AI",
          "imageUrl": "https://media.wired.com/photos/631a70b320bc56769c413043/191:100/w_1280,c_limit/business-ftc-ai.jpg"
        },
        {
          "id": "631134165d32e4cad34d6f3b",
          "author": "Amit Katwala",
          "description": "The Alphabet-backed AI firm is using virtual games to help its digital creations move more like humans.",
          "link": "https://www.wired.com/story/alphabet-deepmind-ai-humanoids-soccer-camp/",
          "publishedOn": "2022-09-02T11:00:00.000Z",
          "wordCount": 20785,
          "title": "Why DeepMind Is Sending AI Humanoids to Soccer Camp",
          "imageUrl": "https://media.wired.com/photos/631134163dfe1372fb611162/191:100/w_1280,c_limit/soccer_HZ_science_GettyImages-520264154.jpg"
        },
        {
          "id": "630506f9cea7c0581e825d21",
          "author": "Khari Johnson",
          "description": "The academic search engine’s policy on name changes is out of step with other search tools and publishers.",
          "link": "https://www.wired.com/story/trans-researchers-want-google-scholar-to-stop-deadnaming-them/",
          "publishedOn": "2022-09-01T11:00:00.000Z",
          "wordCount": 24083,
          "title": "Trans Researchers Want Google Scholar to Stop Deadnaming Them",
          "imageUrl": "https://media.wired.com/photos/630fe159567860ab6c66c667/191:100/w_1280,c_limit/business-deadnames-google.jpg"
        },
        {
          "id": "63042bb3b365e23d4dea581a",
          "author": "Nicole Kobie",
          "description": "The AI-powered online doctor app is ditching its controversial NHS contracts as it focuses on the US market.",
          "link": "https://www.wired.com/story/babylon-disrupted-uk-health-system-then-left/",
          "publishedOn": "2022-08-23T11:00:00.000Z",
          "wordCount": 23190,
          "title": "Babylon Disrupted the UK’s Health System. Then It Left",
          "imageUrl": "https://media.wired.com/photos/63042ca2f06d7dee6f53bbc6/191:100/w_1280,c_limit/Babylon-Leaves-NHS-Business-1253255825.jpg"
        },
        {
          "id": "63000f0a7072d2c1f58788fa",
          "author": "Varsha Bansal",
          "description": "Police in India's capital say they only require an 80 percent accuracy rate for matches, raising new alarm bells for civil liberty advocates.",
          "link": "https://www.wired.com/story/delhi-police-facial-recognition/",
          "publishedOn": "2022-08-21T11:00:00.000Z",
          "wordCount": 19050,
          "title": "The Low Threshold for Face Recognition in New Delhi",
          "imageUrl": "https://media.wired.com/photos/63000f0affbf585589d594df/191:100/w_1280,c_limit/Delhi-Police-Facial-Recognition-Security-GettyImages-1237447046.jpg"
        },
        {
          "id": "62fe7c6d7072d2c1f58788c9",
          "author": "Will Knight",
          "description": "A new generation of AI image tools can reproduce an artist’s signature style. Some creatives fear for their livelihoods.",
          "link": "https://www.wired.com/story/artists-rage-against-machines-that-mimic-their-work/",
          "publishedOn": "2022-08-19T11:00:00.000Z",
          "wordCount": 20835,
          "title": "Algorithms Can Now Mimic Any Artist. Some Artists Hate It",
          "imageUrl": "https://media.wired.com/photos/62feb07c4a65cec78f4b4dab/191:100/w_1280,c_limit/AI-Art-Legal-Issues-Business.jpg"
        },
        {
          "id": "62fd21cd2af3e19bf28d487e",
          "author": "Khari Johnson",
          "description": "Algorithms can amplify patterns of discrimination. Robotics researchers are calling for new ways to prevent mechanical bodies acting out those biases.",
          "link": "https://www.wired.com/story/how-to-stop-robots-becoming-racist/",
          "publishedOn": "2022-08-18T14:00:00.000Z",
          "wordCount": 23989,
          "title": "How to Stop Robots From Becoming Racist",
          "imageUrl": "https://media.wired.com/photos/62fd57104a65cec78f4b4da7/191:100/w_1280,c_limit/business-racist-ai.jpg"
        },
        {
          "id": "62fa74483787a50a7ae8c95e",
          "author": "Will Knight",
          "description": "The machine learning technique that taught notorious text generator GPT-3 to write can also help robots make sense of spoken commands.",
          "link": "https://www.wired.com/story/google-robot-learned-to-take-orders-by-scraping-the-web/",
          "publishedOn": "2022-08-16T14:00:00.000Z",
          "wordCount": 20676,
          "title": "Google’s New Robot Learned to Take Orders by Scraping the Web",
          "imageUrl": "https://media.wired.com/photos/62fae4897e7512dc132d18dd/191:100/w_1280,c_limit/PaLM-SayCan-Robot-Still-Business.jpg"
        }
      ]
    },
    {
      "title": "Gear Latest",
      "feedUrl": "https://www.wired.com/feed/category/gear/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "631a4ea4d884b4dcc9416479",
          "author": "Brenda Stolyar, Adrienne So",
          "description": "The latest software for your Apple Watch is here, complete with fresh faces, sleep stages, and low-power mode.",
          "link": "https://www.wired.com/story/apple-watchos-9-new-features/",
          "publishedOn": "2022-09-12T18:00:31.000Z",
          "wordCount": 24566,
          "title": "The Top New Features in Apple’s WatchOS 9",
          "imageUrl": "https://media.wired.com/photos/631f5e52f1e5c40d2b1bc630/191:100/w_1280,c_limit/TA_Power-and-Elevation-Workout-View-SOURCE_-APPLE.jpg"
        },
        {
          "id": "629e135a83c980195cb99f16",
          "author": "Julian Chokkattu, Brenda Stolyar",
          "description": "The latest iPhone update is now available for download, complete with a revamped lock screen, editable Messages, and more.",
          "link": "https://www.wired.com/story/apple-iphone-ios-16-ipados-16-new-features/",
          "publishedOn": "2022-09-12T17:00:00.000Z",
          "wordCount": 29429,
          "title": "The Top New Features in Apple’s iOS and iPadOS 16",
          "imageUrl": "https://media.wired.com/photos/629e50bebb966dfe6e2d39cd/191:100/w_1280,c_limit/iOS-Lock-Screen-Widgets-Hero-Gear.jpg"
        },
        {
          "id": "5ee9319fecb467cf4ea5f592",
          "author": "Adrienne So",
          "description": "Our tips and picks can up your mask game—whether you're heading back to the office or just want to stay safe and stylish.",
          "link": "https://www.wired.com/gallery/best-face-masks/",
          "publishedOn": "2022-09-12T13:00:00.000Z",
          "wordCount": 26468,
          "title": "16 Face Masks We Actually Like to Wear",
          "imageUrl": "https://media.wired.com/photos/60231225daa2245a9ec352eb/191:100/w_2580,c_limit/Gear-Primal-Filter-+-Frame-SOURCE-Primal.jpg"
        },
        {
          "id": "6217a6803a14d44656b0c87e",
          "author": "Simon Hill, Adrienne So",
          "description": "Never miss a delivery. These WIRED-tested picks will help you keep tabs on your front porch from anywhere.",
          "link": "https://www.wired.com/gallery/best-video-doorbells/",
          "publishedOn": "2022-09-11T13:00:00.000Z",
          "wordCount": 23040,
          "title": "The Best Video Doorbell Cameras",
          "imageUrl": "https://media.wired.com/photos/62280910ae2a56ae147566f7/191:100/w_2580,c_limit/Gear-Video-Doorbell_Support_Hero_SOURCE_Arlo.jpg"
        },
        {
          "id": "631a65ef74ce5b82a68ef04a",
          "author": "Joe Ray",
          "description": "Bob the Mini Dishwasher is a (maybe too) tiny countertop machine made for small families living in small spaces.",
          "link": "https://www.wired.com/review/daan-tech-bob-the-mini-dishwasher/",
          "publishedOn": "2022-09-11T12:00:00.000Z",
          "wordCount": 14212,
          "title": "This Tiny, Portable Dishwasher Is Built for the Truly Lazy",
          "imageUrl": "https://media.wired.com/photos/631bc11bd884b4dcc94164e7/191:100/w_1280,c_limit/Bob_green_SOURCE%20Daan%20Tech-2.jpg"
        },
        {
          "id": "602fdcf4ff6e0ab6e8be9319",
          "author": "Scott Gilbertson",
          "description": "Shopping for a notebook can be exasperating. Here’s how to sift through the acronyms, storage options, and extra features to find the best one for you.",
          "link": "https://www.wired.com/story/how-to-buy-the-right-laptop-for-you/",
          "publishedOn": "2022-09-11T12:00:00.000Z",
          "wordCount": 31165,
          "title": "Everything You Need to Know Before You Buy a Laptop",
          "imageUrl": "https://media.wired.com/photos/631bb97dd884b4dcc94164e3/191:100/w_1280,c_limit/How-to-Choose-a-Laptop-Gear-GettyImages-1235728903.jpg"
        },
        {
          "id": "62ffd0e1dfd380f2b1c3cb74",
          "author": "David Nield",
          "description": "From editing to dictation, you can do more with your smartphone's keyboard than you might have realized.",
          "link": "https://www.wired.com/story/7-phone-keyboard-tips/",
          "publishedOn": "2022-09-11T11:00:00.000Z",
          "wordCount": 19185,
          "title": "7 Keyboard Tips for Your Phone",
          "imageUrl": "https://media.wired.com/photos/631be61beecde8c117e7f3d9/191:100/w_1280,c_limit/phone-keyboard-Gear-1347514725-(1).jpg"
        },
        {
          "id": "631a680cc9bb1af7ef2496c1",
          "author": "Boone Ashworth",
          "description": "Plus: Brazil and Apple face off, Google expands its eco-friendly Maps directions, and social sites start prepping for the US midterm elections.",
          "link": "https://www.wired.com/story/android-iphone-rcs-tim-cook-green-bubbles/",
          "publishedOn": "2022-09-10T13:00:00.000Z",
          "wordCount": 19477,
          "title": "Apple Messages Won’t Play Nice With Android Anytime Soon",
          "imageUrl": "https://media.wired.com/photos/631bcb398990652479ff383f/191:100/w_1280,c_limit/iOS-Android-Messages-Roundup-Gear-GettyImages-1399057481.jpg"
        },
        {
          "id": "63080cd05d32e4cad34d6ea5",
          "author": "Haley Sprankle",
          "description": "This is a small but fierce soundbar option for smaller spaces, or those looking to slowly build their sound system up with quality pieces.",
          "link": "https://www.wired.com/review/sonos-ray/",
          "publishedOn": "2022-09-10T12:00:00.000Z",
          "wordCount": 13153,
          "title": "The Sonos Ray Is a Perfect Starter Soundbar",
          "imageUrl": "https://media.wired.com/photos/631bb22274ce5b82a68ef12d/191:100/w_1280,c_limit/Sonos-Ray-Gear.png"
        },
        {
          "id": "631b75d78990652479ff382a",
          "author": "Matt Jancer",
          "description": "Treat your ears with our favorite picks to make music and listen to music, or just sit outside and enjoy the music of nature.",
          "link": "https://www.wired.com/story/weekend-deals-september-10-2022/",
          "publishedOn": "2022-09-10T11:00:00.000Z",
          "wordCount": 20390,
          "title": "12 Weekend Deals on Headphones, Camp Stoves, and More",
          "imageUrl": "https://media.wired.com/photos/6130f9e6c290b31df016d9b8/191:100/w_1280,c_limit/Gear-REI-650-Down-Jacket---credit-REI.jpeg"
        },
        {
          "id": "6304af6fcea7c0581e825d1f",
          "author": "Simon Hill",
          "description": "Netgear's Wi-Fi 6E router is a speedy, stable dream for gamers—if you can stomach or skip the subscriptions.",
          "link": "https://www.wired.com/review/netgear-nighthawk-raxe300/",
          "publishedOn": "2022-09-09T12:00:00.000Z",
          "wordCount": 13530,
          "title": "The Nighthawk RAXE300 Is Ideal for Gamer Families",
          "imageUrl": "https://media.wired.com/photos/631a37a3f1e5c40d2b1bc5f3/191:100/w_1280,c_limit/Nighthawk-RAXE300-Gear.png"
        },
        {
          "id": "62fe6bacdfd380f2b1c3cb5c",
          "author": "Abby Alten Schwartz",
          "description": "Turns out there’s a neurological reason you can’t stop clicking on YouTube closet purges.",
          "link": "https://www.wired.com/story/why-watching-decluttering-videos-feels-so-good/",
          "publishedOn": "2022-09-09T12:00:00.000Z",
          "wordCount": 20666,
          "title": "Why Watching Decluttering Videos Feels So Good",
          "imageUrl": "https://media.wired.com/photos/631a949af2203b5586fabee1/191:100/w_1280,c_limit/Decluttering-Videos-Gear-GettyImages-1313525250.png"
        },
        {
          "id": "63177a8844c07c3774c4cba3",
          "author": "Medea Giordano",
          "description": "If you don’t need the very latest MacBook or Watch, some of the best gear is discounted right now.",
          "link": "https://www.wired.com/story/apple-deals-september-2022/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 19422,
          "title": "Our 7 Favorite Deals on Apple Products We Love",
          "imageUrl": "https://media.wired.com/photos/614a3fe9e2126c059c232694/191:100/w_1280,c_limit/Gear-iPad-Mini-2021-Review.jpg"
        },
        {
          "id": "63178c1bdbc9ebd1c95a74c1",
          "author": "Julian Chokkattu",
          "description": "Apple has four new handsets, from the iPhone 14 Plus to the iPhone 14 Pro Max. We break them down.",
          "link": "https://www.wired.com/story/how-to-preorder-iphone-14/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 21740,
          "title": "How to Preorder the iPhone 14—and Which Model Should You Buy?",
          "imageUrl": "https://media.wired.com/photos/631a469e40fe1e8870aa39c8/191:100/w_1280,c_limit/How-to-Preorder-iPhone-14-and-iPhone-14-Pro-Gear.png"
        },
        {
          "id": "5d76b6138f1eae000821c706",
          "author": "Scott Gilbertson",
          "description": "If you plan to upgrade to one of Apple’s new models, don’t forget to cash in on your old one.",
          "link": "https://www.wired.com/story/how-to-trade-in-or-sell-your-iphone/",
          "publishedOn": "2022-09-08T13:00:00.000Z",
          "wordCount": 20417,
          "title": "4 Ways to Sell or Trade In Your Old iPhone",
          "imageUrl": "https://media.wired.com/photos/614281217a5c79412a804048/191:100/w_1280,c_limit/Gear-iPhone-Upgrade-1172712787.jpg"
        },
        {
          "id": "6317abaa52512a466ff8f7a8",
          "author": "Justin Pot",
          "description": "Microsoft’s news algorithm leaves a lot to be desired. Here’s how to turn it off and reclaim that space.",
          "link": "https://www.wired.com/story/how-to-hide-news-widget-windows-10-11/",
          "publishedOn": "2022-09-08T12:00:00.000Z",
          "wordCount": 18421,
          "title": "How to Hide the News Widgets in Windows 10 and 11",
          "imageUrl": "https://media.wired.com/photos/63191bda36c33c0247a2efd3/191:100/w_1280,c_limit/How-to-Remove-Windows-11-News-Widget-Gear.jpg"
        },
        {
          "id": "6318f13f9a3775bca3f269e8",
          "author": "WIRED Staff",
          "description": "This week, we round up all the biggest announcements from Apple’s iPhone (and Watch) launch event.",
          "link": "https://www.wired.com/story/gadget-lab-podcast-565/",
          "publishedOn": "2022-09-08T12:00:00.000Z",
          "wordCount": 39853,
          "title": "Welcome to Apple’s Dynamic Island",
          "imageUrl": "https://media.wired.com/photos/63192d1540fe1e8870aa39c4/191:100/w_1280,c_limit/Apple-Roundup-Gadget-Lab-Gear-top.png"
        },
        {
          "id": "6319035036c33c0247a2efcf",
          "author": "Adrienne So",
          "description": "Saddled by still-mediocre battery life, the Apple Watch Ultra isn’t a true competitor to the reigning king of premium wearables. But it’s getting much closer.",
          "link": "https://www.wired.com/story/apple-watch-ultra-garmin-sports-watch/",
          "publishedOn": "2022-09-07T21:44:25.000Z",
          "wordCount": 21013,
          "title": "Apple’s New ‘Ultra’ Watch Goes Toe-to-Toe With Garmin",
          "imageUrl": "https://media.wired.com/photos/6318e8f1f2203b5586fabe6c/191:100/w_1280,c_limit/Apple-Watch-Ultra-Gear.jpg"
        },
        {
          "id": "630fc52ad24d6c0f1431f894",
          "author": "Gear Team",
          "description": "Wednesday's iPhone launch event saw the release of four new iPhone models, plus an Apple Watch built to take a beating.",
          "link": "https://www.wired.com/story/everything-apple-announced-september-2022-iphone-14/",
          "publishedOn": "2022-09-07T19:53:25.000Z",
          "wordCount": 23535,
          "title": "Everything Apple Announced: iPhone 14, Apple Watch Ultra, and More",
          "imageUrl": "https://media.wired.com/photos/6318f0def1e5c40d2b1bc5b3/191:100/w_1280,c_limit/Everything-Apple-Announced-Today-Top-Gear.jpg"
        },
        {
          "id": "62ed00fb519107fea45562b1",
          "author": "Simon Hill",
          "description": "The British utility company is environmentally friendly and has great customer service. Why can’t they all be like this?",
          "link": "https://www.wired.com/story/octopus-energy-rave/",
          "publishedOn": "2022-09-07T12:00:00.000Z",
          "wordCount": 22925,
          "title": "Octopus Energy Is the Answer to a Broken, Inefficient Market",
          "imageUrl": "https://media.wired.com/photos/6317972044c07c3774c4cba5/191:100/w_1280,c_limit/Octobus-Energy-Gear.jpg"
        }
      ]
    },
    {
      "title": "Ideas Latest",
      "feedUrl": "https://www.wired.com/feed/category/ideas/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "630f9ec45d32e4cad34d6f24",
          "author": "Meghan O'Gieblyn",
          "description": "WIRED’s spiritual advice columnist reassures a literary reader that it’s OK to communicate with images.",
          "link": "https://www.wired.com/story/am-i-wrong-to-judge-talking-in-emoji/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 21730,
          "title": "Am I Wrong to Judge People for Talking to Me in Emoji?",
          "imageUrl": "https://media.wired.com/photos/630fa20cf89e2120665181db/191:100/w_1280,c_limit/WI100122_ST_CloudSupport_LO_01.jpg"
        },
        {
          "id": "62fd1fe9b07577beee1be7f9",
          "author": "Charlotte Kent",
          "description": "Jennifer Lyn Morone became a corporation in hopes of protecting her data privacy. Her experience shows the downfalls of treating data like property.",
          "link": "https://www.wired.com/story/art-data-property-roe/",
          "publishedOn": "2022-09-08T13:00:00.000Z",
          "wordCount": 25703,
          "title": "The Woman Who Became a Company Has Lessons for a Post-Roe World",
          "imageUrl": "https://media.wired.com/photos/63192414977791160bfcd0ac/191:100/w_1280,c_limit/woman-became-company.jpg"
        },
        {
          "id": "6303a03afd602ff2f11e6ffa",
          "author": "Erica Berry",
          "description": "Tech dependence is following many students back to school—but waging a war against devices helps no one.",
          "link": "https://www.wired.com/story/cell-phone-bans-school/",
          "publishedOn": "2022-09-07T11:00:00.000Z",
          "wordCount": 24520,
          "title": "Banning Phones in Class? Not So Fast",
          "imageUrl": "https://media.wired.com/photos/6317e88a00704d14b5ffb7ca/191:100/w_1280,c_limit/phones-in-class.jpg"
        },
        {
          "id": "6306003d1814a994d3a63460",
          "author": "Katherine Cross",
          "description": "Telling people to quit the platform is less effective than stopping influential elites from using the site in harmful ways.",
          "link": "https://www.wired.com/story/twitter-democracy-harm-reduction/",
          "publishedOn": "2022-09-06T13:00:00.000Z",
          "wordCount": 25671,
          "title": "So, You Want Twitter to Stop Destroying Democracy",
          "imageUrl": "https://media.wired.com/photos/631296005d32e4cad34d6f9b/191:100/w_1280,c_limit/twitter-stop-destroying-democracy.jpg"
        },
        {
          "id": "63122b60a4a22698f6d24aae",
          "author": "Kate Knibbs",
          "description": "It’s more than an unproven medical treatment—it’s a view into the antiabortion movement’s larger project.",
          "link": "https://www.wired.com/story/abortion-pill-reversal-essay/",
          "publishedOn": "2022-09-05T13:00:00.000Z",
          "wordCount": 27655,
          "title": "What Abortion Pill ‘Reversal’ Really Accomplishes",
          "imageUrl": "https://media.wired.com/photos/631276b8a4a22698f6d24aba/191:100/w_1280,c_limit/abortion-pill-reversal.jpg"
        },
        {
          "id": "630629f0fd602ff2f11e70a4",
          "author": "Jennifer Conrad",
          "description": "Johns Hopkins' long history with student-spies suggests this most recent incident will not lead to much change—but maybe that's OK.",
          "link": "https://www.wired.com/story/national-security-spies-johns-hopkins/",
          "publishedOn": "2022-09-01T12:00:00.000Z",
          "wordCount": 25265,
          "title": "The Russian Spy in My Econ Class",
          "imageUrl": "https://media.wired.com/photos/63100b03f89e2120665181e1/191:100/w_1280,c_limit/russian-spy-econ-class.jpg"
        },
        {
          "id": "630e23a9567860ab6c66c659",
          "author": "Justin Sherman",
          "description": "The agency’s lawsuit against Kochava should squash the industry’s core defense—and help keep sensitive info off the open market.",
          "link": "https://www.wired.com/story/the-ftc-may-finally-protect-americans-from-data-brokers/",
          "publishedOn": "2022-08-31T12:00:00.000Z",
          "wordCount": 19793,
          "title": "The FTC May (Finally) Protect Americans From Data Brokers",
          "imageUrl": "https://media.wired.com/photos/630ec0bb9fbbe8d3536bfa07/191:100/w_1280,c_limit/ftc-data-brokers.jpg"
        },
        {
          "id": "62fb9c2216995ea7b1a92dd3",
          "author": "Josephine Wolff",
          "description": "Cyberinsurance doesn't cover acts of war. But even as cyberattacks mount, the definition of \"warlike\" actions remains blurry.",
          "link": "https://www.wired.com/story/russia-ukraine-cyberwar-cyberinsurance/",
          "publishedOn": "2022-08-30T13:00:00.000Z",
          "wordCount": 22772,
          "title": "Who Pays for an Act of Cyberwar?",
          "imageUrl": "https://media.wired.com/photos/630d6253f89e2120665181d0/191:100/w_1280,c_limit/who-pays-cyberwar.jpg"
        },
        {
          "id": "62fd5532fd602ff2f11e6fbe",
          "author": "Luke Burgis",
          "description": "What does Athens have to do with Jerusalem—and what do either have to do with Silicon Valley?",
          "link": "https://www.wired.com/story/technology-philosophy-three-city-problem/",
          "publishedOn": "2022-08-28T11:00:00.000Z",
          "wordCount": 29232,
          "title": "The Three-City Problem of Modern Life",
          "imageUrl": "https://media.wired.com/photos/630931d752512a466ff8f66d/191:100/w_1280,c_limit/three-cities.jpg"
        },
        {
          "id": "63053fed3a62afdd20ead128",
          "author": "Ellen Walker",
          "description": "Social media accounts featuring kids are more popular than ever. But labor and privacy laws haven't been updated to safeguard the young stars.",
          "link": "https://www.wired.com/story/child-influencers-exploitation-legal-protection/",
          "publishedOn": "2022-08-25T13:00:00.000Z",
          "wordCount": 21271,
          "title": "Nothing Is Protecting Child Influencers From Exploitation",
          "imageUrl": "https://media.wired.com/photos/6306af56f06d7dee6f53bbda/191:100/w_1280,c_limit/child-influencers-exploitation.jpg"
        },
        {
          "id": "6303f32b4a65cec78f4b4dc1",
          "author": "Yangyang Cheng",
          "description": "Science agencies around the world halted partnerships with Russia after it invaded Ukraine. But such actions are shortsighted and do more harm than good.",
          "link": "https://www.wired.com/story/russia-ukraine-science-collaboration/",
          "publishedOn": "2022-08-24T12:00:00.000Z",
          "wordCount": 30359,
          "title": "Boycotting Russian Scientists Is a Hollow Victory",
          "imageUrl": "https://media.wired.com/photos/630592da7072d2c1f5878921/191:100/w_1280,c_limit/boycotting-russian-scientists.jpg"
        },
        {
          "id": "62fe1739086c20d91ed51ac5",
          "author": "Dan Bouk",
          "description": "The population tally, with its normative ideas of identity and household, counted queerness nearly a century ago—but it needs to go much further.",
          "link": "https://www.wired.com/story/us-census-queerness-data/",
          "publishedOn": "2022-08-23T12:00:00.000Z",
          "wordCount": 36670,
          "title": "How Does Queerness Fit Into the US Census?",
          "imageUrl": "https://media.wired.com/photos/6304294bffbf585589d594ec/191:100/w_1280,c_limit/queerness-us-census.jpg"
        },
        {
          "id": "62fbdef354d910713ee4f2b6",
          "author": "William MacAskill",
          "description": "It's comforting to believe that another advanced civilization would develop if humanity met its end. Not so fast.",
          "link": "https://www.wired.com/story/longtermism-technology-evolution/",
          "publishedOn": "2022-08-22T12:00:00.000Z",
          "wordCount": 20277,
          "title": "If Humans Went Extinct, Would a Similar Species Evolve?",
          "imageUrl": "https://media.wired.com/photos/63002b38cea7c0581e825d14/191:100/w_1280,c_limit/humans-extinct.jpg"
        },
        {
          "id": "62f505f87e7512dc132d1872",
          "author": "Emily Weinstein, Carrie James",
          "description": "Well-meaning messages meant to keep teens safe can backfire. The key is to focus on judgment and agency, not rigid rules for screen time.",
          "link": "https://www.wired.com/story/children-screen-time-psychology/",
          "publishedOn": "2022-08-21T11:00:00.000Z",
          "wordCount": 22264,
          "title": "What Adults Don't Get About Teens and Digital Life",
          "imageUrl": "https://media.wired.com/photos/630029553a62afdd20ead092/191:100/w_1280,c_limit/adults-teens-digital-life.jpg"
        },
        {
          "id": "62fc37de9a81878b183eb10e",
          "author": "Matt Reynolds",
          "description": "WIRED talked with long-termist philosopher William MacAskill about human extinction, Elon Musk, and his new book, What We Owe the Future.",
          "link": "https://www.wired.com/story/will-macaskill-longtermism/",
          "publishedOn": "2022-08-17T11:00:00.000Z",
          "wordCount": 26854,
          "title": "The Future Could Be Blissful—If Humans Don’t Go Extinct First",
          "imageUrl": "https://media.wired.com/photos/62fc37de16995ea7b1a92e22/191:100/w_1280,c_limit/whatweowethefuture.jpg"
        },
        {
          "id": "62fbb2ff16995ea7b1a92dd5",
          "author": "Jaipreet Virdi",
          "description": "Over-the-counter hearing aids will be available by October. They’ll benefit many but could lead to stigmatization, inadequate testing, and even hearing loss.",
          "link": "https://www.wired.com/story/fda-over-the-counter-hearing-aids-disability/",
          "publishedOn": "2022-08-16T16:30:13.000Z",
          "wordCount": 19179,
          "title": "The Unintended Consequences of OTC Hearing Aids",
          "imageUrl": "https://media.wired.com/photos/62fbc1ff9a81878b183eb109/191:100/w_1280,c_limit/Hearingaids_Science_GettyImages-769714105.jpg"
        },
        {
          "id": "62f3c6a43787a50a7ae8c946",
          "author": "Francesca Tripodi",
          "description": "A series of incremental changes over the years has transformed the tool from an explorative search function to one that is ripe for deception.",
          "link": "https://www.wired.com/story/google-search-quietly-damaging-democracy/",
          "publishedOn": "2022-08-16T11:00:00.000Z",
          "wordCount": 20737,
          "title": "Google Search Is Quietly Damaging Democracy",
          "imageUrl": "https://media.wired.com/photos/62faea931037f5e51b6729b2/191:100/w_1280,c_limit/google-damaging-democracy.jpg"
        },
        {
          "id": "62f51c43c899551de61243d8",
          "author": "Sarah Sloat",
          "description": "Influencers are encouraging people to ditch hormonal contraception. Fixing feeds will require mending mistrust between doctors and patients.",
          "link": "https://www.wired.com/story/hormonal-birth-control-tiktok/",
          "publishedOn": "2022-08-15T12:00:00.000Z",
          "wordCount": 23248,
          "title": "Birth Control TikTok Is a Symptom of Medicine's Bigger Problem",
          "imageUrl": "https://media.wired.com/photos/62f6d516807038f14f5e91e5/191:100/w_1280,c_limit/birth-control-tiktok.jpg"
        }
      ]
    },
    {
      "title": "Science Latest",
      "feedUrl": "https://www.wired.com/feed/category/science/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "631ba4bb036b54662b510430",
          "author": "Grace Browne",
          "description": "A small number of people appear naturally immune to the coronavirus. Scientists think they might hold the key to helping protect us all.",
          "link": "https://www.wired.com/story/the-mystery-of-why-some-people-dont-get-covid/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 23717,
          "title": "The Mystery of Why Some People Don’t Get Covid",
          "imageUrl": "https://media.wired.com/photos/631ba4bad884b4dcc94164ce/191:100/w_1280,c_limit/Covid_Science_GettyImages-1320740286.jpg"
        },
        {
          "id": "631b97708990652479ff382b",
          "author": "Sabrina Weiss",
          "description": "Storing more water to deal with climate change seems like a no-brainer, but such reservoirs are complex undertakings with environmental issues of their own.",
          "link": "https://www.wired.com/story/new-water-reservoirs/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 21418,
          "title": "New Reservoirs Could Help Battle Droughts, but at What Cost?",
          "imageUrl": "https://media.wired.com/photos/631b9770eecde8c117e7f3af/191:100/w_1280,c_limit/Dams_drought_Science_GettyImages-1242872011.jpg"
        },
        {
          "id": "631bdc41c4d3ebc9237bc5ac",
          "author": "Sophia Chen",
          "description": "The jacket can raise and lower its own hood—without chips or batteries—and might one day help disabled wearers move.",
          "link": "https://www.wired.com/story/fabric-nylon-computer-jacket-disability-aid/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 20582,
          "title": "Forget Silicon. This Computer Is Made of Fabric",
          "imageUrl": "https://media.wired.com/photos/631bdc4162435d269fdbdae9/191:100/w_1280,c_limit/fabric_computer_lede_science_assistive-hood-lift-doffed.jpg"
        },
        {
          "id": "631788b35d32e4cad34d6fe1",
          "author": "Jonathan O'Callaghan",
          "description": "The grainy image of a “super Jupiter” is a sign of what’s to come as the telescope’s observations ramp up.",
          "link": "https://www.wired.com/story/the-webb-space-telescope-snaps-its-first-photo-of-an-exoplanet/",
          "publishedOn": "2022-09-11T12:00:00.000Z",
          "wordCount": 21378,
          "title": "The Webb Space Telescope Snaps Its First Photo of an Exoplanet",
          "imageUrl": "https://media.wired.com/photos/631b8ffb995b6da54b57eeb9/191:100/w_1280,c_limit/Quanta_Lede_Ancient-Antiviral-System_2880x1620_Lede-scaled.jpg"
        },
        {
          "id": "631787a58eb3383ad69a24b0",
          "author": "Hanna Hett",
          "description": "Advocates want the government to allow more climate-related immigration and to consider those migrants “protected persons.”",
          "link": "https://www.wired.com/story/as-the-planet-warms-canada-faces-an-influx-of-climate-refugees/",
          "publishedOn": "2022-09-10T12:00:00.000Z",
          "wordCount": 18453,
          "title": "As the Planet Warms, Canada Faces an Influx of Climate Refugees",
          "imageUrl": "https://media.wired.com/photos/631b8c2bf2203b5586fabee7/191:100/w_1280,c_limit/ClimateDesk_Science_GettyImages-1034062854.jpg"
        },
        {
          "id": "62fe6bacdfd380f2b1c3cb5c",
          "author": "Abby Alten Schwartz",
          "description": "Turns out there’s a neurological reason you can’t stop clicking on YouTube closet purges.",
          "link": "https://www.wired.com/story/why-watching-decluttering-videos-feels-so-good/",
          "publishedOn": "2022-09-09T12:00:00.000Z",
          "wordCount": 20666,
          "title": "Why Watching Decluttering Videos Feels So Good",
          "imageUrl": "https://media.wired.com/photos/631a949af2203b5586fabee1/191:100/w_1280,c_limit/Decluttering-Videos-Gear-GettyImages-1313525250.png"
        },
        {
          "id": "63179da544c07c3774c4cba6",
          "author": "Ramin Skibba",
          "description": "The influential astronomer led the hunt for extraterrestrial signals and helped make the field of astrobiology what it is today.",
          "link": "https://www.wired.com/story/the-legendary-frank-drake-shaped-the-search-for-alien-life/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 21867,
          "title": "The Legendary Frank Drake Shaped the Search for Alien Life",
          "imageUrl": "https://media.wired.com/photos/631a19c100704d14b5ffb826/191:100/w_1280,c_limit/FrankDrake_Science_00_02_06-Frank-Drake.jpg"
        },
        {
          "id": "6318e95fd884b4dcc9416475",
          "author": "Gregory Barber",
          "description": "Scorching temperatures in the Golden State are a test case for a more flexible energy grid.",
          "link": "https://www.wired.com/story/californias-heat-wave-is-a-big-moment-for-batteries/",
          "publishedOn": "2022-09-09T11:00:00.000Z",
          "wordCount": 20361,
          "title": "California’s Heat Wave Is a Big Moment for Batteries",
          "imageUrl": "https://media.wired.com/photos/631a471b977791160bfcd0b1/191:100/w_1280,c_limit/Grid_Science_GettyImages-641229115-(1).jpg"
        },
        {
          "id": "631135e83dfe1372fb611165",
          "author": "Matt Simon",
          "description": "Enough with the urban vs. rural binary. Bringing agriculture into cities can have huge benefits beyond healthy food.",
          "link": "https://www.wired.com/story/why-its-time-to-make-cities-more-rural/",
          "publishedOn": "2022-09-08T12:00:00.000Z",
          "wordCount": 23238,
          "title": "Rurbanization: It’s Time to Make Cities More Rural",
          "imageUrl": "https://media.wired.com/photos/6318de1fc4d3ebc9237bc506/191:100/w_1280,c_limit/urban_farm_rural_science_GettyImages-1248582254.jpg"
        },
        {
          "id": "63179abeba2a66af641b132d",
          "author": "Emily Mullin",
          "description": "The latest vaccines are designed to target the currently circulating Omicron variants—and head off a winter surge.",
          "link": "https://www.wired.com/story/how-does-a-variant-specific-covid-booster-work/",
          "publishedOn": "2022-09-08T11:00:00.000Z",
          "wordCount": 19736,
          "title": "How Does a Variant-Specific Covid Booster Work?",
          "imageUrl": "https://media.wired.com/photos/6318e54a42c342c49c967a52/191:100/w_1280,c_limit/Vaccine_Science_GettyImages-1356760192.jpg"
        },
        {
          "id": "6318d0a3d884b4dcc9416470",
          "author": "Allison Whitten",
          "description": "Many people report that their aches and pains intensify when they’re trying to sleep, but new research into the circadian clock helps explain this mystery.",
          "link": "https://www.wired.com/story/why-pain-feels-worse-at-night/",
          "publishedOn": "2022-09-07T17:14:37.000Z",
          "wordCount": 21768,
          "title": "Why Pain Feels Worse at Night",
          "imageUrl": "https://media.wired.com/photos/6318d0a274ce5b82a68ef033/191:100/w_1280,c_limit/pain_sleep_science_GettyImages-1403850274.jpg"
        },
        {
          "id": "630d278f52512a466ff8f6d8",
          "author": "Maryn McKenna",
          "description": "Blistering temperatures and the invasion of Ukraine have fed fears of global shortages—but some regions are suffering much more than others.",
          "link": "https://www.wired.com/story/how-drought-and-war-are-really-affecting-the-global-food-supply/",
          "publishedOn": "2022-09-07T11:00:00.000Z",
          "wordCount": 21062,
          "title": "How Drought and War Are Really Affecting the Global Food Supply",
          "imageUrl": "https://media.wired.com/photos/63175d9fdbc9ebd1c95a74c0/191:100/w_1280,c_limit/Drought_Science_GettyImages-1242960793-(1).jpg"
        },
        {
          "id": "62a8ed39d572905bb04fc929",
          "author": "Matt Simon",
          "description": "Daniel Holz studies the universe’s ultimate catastrophes. And he knows a thing or two about existential threats on Earth, since he helps set the Doomsday Clock.",
          "link": "https://www.wired.com/story/humanity-is-doing-its-best-impression-of-a-black-hole/",
          "publishedOn": "2022-09-06T12:00:00.000Z",
          "wordCount": 22350,
          "title": "Humanity Is Doing Its Best Impression of a Black Hole",
          "imageUrl": "https://media.wired.com/photos/63127c1544c07c3774c4cb57/191:100/w_1280,c_limit/Humanity-Doing-Best-Impression-Of-Black-Hole-Science-103772144.jpg"
        },
        {
          "id": "63128c0cdbc9ebd1c95a74bd",
          "author": "Simar Bajaj",
          "description": "Researchers are working on an injectable that could get dormant follicles growing again. Trials on mice show promise.",
          "link": "https://www.wired.com/story/new-baldness-treatments/",
          "publishedOn": "2022-09-06T11:00:00.000Z",
          "wordCount": 22341,
          "title": "This Follicle-Hacking Drug Could One Day Treat Baldness",
          "imageUrl": "https://media.wired.com/photos/63128c0c79f10149f7bb9ef5/191:100/w_1280,c_limit/Baldness_science_GettyImages-1264331186.jpg"
        },
        {
          "id": "630e89555d32e4cad34d6f23",
          "author": "Emily Mullin",
          "description": "The project will match the victims’ DNA to that of their descendants—but uses a genealogy website that can be accessed by law enforcement.",
          "link": "https://www.wired.com/story/an-effort-to-id-tulsa-race-massacre-victims-raises-privacy-issues/",
          "publishedOn": "2022-09-06T11:00:00.000Z",
          "wordCount": 22792,
          "title": "An Effort to ID Tulsa Race Massacre Victims Raises Privacy Issues",
          "imageUrl": "https://media.wired.com/photos/6312ac2679f10149f7bb9ef7/191:100/w_1280,c_limit/DNA-Tulsa-Massacre-Remains-Science-1264513501.jpg"
        },
        {
          "id": "630d11e3f698c0a9298eadfd",
          "author": "Ramin Skibba",
          "description": "The two probes made flybys of Jupiter and Saturn in the 1970s. Today they’re still doing science way out beyond our solar system.",
          "link": "https://www.wired.com/story/voyager-1-and-2-humanitys-interstellar-envoys-soldier-on-at-45/",
          "publishedOn": "2022-09-05T11:00:00.000Z",
          "wordCount": 21595,
          "title": "Voyager 1 and 2, Humanity’s Interstellar Envoys, Soldier On at 45",
          "imageUrl": "https://media.wired.com/photos/631121704651cadb9cefacb0/191:100/w_1280,c_limit/Voyager_science_PIA21480.jpg"
        },
        {
          "id": "630d000d333af8e1504c499b",
          "author": "Joanna Thompson",
          "description": "By studying how electric organs arose in different lineages of fish, scientists gain new insights into a long-standing question of evolutionary biology.",
          "link": "https://www.wired.com/story/electric-fish-genomes-reveal-how-evolution-repeats-itself/",
          "publishedOn": "2022-09-04T12:00:00.000Z",
          "wordCount": 21082,
          "title": "Electric Fish Genomes Reveal How Evolution Repeats Itself",
          "imageUrl": "https://media.wired.com/photos/631262ebf89e2120665181fc/191:100/w_1280,c_limit/Electric-Eel-Evolution-Quanta-Science.jpg"
        },
        {
          "id": "630cecae79f10149f7bb9e18",
          "author": "Ramin Skibba",
          "description": "The uncrewed mission, the first major launch of the Artemis program, suffered a setback after a liquid hydrogen leak.",
          "link": "https://www.wired.com/story/nasas-giant-moon-bound-rocket-is-grounded-for-repairs/",
          "publishedOn": "2022-09-03T21:39:16.000Z",
          "wordCount": 20670,
          "title": "NASA Orders a Second Delay for the Artemis Moon-Bound Rocket",
          "imageUrl": "https://media.wired.com/photos/6311207a567860ab6c66c67b/191:100/w_1280,c_limit/artemis_science_GettyImages-1242855290-(1).jpg"
        },
        {
          "id": "630cede079f10149f7bb9e19",
          "author": "Damian Carrington",
          "description": "Global warming has intensified rainfall to record levels, leading to deadly flash flooding.",
          "link": "https://www.wired.com/story/pakistans-monster-monsoon-shows-the-wrath-of-climate-change/",
          "publishedOn": "2022-09-03T12:00:00.000Z",
          "wordCount": 18769,
          "title": "Pakistan’s ‘Monster Monsoon’ Shows the Wrath of Climate Change",
          "imageUrl": "https://media.wired.com/photos/63111fe352512a466ff8f715/191:100/w_1280,c_limit/climatedesk_Science_GettyImages-1242856617.jpg"
        },
        {
          "id": "62fd94be086c20d91ed51ac4",
          "author": "Sarah Gundle, PsyD",
          "description": "Forced to use technology during Covid-19, I discovered surprising new ways to help couples. What I learned can make you a better partner.",
          "link": "https://www.wired.com/story/virtual-sessions-made-me-a-better-therapist-you-better-patient/",
          "publishedOn": "2022-09-03T11:00:00.000Z",
          "wordCount": 20449,
          "title": "Virtual Sessions Made Me a Better Therapist",
          "imageUrl": "https://media.wired.com/photos/6312693b175d7ee6698f01bd/191:100/w_1280,c_limit/Science-Virtual-Therapy-Made-Me-A-Better-Therapist-GettyImages-1401997484.jpg"
        }
      ]
    },
    {
      "title": "Security Latest",
      "feedUrl": "https://www.wired.com/feed/category/security/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": [
        {
          "id": "631b90a1d884b4dcc94164be",
          "author": "Lily Hay Newman",
          "description": "Safety Check and Lockdown Mode give people in vulnerable situations ways to quarantine themselves from acute risks.",
          "link": "https://www.wired.com/story/apple-ios-16-safety-check-lockdown-mode/",
          "publishedOn": "2022-09-12T11:00:00.000Z",
          "wordCount": 20219,
          "title": "iOS 16 Has 2 New Security Features for Worst-Case Scenarios",
          "imageUrl": "https://media.wired.com/photos/631bbd66f1e5c40d2b1bc626/191:100/w_1280,c_limit/security-apple-lock.jpg"
        },
        {
          "id": "631bd10a8990652479ff3840",
          "author": "Matt Burgess",
          "description": "Plus: Albania cuts ties with Iran, claims of a TikTok data breach that didn’t happen, and much more.",
          "link": "https://www.wired.com/story/la-school-district-ransomware-albania-iran-security-roundup/",
          "publishedOn": "2022-09-10T13:00:00.000Z",
          "wordCount": 19879,
          "title": "Hackers Target Los Angeles School District With Ransomware",
          "imageUrl": "https://media.wired.com/photos/631bd10a977791160bfcd219/191:100/w_1280,c_limit/LAUSD-Ransomware-Security-GettyImages-1393843200.jpg"
        },
        {
          "id": "631939da8990652479ff376e",
          "author": "Matt Burgess",
          "description": "Samizdat Online syndicates banned news sites by hosting them on uncensored domains—allowing people to access independent reporting.",
          "link": "https://www.wired.com/story/russia-internet-censorship-samizdat-online/",
          "publishedOn": "2022-09-08T11:00:00.000Z",
          "wordCount": 21382,
          "title": "This Clever Anti-Censorship Tool Lets Russians Read Blocked News",
          "imageUrl": "https://media.wired.com/photos/631939da74ce5b82a68ef046/191:100/w_1280,c_limit/This-Clever-Anti-Censorship-Tool-Lets-Russians-Read-Blocked-News-Security-GettyImages-950362554.png"
        },
        {
          "id": "6318d57feecde8c117e7f34a",
          "author": "Matt Burgess",
          "description": "With iOS 16 and macOS Ventura, Apple is introducing passkeys—a more convenient and secure alternative to passwords.",
          "link": "https://www.wired.com/story/apple-passkeys-password-iphone-mac-ios16-ventura/",
          "publishedOn": "2022-09-07T18:45:36.000Z",
          "wordCount": 21082,
          "title": "Apple’s Killing the Password. Here’s Everything You Need to Know",
          "imageUrl": "https://media.wired.com/photos/6318d57fc9bb1af7ef249672/191:100/w_1280,c_limit/security-apple-password.jpg"
        },
        {
          "id": "630f9a9a3dfe1372fb61110f",
          "author": "Lily Hay Newman",
          "description": "US lawmakers keep warning about the popular app. But until they can explain what makes it uniquely dangerous, it’s difficult to tailor a resolution.",
          "link": "https://www.wired.com/story/tiktok-nationa-security-threat-why/",
          "publishedOn": "2022-09-06T11:00:00.000Z",
          "wordCount": 22559,
          "title": "It’s Time to Get Real About TikTok’s Risks",
          "imageUrl": "https://media.wired.com/photos/631253e1ba2a66af641b1326/191:100/w_1280,c_limit/security-tik-tok.jpg"
        },
        {
          "id": "6311923d9fbbe8d3536bfa37",
          "author": "Lily Hay Newman",
          "description": "Plus: An unsecured database exposed face recognition data in China, ‘Cuba’ ransomware knocks out Montenegro, and more.",
          "link": "https://www.wired.com/story/fog-reveal-police-montenegro-ransomware-ftc-lawsuit/",
          "publishedOn": "2022-09-03T13:00:00.000Z",
          "wordCount": 18956,
          "title": "Police Across US Bypass Warrants With Mass Location-Tracking Tool",
          "imageUrl": "https://media.wired.com/photos/631283ea8eb3383ad69a24af/191:100/w_1280,c_limit/Police-Tracking-Fog-Reveal-Security-GettyImages-104263702.jpg"
        },
        {
          "id": "63110e2a44c07c3774c4cb37",
          "author": "Dan Goodin, Ars Technica",
          "description": "Microsoft disclosed the flaw in the Android app’s deep link verification process, which has since been fixed.",
          "link": "https://www.wired.com/story/tiktok-android-app-deep-link-vulnerability/",
          "publishedOn": "2022-09-02T13:00:00.000Z",
          "wordCount": 17033,
          "title": "TikTok Users Were Vulnerable to a Single-Click Attack",
          "imageUrl": "https://media.wired.com/photos/6310e0fef89e2120665181e7/191:100/w_1280,c_limit/The-Issue-with-TikTok-Security-Alamy-WNCK07.jpg"
        },
        {
          "id": "63113564f64c675d6d1a5122",
          "author": "Matt Burgess",
          "description": "Hackers can use Microsoft’s Power Automate to push out ransomware and key loggers—if they get machine access first.",
          "link": "https://www.wired.com/story/windows-11-power-automate-attack/",
          "publishedOn": "2022-09-02T11:00:00.000Z",
          "wordCount": 19435,
          "title": "A Windows 11 Automation Tool Can Easily Be Hijacked",
          "imageUrl": "https://media.wired.com/photos/631135648eb3383ad69a2495/191:100/w_1280,c_limit/security-windows-11.jpg"
        },
        {
          "id": "630fd5408eb3383ad69a2488",
          "author": "Pia Ceres",
          "description": "The California Age-Appropriate Design Code would launch a huge online privacy experiment. And it won’t just affect children.",
          "link": "https://www.wired.com/story/california-aadc-kids-privacy-age-checks/",
          "publishedOn": "2022-09-01T11:00:00.000Z",
          "wordCount": 22221,
          "title": "The US May Soon Learn What a ‘Kid-Friendly’ Internet Looks Like",
          "imageUrl": "https://media.wired.com/photos/630fdf12dbc9ebd1c95a746d/191:100/w_1280,c_limit/California-Age-Appropriate-Design-Code-GettyImages-1388648614.jpg"
        },
        {
          "id": "630f99abba2a66af641b1313",
          "author": "Lily Hay Newman",
          "description": "Researchers found that mobile applications contain keys that could provide access to both user information and private files from unconnected apps.",
          "link": "https://www.wired.com/story/mobile-apps-cloud-credentials-exposed/",
          "publishedOn": "2022-09-01T10:00:00.000Z",
          "wordCount": 18668,
          "title": "Careless Errors in Hundreds of Apps Could Expose Troves of Data",
          "imageUrl": "https://media.wired.com/photos/630fe426333af8e1504c49a8/191:100/w_1280,c_limit/Careless-Errors-in-Hundreds-of-Apps-Are-a-Recipe-for-Disaster-GettyImages-973347832.jpg"
        },
        {
          "id": "62f589f554d910713ee4f264",
          "author": "Omar L. Gallaga",
          "description": "Prepaid phones are looking good as privacy worries peak.",
          "link": "https://www.wired.com/story/how-to-use-burner-phone/",
          "publishedOn": "2022-08-31T13:00:00.000Z",
          "wordCount": 19744,
          "title": "You’re Not Stringer Bell, but You May Still Need a Burner Phone",
          "imageUrl": "https://media.wired.com/photos/630e6f7fba2a66af641b12c6/191:100/w_1280,c_limit/Burner-Phone-Security-GettyImages-1415243111.jpg"
        },
        {
          "id": "630e8353f89e2120665181d8",
          "author": "Kate O'Flaherty",
          "description": "Plus: Chrome patches another zero-day flaw, Microsoft closes up 100 vulnerabilities, Android gets a significant patch, and more.",
          "link": "https://www.wired.com/story/apple-fixed-a-serious-ios-security-flaw-have-you-updated-yet/",
          "publishedOn": "2022-08-31T11:00:00.000Z",
          "wordCount": 19566,
          "title": "Apple Fixed a Serious iOS Security Flaw—Have You Updated Yet?",
          "imageUrl": "https://media.wired.com/photos/630e8353dec8aa69fd322398/191:100/w_1280,c_limit/critical-update-security-august.jpg"
        },
        {
          "id": "62fd0e3f23d2b53441872fb6",
          "author": "Guillaume Ptak",
          "description": "Anti-Putin media network February Morning has become a central player in the underground fight against the Kremlin.",
          "link": "https://www.wired.com/story/february-morning-russia-ukraine-war/",
          "publishedOn": "2022-08-29T11:00:00.000Z",
          "wordCount": 26603,
          "title": "The Telegram-Powered News Outlet Waging Guerrilla War on Russia",
          "imageUrl": "https://media.wired.com/photos/6303eb981814a994d3a6340b/191:100/w_1280,c_limit/Telegram-Russian-Forces-Security-AP_22173448993355.jpg"
        },
        {
          "id": "630940a4567860ab6c66c656",
          "author": "Matt Burgess",
          "description": "Plus: An Iranian hacking tool steals inboxes, LastPass gets hacked, and a deepfake scammer targets the crypto world.",
          "link": "https://www.wired.com/story/us-propaganda-russia-china-memes-security-roundup/",
          "publishedOn": "2022-08-27T13:00:00.000Z",
          "wordCount": 19408,
          "title": "A US Propaganda Operation Hit Russia and China With Memes",
          "imageUrl": "https://media.wired.com/photos/630940a4f89e2120665180ef/191:100/w_1280,c_limit/Russia-China-Propaganda-Attacks-Security-GettyImages-1399591352.jpg"
        },
        {
          "id": "6307d624f89e2120665180cf",
          "author": "Lily Hay Newman",
          "description": "The phishing attack on the SMS giant exposes the dangers of B2B companies to the entire tech ecosystem.",
          "link": "https://www.wired.com/story/twilio-breach-phishing-supply-chain-attacks/",
          "publishedOn": "2022-08-26T20:05:55.000Z",
          "wordCount": 19205,
          "title": "Why the Twilio Breach Cuts So Deep",
          "imageUrl": "https://media.wired.com/photos/630921ccf64c675d6d1a5056/191:100/w_1280,c_limit/Twilio-Hack-Security-GettyImages-1281229452.jpg"
        },
        {
          "id": "630815e7dbc9ebd1c95a7435",
          "author": "Matt Burgess",
          "description": "An attack on Russian mercenaries shows how militaries are increasingly using open source data—with sometimes deadly consequences.",
          "link": "https://www.wired.com/story/wagner-group-osint-russia-ukraine/",
          "publishedOn": "2022-08-26T11:00:00.000Z",
          "wordCount": 20612,
          "title": "Their Photos Were Posted Online. Then They Were Bombed",
          "imageUrl": "https://media.wired.com/photos/630815e7f89e2120665180d0/191:100/w_1280,c_limit/Russia-Ukraine-Telegram-Security-AP_22174665807363.jpg"
        },
        {
          "id": "63064afe7072d2c1f5878922",
          "author": "Ashley Belanger, Ars Technica",
          "description": "An Ohio judge ruled that such surveillance to prevent cheating could form a slippery slope to more illegal searches.",
          "link": "https://www.wired.com/story/remote-testing-student-room-scans-privacy/",
          "publishedOn": "2022-08-25T13:00:00.000Z",
          "wordCount": 19226,
          "title": "Scans of Students’ Homes During Tests Are Deemed Unconstitutional",
          "imageUrl": "https://media.wired.com/photos/6306b01a35e945940dec1d27/191:100/w_1280,c_limit/Students-Remote-Scans-Security-GettyImages-1262169826.jpg"
        },
        {
          "id": "63039900b365e23d4dea57cf",
          "author": "Thor Benson",
          "description": "Without robust federal protections, the country's widespread mass surveillance systems could be used against citizens like never before.",
          "link": "https://www.wired.com/story/privacy-mass-surveillance-us-authoritarian/",
          "publishedOn": "2022-08-24T11:00:00.000Z",
          "wordCount": 19695,
          "title": "The Privacy Flaw Threatening US Democracy",
          "imageUrl": "https://media.wired.com/photos/630534793a62afdd20ead125/191:100/w_1280,c_limit/US-Privacy-Law-Surveillance-Security-GettyImages-1301519048.jpg"
        },
        {
          "id": "63050303dfd380f2b1c3cb89",
          "author": "Lily Hay Newman",
          "description": "Peiter “Mudge” Zatko’s claims about the company’s lax security are all bad. But one clearly captures the extent of systemic issues.",
          "link": "https://www.wired.com/story/mudge-twitter-whistleblower-security/",
          "publishedOn": "2022-08-23T23:37:27.000Z",
          "wordCount": 20277,
          "title": "The Twitter Whistleblower Report’s Most Damning Allegation",
          "imageUrl": "https://media.wired.com/photos/63050c6235e945940dec1c8e/191:100/w_1280,c_limit/Twitter-Whistleblower-Business-GettyImages-1236173576.jpg"
        },
        {
          "id": "62fff034dfd380f2b1c3cb7b",
          "author": "Matt Burgess",
          "description": "As a graduation prank, four high school students hijacked 500 screens across six school buildings to troll their classmates and teachers.",
          "link": "https://www.wired.com/story/biggest-hacker-rickroll-high-school-prank/",
          "publishedOn": "2022-08-22T11:00:00.000Z",
          "wordCount": 23171,
          "title": "Inside the World’s Biggest Hacker Rickroll",
          "imageUrl": "https://media.wired.com/photos/62fff034a9141144fee18527/191:100/w_1280,c_limit/RickAstley_rickrolled_prank_sec_GettyImages-97193637.jpg"
        }
      ]
    },
    {
      "title": "WIRED Guides Latest",
      "feedUrl": "https://www.wired.com/feed/tag/wired-guide/latest/rss",
      "siteUrl": "https://www.wired.com",
      "articles": []
    },
    {
      "title": "Product Hunt — The best new products, every day",
      "feedUrl": "https://www.producthunt.com/feed",
      "siteUrl": "https://www.producthunt.com",
      "articles": [
        {
          "id": "https://www.producthunt.com/posts/domain-availability-checker",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/domain-availability-checker",
          "publishedOn": "2022-09-13T09:33:48.000Z",
          "wordCount": 1021,
          "title": "Domain Availability Checker — Check domain and compare prices of best registrars",
          "imageUrl": "https://ph-files.imgix.net/b8f68337-43cf-4c82-be07-087a0ae2c75f.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/livechat-for-instagram",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/livechat-for-instagram",
          "publishedOn": "2022-09-13T07:14:13.000Z",
          "wordCount": 964,
          "title": "LiveChat for Instagram — Effortlessly talk to your customers via Instagram",
          "imageUrl": "https://ph-files.imgix.net/fe4f318b-d69a-4d2a-b07d-fee8c7ec1cea.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/nomads-handbook-for-co-working-spaces",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/nomads-handbook-for-co-working-spaces",
          "publishedOn": "2022-09-13T07:01:54.000Z",
          "wordCount": 965,
          "title": "Nomads’ Handbook for Co-working Spaces — A guide to workplaces in popular digital nomad destinations",
          "imageUrl": "https://ph-files.imgix.net/f4c34244-c2bc-4a1d-b780-1a99addc1963.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/beoble",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/beoble",
          "publishedOn": "2022-09-13T06:27:01.000Z",
          "wordCount": 898,
          "title": "beoble — Pluggable modular Web3 social layer",
          "imageUrl": "https://ph-files.imgix.net/335aad53-0d35-4507-81a0-c9b5139b6915.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/secureframe-questionnaires",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/secureframe-questionnaires",
          "publishedOn": "2022-09-13T05:48:18.000Z",
          "wordCount": 918,
          "title": "Secureframe Questionnaires — Respond to security questionnaires and RFPs fast with AI",
          "imageUrl": "https://ph-files.imgix.net/22d9d1ef-4d7b-457f-9a46-4a472bdec5fa.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/verbally-for-google-meet-zoom",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/verbally-for-google-meet-zoom",
          "publishedOn": "2022-09-13T05:41:46.000Z",
          "wordCount": 1108,
          "title": "Verbally for Google Meet & Zoom — Improve your meeting productivity in seconds",
          "imageUrl": "https://ph-files.imgix.net/5b5b1274-8ea3-461b-925f-fffe973a7b1f.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/frontend-monitoring-by-highlight",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/frontend-monitoring-by-highlight",
          "publishedOn": "2022-09-13T01:58:24.000Z",
          "wordCount": 1006,
          "title": "Frontend Monitoring by Highlight — The best way to monitor the performance of your frontend",
          "imageUrl": "https://ph-files.imgix.net/1a48917b-93e2-4e78-88b2-6fb639e1d257.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/gitpaid",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/gitpaid",
          "publishedOn": "2022-09-12T21:38:46.000Z",
          "wordCount": 947,
          "title": "GitPaid — Sell your GitHub repositories and start earning money",
          "imageUrl": "https://ph-files.imgix.net/1ed1650a-ae81-4993-be15-50c38f77a0c8.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/paidlance",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/paidlance",
          "publishedOn": "2022-09-12T21:25:32.000Z",
          "wordCount": 902,
          "title": "Paidlance — Find the real people that you love to work and collaborate",
          "imageUrl": "https://ph-files.imgix.net/d9ce0d89-6867-4a37-930d-cbb74d9d5525.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/dentaline",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/dentaline",
          "publishedOn": "2022-09-12T21:02:05.000Z",
          "wordCount": 762,
          "title": "Dentaline — Increase your efficiency and manage your patients with ease",
          "imageUrl": "https://ph-files.imgix.net/f712e6d8-7d99-4d2b-9de5-3dfacd68e167.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/the-money-quiz",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/the-money-quiz",
          "publishedOn": "2022-09-12T20:30:50.000Z",
          "wordCount": 1002,
          "title": "The Money Quiz — How much money would it take for you to...",
          "imageUrl": "https://ph-files.imgix.net/6149a625-2d88-4725-aa55-56e044f0d078.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/kinopio-3-0",
          "author": null,
          "description": "https://kinopio.club/-life-tasks..., \n- Collect quotes: https://kinopio.club/quotebook-g...\n- Build a Roadmap: https://kinopio.club/-kinopio-ro...\n\nNew Stuff:\n\n- Change card colors, lock position, and more card styling options\n- Connection lines can have directions\n- Embed your spaces anywhere (including Notion)\n- Full Undo/Redo\n- Inbox collects random thoughts and ideas\n- Draw Boxes to organize your space\n\nAnd, As Always:\n\n- No sign up required to use it\n- Real-time collaboration\n- [[Tags]] with Backlinking\n- Privacy settings and invite links\n\nLast year, I launched Kinopio 2.0 on ProductHunt and was really encouraged by the warm reception and support. It placed #1 and introduced Kinopio to a ton of cool new people.\n\n(シ_ _)シ I'd love to know what you think. And if you have any questions, I'll be here all day :)\n\n> p.s. If you’re curious about the technical details behind how Kinopio is made, 👀 https://pketh.org/how-kinopio-is...\n> p.p.s. More recently, I wrote about how I build. 👀 https://pketh.org/how-i-build.html\n\n– Pirijan,\nKinopio Creator\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/kinopio-3-0",
          "publishedOn": "2022-09-12T18:31:42.000Z",
          "wordCount": 922,
          "title": "Kinopio 3.0 — Spatial thinking for new ideas and hard problems",
          "imageUrl": "https://ph-files.imgix.net/dd3ed05c-9f55-4101-af65-f852b3f64f89.webp?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/hygraph",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/hygraph",
          "publishedOn": "2022-09-12T17:28:09.000Z",
          "wordCount": 1038,
          "title": "Hygraph — The federated content platform",
          "imageUrl": "https://ph-files.imgix.net/498aef5d-e568-4508-af76-fbda773f65f1.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/sunhunter",
          "author": null,
          "description": "brandon@sunhunter.io and I will be happy to answer any questions. \n\nHappy sunhunting!\nBrandon\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/sunhunter",
          "publishedOn": "2022-09-12T17:19:16.000Z",
          "wordCount": 966,
          "title": "Sunhunter — Catch the best skies with daily sunrise and sunset forecasts",
          "imageUrl": "https://ph-files.imgix.net/43d2e454-1b94-4d27-af51-703c8afcd109.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/correlated-s-pql-scoring",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/correlated-s-pql-scoring",
          "publishedOn": "2022-09-12T16:59:30.000Z",
          "wordCount": 978,
          "title": "Correlated's PQL Scoring — Accelerate your product-led strategy with one platform",
          "imageUrl": "https://ph-files.imgix.net/40af9bf9-4dc2-4837-b3f7-1159dc0bef8c.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/indicator-dash",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/indicator-dash",
          "publishedOn": "2022-09-12T15:58:58.000Z",
          "wordCount": 977,
          "title": "Indicator Dash — Rank and compare to mitigate crypto market uncertainty",
          "imageUrl": "https://ph-files.imgix.net/e64fc497-dadc-465c-9959-78fabed92924.webp?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/simpliroute-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/simpliroute-2",
          "publishedOn": "2022-09-12T14:27:54.000Z",
          "wordCount": 869,
          "title": "SimpliRoute — Helping reduce logistic costs and streamline delivery ops",
          "imageUrl": "https://ph-files.imgix.net/9ada1b98-3310-4e0e-847b-779d80f04fdf.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/arxvision",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/arxvision",
          "publishedOn": "2022-09-12T12:12:26.000Z",
          "wordCount": 959,
          "title": "ARxVision — Augmented Reality Audio Wearable",
          "imageUrl": "https://ph-files.imgix.net/6004341f-7e03-4c24-9822-d68b299c2ec6.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/supernote",
          "author": null,
          "description": "https://www.reddit.com/r/Supernote/\n\nRoadmaps \nSupernote A5X/A6X Software Roadmap 2022 https://trello.com/b/l0COP24j/su...\nSupernote A5/A6 Software Roadmap 2022 https://trello.com/b/OFU66NEX/su...\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/supernote",
          "publishedOn": "2022-09-12T11:59:00.000Z",
          "wordCount": 841,
          "title": "Supernote — An elegant productivity gadget to replace your notebooks",
          "imageUrl": "https://ph-files.imgix.net/1446eae2-4f7f-4815-abf1-28c9f43ee4b9.webp?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/leafjs",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/leafjs",
          "publishedOn": "2022-09-12T11:42:46.000Z",
          "wordCount": 883,
          "title": "Leafjs — A lightweight web-components based frontend framework",
          "imageUrl": "https://ph-files.imgix.net/030f5e7c-126a-4289-a05e-b4a4fabdaf29.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/owlyshield",
          "author": null,
          "description": "https://github.com/SitinCloud/Ow...\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/owlyshield",
          "publishedOn": "2022-09-12T11:26:01.000Z",
          "wordCount": 922,
          "title": "Owlyshield — Open source AI-driven antivirus engine written in Rust",
          "imageUrl": "https://ph-files.imgix.net/ca32b4b5-9cf6-4efd-9002-da0bd43bb9b6.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/companieslogo",
          "author": null,
          "description": "https://companieslogo.com/accoun...\nAPI documentation: https://companieslogo.com/api-doc/\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/companieslogo",
          "publishedOn": "2022-09-12T11:15:17.000Z",
          "wordCount": 937,
          "title": "CompaniesLogo — Database containing over 7,000 company logos with an API",
          "imageUrl": "https://ph-files.imgix.net/abecc7a2-c0fc-438a-ad5a-d4b02d98c8b4.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/growthbar-s-wordpress-chrome-extension",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/growthbar-s-wordpress-chrome-extension",
          "publishedOn": "2022-09-12T07:44:15.000Z",
          "wordCount": 1013,
          "title": "GrowthBar's WordPress Chrome Extension — Make SEO content that Google loves",
          "imageUrl": "https://ph-files.imgix.net/e0f83305-0142-4e05-9e93-aad00d77adc6.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/olm-converter-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/olm-converter-2",
          "publishedOn": "2022-09-12T07:34:09.000Z",
          "wordCount": 1031,
          "title": "OLM Converter — Optimum tool to convert OLM file without losing any data",
          "imageUrl": "https://ph-files.imgix.net/67fdbaa8-690f-42c7-b348-09947bcc8965.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/stippl",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/stippl",
          "publishedOn": "2022-09-12T07:29:24.000Z",
          "wordCount": 968,
          "title": "Stippl — Discover, build & share social travel plans",
          "imageUrl": "https://ph-files.imgix.net/8b30d025-4f4f-45c4-b6a8-ee30f702187f.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/diffusion-bee",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/diffusion-bee",
          "publishedOn": "2022-09-12T07:18:19.000Z",
          "wordCount": 934,
          "title": "Diffusion Bee — Stable diffusion GUI app for M1 Mac",
          "imageUrl": "https://ph-files.imgix.net/49d64894-ccd6-418c-afb2-f85ce51d4aef.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/pitch-deck-guru",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/pitch-deck-guru",
          "publishedOn": "2022-09-12T07:14:32.000Z",
          "wordCount": 978,
          "title": "Pitch Deck Guru — Helping startups make winning pitch decks and infographics",
          "imageUrl": "https://ph-files.imgix.net/da42ce79-9269-4411-af70-0a47ed667e8f.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/oaziz-nft-ticketing",
          "author": null,
          "description": "https://click.oaziz.xyz/NFT_Tick...\n\nAirdrop\nOaziz Legends airdrop is still live! Follow the link to get your free NFTs: links.\nhttps://click.oaziz.xyz/Airdrop_...\n\nThank you for your attention, check our socials, and stay with Oaziz DAO!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/oaziz-nft-ticketing",
          "publishedOn": "2022-09-12T07:11:48.000Z",
          "wordCount": 1020,
          "title": "Oaziz NFT Ticketing  — Create event, design, mint and sell your NFT tickets",
          "imageUrl": "https://ph-files.imgix.net/03b92b2c-8917-4895-8270-ab0f022702d6.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/arrived-vacation-rentals",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/arrived-vacation-rentals",
          "publishedOn": "2022-09-12T07:06:08.000Z",
          "wordCount": 1027,
          "title": "Arrived Vacation Rentals — Buy shares of vacation rentals like stocks",
          "imageUrl": "https://ph-files.imgix.net/456ac976-f433-43c7-a16d-efabd3b73a6f.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/pup-personalized-upskilling-platform",
          "author": null,
          "description": "https://pup.adaptivity.us/\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/pup-personalized-upskilling-platform",
          "publishedOn": "2022-09-12T07:00:03.000Z",
          "wordCount": 1011,
          "title": "PUP - Personalized Upskilling Platform — Zero-cost last-mile learning platform for your employability",
          "imageUrl": "https://ph-files.imgix.net/7f7ea3a6-53b5-4bc0-a1f3-73f57526eefe.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/carrus",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/carrus",
          "publishedOn": "2022-09-12T05:56:42.000Z",
          "wordCount": 924,
          "title": "Carrus — Ace the interview & land your dream job",
          "imageUrl": "https://ph-files.imgix.net/071a6f88-1c2f-48b8-881e-5b11921c4729.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/simplydebug",
          "author": null,
          "description": "www.simplydebug.dev and earn money.\n\nLet me know if you have any thoughts or suggestions for the app.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/simplydebug",
          "publishedOn": "2022-09-12T04:33:06.000Z",
          "wordCount": 993,
          "title": "SimplyDebug — Free 1:1 live chat help for react developers",
          "imageUrl": "https://ph-files.imgix.net/05d59c65-d5ad-4d10-86c9-299bf7960218.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/november-2",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/november-2",
          "publishedOn": "2022-09-12T02:36:04.000Z",
          "wordCount": 884,
          "title": "November — Spotify for people discovery",
          "imageUrl": "https://ph-files.imgix.net/b9fc62d6-73dd-458d-80ac-2edf4cdefe90.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/kosy-2-0",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/kosy-2-0",
          "publishedOn": "2022-09-12T00:52:58.000Z",
          "wordCount": 1039,
          "title": "Kosy 2.0 — A virtual space where remote teams work better together",
          "imageUrl": "https://ph-files.imgix.net/34fac1a6-ce1f-4eaf-bf4b-1daa063caa3c.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/passkeys-io",
          "author": null,
          "description": "Hanko. We’re a team of developers and designers, on a mission to revolutionize the way we authenticate online.\n\nYesterday, iOS 16 was released globally. And with that, Apple has shipped passkeys – the official successor to the password – to our iPhones. That means starting today, you can experience the new standard for online authentication on your own devices and get a good idea how the login will soon evolve for the first time since the invention of the internet.\n\nWe love passkeys and the technology behind it and decided to launch a live demo that lets you try passkeys on your devices. Right now.\n\n✨ Not just a simple tech-demo\nInstead of just simply calling the passkey browser API to pop up a passkey dialogue, passkeys.io ships a complete passkey-enabled demo account. This is the only wa…",
          "link": "https://www.producthunt.com/posts/passkeys-io",
          "publishedOn": "2022-09-11T19:42:17.000Z",
          "wordCount": 945,
          "title": "Passkeys.io — A passkey authentication demo and info page",
          "imageUrl": "https://ph-files.imgix.net/22ebf5d8-557b-4816-985e-9683dc50c9c7.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/nomodoom",
          "author": null,
          "description": "https://nomodoom.com so everyone else can reap the benefits of it. Its only goal is to help others curb their Reddit/Hacker News addiction so it's free to use.\n\nIf you're interested please check it out!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/nomodoom",
          "publishedOn": "2022-09-11T19:01:35.000Z",
          "wordCount": 944,
          "title": "nomodoom — Periodic email digest of the most important posts",
          "imageUrl": "https://ph-files.imgix.net/b37032aa-a208-4341-ab6c-10a69d5404c8.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/boop-3",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/boop-3",
          "publishedOn": "2022-09-11T18:29:34.000Z",
          "wordCount": 960,
          "title": "BOOP — Charming new connections & dates",
          "imageUrl": "https://ph-files.imgix.net/d65d0378-c018-4767-a871-076b6b950f53.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/transcriberz",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/transcriberz",
          "publishedOn": "2022-09-11T17:33:10.000Z",
          "wordCount": 866,
          "title": "Transcriberz — Converts WhatsApp voice note into text",
          "imageUrl": "https://ph-files.imgix.net/ca780ca4-0910-4e6b-bf7c-020ddbae6b8a.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/keyframes-studio",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/keyframes-studio",
          "publishedOn": "2022-09-11T12:52:17.000Z",
          "wordCount": 871,
          "title": "Keyframes Studio — Create TikTok videos of your screen",
          "imageUrl": "https://ph-files.imgix.net/d2c4ea1c-c7f8-42cc-aebf-68a55b9eb7e8.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/yippity",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/yippity",
          "publishedOn": "2022-09-10T17:12:55.000Z",
          "wordCount": 960,
          "title": "Yippity — Your AI study pal",
          "imageUrl": "https://ph-files.imgix.net/4bd46f3c-3b9f-415f-b7ba-30593f9a995a.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/maya-ai-ad19aaaa-2b42-438e-978a-58c5a660b55f",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/maya-ai-ad19aaaa-2b42-438e-978a-58c5a660b55f",
          "publishedOn": "2022-09-10T15:36:24.000Z",
          "wordCount": 975,
          "title": "Maya AI — Create opportunities from unstructured data",
          "imageUrl": "https://ph-files.imgix.net/c9c3a898-567d-4fca-ba0c-c335761308cf.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/heydays",
          "author": null,
          "description": "https://www.youtube.com/shorts/q...\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/heydays",
          "publishedOn": "2022-09-10T13:46:48.000Z",
          "wordCount": 1010,
          "title": "HeyDays — Live streams that feature viewers for 1-5 minutes at a time",
          "imageUrl": "https://ph-files.imgix.net/018d3a12-6c08-4d2a-99fa-7809386733af.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/lunchbox-open",
          "author": null,
          "description": "https://lunchbox.io/open\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/lunchbox-open",
          "publishedOn": "2022-09-09T22:22:50.000Z",
          "wordCount": 913,
          "title": "Lunchbox Open — Open network of integrations to scale restaurant operations",
          "imageUrl": "https://ph-files.imgix.net/95ce4f04-c246-4f7f-a955-926b936a0da5.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/dark-mode-resume",
          "author": null,
          "description": "@dany_sosa worked on getting the colors just right.  It turns out Black Black is the wrong kind of black, as the contrast between white and black is too much.  So it’s Really Dark Gray Black per the Material Design recommendations: https://material.io/design/color... \n\nThat turns out to have complications with things like bullet points, dividing lines, and formatting in general, so many thanks to @jacktilly who 💪 wrestled with the mighty Google Docs API to make the transition between 🌞 Light Mode and 🌚 Dark Mode painless.\n\nWe also wanted to prove that we can produce these transitions seamlessly and programmatically.  That will enable future cool stuff from Leet. 🎆\n\nCan you actually use your Dark Mode resume in job applications? \n\nYes, I think you can, especially in technology-driven or creative fields.  The format is what hiring teams and recruiters expect - there’s nothing funny, strange, or jarring about the content presented - so the Dark Mode will likely attract attention for the right reasons 💸 - your forward-looking willingness to embrace change and the future.🧑‍🚀\n\nMarc Cenedella\nFounder & CEO\nLeet Resumes\n\n🚨 p.s. If you’ve already completed your Light Mode resume with us, just log in, and we’ve added Dark Mode for free.\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/dark-mode-resume",
          "publishedOn": "2022-09-09T21:10:35.000Z",
          "wordCount": 984,
          "title": "Dark Mode Resume — Dark mode resume for a modern & awesome look",
          "imageUrl": "https://ph-files.imgix.net/d5a17316-741e-4368-a500-ab224fc1d671.gif?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/ashby",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/ashby",
          "publishedOn": "2022-09-09T15:07:40.000Z",
          "wordCount": 1196,
          "title": "Ashby — A powerful all-in-one recruiting tool – not just another ATS",
          "imageUrl": "https://ph-files.imgix.net/e31e3676-90dc-44b1-bc0e-4f19105691c5.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/appsources",
          "author": null,
          "description": "info@appsources.io.\n\nThank you so much!\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/appsources",
          "publishedOn": "2022-09-09T05:02:00.000Z",
          "wordCount": 934,
          "title": "AppSources — Supercharge your next iOS mobile app project",
          "imageUrl": "https://ph-files.imgix.net/1cc1f677-bad5-4538-9ec2-46c13bd5a577.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/play-973589da-1c05-4824-ac54-142fefe8cf67",
          "author": null,
          "description": "Discussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/play-973589da-1c05-4824-ac54-142fefe8cf67",
          "publishedOn": "2022-09-07T23:47:37.000Z",
          "wordCount": 988,
          "title": "Play — The first native iOS design tool",
          "imageUrl": "https://ph-files.imgix.net/a3c5c233-8550-440d-a1b3-9dd925699082.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/plasma-wallet",
          "author": null,
          "description": "Uncompromising security. Protect your funds with Key iCloud backup, Apple Secure Enclave support, Biometric authentication, and Passcode lock.\n\n💎 Direct integration with all actions. Swap, invest and earn passive staking income. Buy, Sell, Save, and Send crypto directly from your portfolio page.\n\n💎 Advanced Portfolio Management. The most sophisticated portfolio management for a bird's eye view of all your DeFi positions across all chains, with accurate and real-time on-chain data.\n\n💎 Advanced Trading and DeFi features. Swap at the deepest liquidities and best rates. Switch between networks instantly.\n\n💎 Fiat on-ramp. Integration with MoonPay, a popular global fiat on-ramp gateway, allows you to purchase crypto with a card, Apple Pay, and bank wire in 150+ countries.\n\n💎 Global Market. …",
          "link": "https://www.producthunt.com/posts/plasma-wallet",
          "publishedOn": "2022-09-07T05:52:36.000Z",
          "wordCount": 1003,
          "title": "Plasma Wallet — All-in-one Mobile App for your crypto, DeFi and NFTs",
          "imageUrl": "https://ph-files.imgix.net/6bd6dfc1-da4a-4b6c-9045-e3de0e845166.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/stack-reviews",
          "author": null,
          "description": "https://stackreviews.io/contact or via email: feedback@stackreviews.io!\n\nWe're currently working on a lot of exciting features and are planning on introducing them in the coming weeks! Stay tuned, we're just getting started. There's a lot more to come to SR.\n\nWant to read more? Read our initial blog post that covers everything about Stack Reviews: https://stackreviews.io/blog/the... !\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/stack-reviews",
          "publishedOn": "2022-09-03T13:07:36.000Z",
          "wordCount": 901,
          "title": "Stack Reviews — Bringing the developer community a techstack closer together",
          "imageUrl": "https://ph-files.imgix.net/0527a2ee-a682-4337-a922-e3273e17aad0.png?auto=format&fit=crop&frame=1&h=512&w=1024"
        },
        {
          "id": "https://www.producthunt.com/posts/edge-flags-by-devcycle",
          "author": null,
          "description": "https://docs.devcycle.com/docs/h...\n              ”\n              \nDiscussion\n            |\n            Link",
          "link": "https://www.producthunt.com/posts/edge-flags-by-devcycle",
          "publishedOn": "2022-08-29T02:05:00.000Z",
          "wordCount": 1033,
          "title": "Edge Flags by DevCycle — Edge powered feature flags instantly delivered globally",
          "imageUrl": "https://ph-files.imgix.net/070c4d71-f978-4050-8ed3-45338f8d86b5.jpeg?auto=format&fit=crop&frame=1&h=512&w=1024"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}